TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
       3              ;* Date/Time created: Wed Nov 06 13:30:55 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Documents and Settings\Jordan\My Documents\Dropbox\masc\research
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    5387                      .dwattr $C$DW$T$393, DW_AT_language(DW_LANG_C)
    5388                      .dwattr $C$DW$T$393, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    5389                      .dwattr $C$DW$T$393, DW_AT_decl_line(0x2ab0)
    5390                      .dwattr $C$DW$T$393, DW_AT_decl_column(0x13)
    5391              $C$DW$T$394     .dwtag  DW_TAG_typedef, DW_AT_name("_iq3")
    5392                      .dwattr $C$DW$T$394, DW_AT_type(*$C$DW$T$12)
    5393                      .dwattr $C$DW$T$394, DW_AT_language(DW_LANG_C)
    5394                      .dwattr $C$DW$T$394, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    5395                      .dwattr $C$DW$T$394, DW_AT_decl_line(0x2ab1)
    5396                      .dwattr $C$DW$T$394, DW_AT_decl_column(0x13)
    5397              $C$DW$T$395     .dwtag  DW_TAG_typedef, DW_AT_name("_iq2")
    5398                      .dwattr $C$DW$T$395, DW_AT_type(*$C$DW$T$12)
    5399                      .dwattr $C$DW$T$395, DW_AT_language(DW_LANG_C)
    5400                      .dwattr $C$DW$T$395, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    5401                      .dwattr $C$DW$T$395, DW_AT_decl_line(0x2ab2)
    5402                      .dwattr $C$DW$T$395, DW_AT_decl_column(0x13)
    5403              $C$DW$T$396     .dwtag  DW_TAG_typedef, DW_AT_name("_iq1")
    5404                      .dwattr $C$DW$T$396, DW_AT_type(*$C$DW$T$12)
    5405                      .dwattr $C$DW$T$396, DW_AT_language(DW_LANG_C)
    5406                      .dwattr $C$DW$T$396, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    5407                      .dwattr $C$DW$T$396, DW_AT_decl_line(0x2ab3)
    5408                      .dwattr $C$DW$T$396, DW_AT_decl_column(0x13)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  115

    5409              $C$DW$T$13      .dwtag  DW_TAG_base_type
    5410                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5411                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    5412                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    5413              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
    5414                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$13)
    5415                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5416                      .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5417                      .dwattr $C$DW$T$51, DW_AT_decl_line(0x16)
    5418                      .dwattr $C$DW$T$51, DW_AT_decl_column(0x19)
    5419              $C$DW$T$14      .dwtag  DW_TAG_base_type
    5420                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    5421                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    5422                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    5423              $C$DW$T$15      .dwtag  DW_TAG_base_type
    5424                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    5425                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    5426                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    5427              $C$DW$T$16      .dwtag  DW_TAG_base_type
    5428                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    5429                      .dwattr $C$DW$T$16, DW_AT_name("float")
    5430                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    5431              $C$DW$T$398     .dwtag  DW_TAG_typedef, DW_AT_name("float32")
    5432                      .dwattr $C$DW$T$398, DW_AT_type(*$C$DW$T$16)
    5433                      .dwattr $C$DW$T$398, DW_AT_language(DW_LANG_C)
    5434                      .dwattr $C$DW$T$398, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    5435                      .dwattr $C$DW$T$398, DW_AT_decl_line(0x17)
    5436                      .dwattr $C$DW$T$398, DW_AT_decl_column(0x19)
    5437              $C$DW$T$17      .dwtag  DW_TAG_base_type
    5438                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    5439                      .dwattr $C$DW$T$17, DW_AT_name("double")
    5440                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    5441              $C$DW$T$18      .dwtag  DW_TAG_base_type
    5442                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    5443                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    5444                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    5445              $C$DW$T$399     .dwtag  DW_TAG_typedef, DW_AT_name("float64")
    5446                      .dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$18)
    5447                      .dwattr $C$DW$T$399, DW_AT_language(DW_LANG_C)
    5448                      .dwattr $C$DW$T$399, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    5449                      .dwattr $C$DW$T$399, DW_AT_decl_line(0x18)
    5450                      .dwattr $C$DW$T$399, DW_AT_decl_column(0x19)
    5451              
    5452              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5453                      .dwattr $C$DW$T$20, DW_AT_name("ADCTRL1_BITS")
    5454                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    5455              $C$DW$280       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    5457                      .dwattr $C$DW$280, DW_AT_name("rsvd1")
    5458                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_rsvd1")
    5459                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    5460                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5461                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5462                      .dwattr $C$DW$280, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5463                      .dwattr $C$DW$280, DW_AT_decl_line(0x19e)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  116

    5464                      .dwattr $C$DW$280, DW_AT_decl_column(0x0d)
    5465              $C$DW$281       .dwtag  DW_TAG_member
    5466                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    5467                      .dwattr $C$DW$281, DW_AT_name("SEQ_CASC")
    5468                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_SEQ_CASC")
    5469                      .dwattr $C$DW$281, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5470                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5471                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5472                      .dwattr $C$DW$281, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5473                      .dwattr $C$DW$281, DW_AT_decl_line(0x19f)
    5474                      .dwattr $C$DW$281, DW_AT_decl_column(0x0d)
    5475              $C$DW$282       .dwtag  DW_TAG_member
    5476                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    5477                      .dwattr $C$DW$282, DW_AT_name("SEQ_OVRD")
    5478                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SEQ_OVRD")
    5479                      .dwattr $C$DW$282, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5480                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5481                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5482                      .dwattr $C$DW$282, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5483                      .dwattr $C$DW$282, DW_AT_decl_line(0x1a0)
    5484                      .dwattr $C$DW$282, DW_AT_decl_column(0x0d)
    5485              $C$DW$283       .dwtag  DW_TAG_member
    5486                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    5487                      .dwattr $C$DW$283, DW_AT_name("CONT_RUN")
    5488                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_CONT_RUN")
    5489                      .dwattr $C$DW$283, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5490                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5491                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5492                      .dwattr $C$DW$283, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5493                      .dwattr $C$DW$283, DW_AT_decl_line(0x1a1)
    5494                      .dwattr $C$DW$283, DW_AT_decl_column(0x0d)
    5495              $C$DW$284       .dwtag  DW_TAG_member
    5496                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    5497                      .dwattr $C$DW$284, DW_AT_name("CPS")
    5498                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_CPS")
    5499                      .dwattr $C$DW$284, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5500                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5501                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5502                      .dwattr $C$DW$284, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5503                      .dwattr $C$DW$284, DW_AT_decl_line(0x1a2)
    5504                      .dwattr $C$DW$284, DW_AT_decl_column(0x0d)
    5505              $C$DW$285       .dwtag  DW_TAG_member
    5506                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    5507                      .dwattr $C$DW$285, DW_AT_name("ACQ_PS")
    5508                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_ACQ_PS")
    5509                      .dwattr $C$DW$285, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    5510                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5511                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5512                      .dwattr $C$DW$285, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5513                      .dwattr $C$DW$285, DW_AT_decl_line(0x1a3)
    5514                      .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    5515              $C$DW$286       .dwtag  DW_TAG_member
    5516                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    5517                      .dwattr $C$DW$286, DW_AT_name("SUSMOD")
    5518                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_SUSMOD")
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  117

    5519                      .dwattr $C$DW$286, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    5520                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5521                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5522                      .dwattr $C$DW$286, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5523                      .dwattr $C$DW$286, DW_AT_decl_line(0x1a4)
    5524                      .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    5525              $C$DW$287       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    5527                      .dwattr $C$DW$287, DW_AT_name("RESET")
    5528                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RESET")
    5529                      .dwattr $C$DW$287, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5530                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5531                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5532                      .dwattr $C$DW$287, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5533                      .dwattr $C$DW$287, DW_AT_decl_line(0x1a5)
    5534                      .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    5535              $C$DW$288       .dwtag  DW_TAG_member
    5536                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    5537                      .dwattr $C$DW$288, DW_AT_name("rsvd2")
    5538                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_rsvd2")
    5539                      .dwattr $C$DW$288, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5540                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5541                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5542                      .dwattr $C$DW$288, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5543                      .dwattr $C$DW$288, DW_AT_decl_line(0x1a6)
    5544                      .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    5545                      .dwendtag $C$DW$T$20
    5546              
    5547                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5548                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x19d)
    5549                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x08)
    5550              
    5551              $C$DW$T$21      .dwtag  DW_TAG_union_type
    5552                      .dwattr $C$DW$T$21, DW_AT_name("ADCTRL1_REG")
    5553                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    5554              $C$DW$289       .dwtag  DW_TAG_member
    5555                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    5556                      .dwattr $C$DW$289, DW_AT_name("all")
    5557                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_all")
    5558                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5559                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5560                      .dwattr $C$DW$289, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5561                      .dwattr $C$DW$289, DW_AT_decl_line(0x1ab)
    5562                      .dwattr $C$DW$289, DW_AT_decl_column(0x1a)
    5563              $C$DW$290       .dwtag  DW_TAG_member
    5564                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    5565                      .dwattr $C$DW$290, DW_AT_name("bit")
    5566                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_bit")
    5567                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5568                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5569                      .dwattr $C$DW$290, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5570                      .dwattr $C$DW$290, DW_AT_decl_line(0x1ac)
    5571                      .dwattr $C$DW$290, DW_AT_decl_column(0x1a)
    5572                      .dwendtag $C$DW$T$21
    5573              
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  118

    5574                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5575                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x1aa)
    5576                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x07)
    5577              
    5578              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5579                      .dwattr $C$DW$T$22, DW_AT_name("ADCTRL2_BITS")
    5580                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    5581              $C$DW$291       .dwtag  DW_TAG_member
    5582                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    5583                      .dwattr $C$DW$291, DW_AT_name("EPWM_SOCB_SEQ2")
    5584                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ2")
    5585                      .dwattr $C$DW$291, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5586                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5587                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5588                      .dwattr $C$DW$291, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5589                      .dwattr $C$DW$291, DW_AT_decl_line(0x1b1)
    5590                      .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    5591              $C$DW$292       .dwtag  DW_TAG_member
    5592                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    5593                      .dwattr $C$DW$292, DW_AT_name("rsvd1")
    5594                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_rsvd1")
    5595                      .dwattr $C$DW$292, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5596                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5597                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5598                      .dwattr $C$DW$292, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5599                      .dwattr $C$DW$292, DW_AT_decl_line(0x1b2)
    5600                      .dwattr $C$DW$292, DW_AT_decl_column(0x0d)
    5601              $C$DW$293       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    5603                      .dwattr $C$DW$293, DW_AT_name("INT_MOD_SEQ2")
    5604                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
    5605                      .dwattr $C$DW$293, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5606                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5607                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5608                      .dwattr $C$DW$293, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5609                      .dwattr $C$DW$293, DW_AT_decl_line(0x1b3)
    5610                      .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    5611              $C$DW$294       .dwtag  DW_TAG_member
    5612                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    5613                      .dwattr $C$DW$294, DW_AT_name("INT_ENA_SEQ2")
    5614                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
    5615                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5616                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5617                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5618                      .dwattr $C$DW$294, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5619                      .dwattr $C$DW$294, DW_AT_decl_line(0x1b4)
    5620                      .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    5621              $C$DW$295       .dwtag  DW_TAG_member
    5622                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    5623                      .dwattr $C$DW$295, DW_AT_name("rsvd2")
    5624                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_rsvd2")
    5625                      .dwattr $C$DW$295, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5626                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5627                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5628                      .dwattr $C$DW$295, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  119

    5629                      .dwattr $C$DW$295, DW_AT_decl_line(0x1b5)
    5630                      .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    5631              $C$DW$296       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    5633                      .dwattr $C$DW$296, DW_AT_name("SOC_SEQ2")
    5634                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_SOC_SEQ2")
    5635                      .dwattr $C$DW$296, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5636                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5637                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5638                      .dwattr $C$DW$296, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5639                      .dwattr $C$DW$296, DW_AT_decl_line(0x1b6)
    5640                      .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    5641              $C$DW$297       .dwtag  DW_TAG_member
    5642                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    5643                      .dwattr $C$DW$297, DW_AT_name("RST_SEQ2")
    5644                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RST_SEQ2")
    5645                      .dwattr $C$DW$297, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5646                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5647                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5648                      .dwattr $C$DW$297, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5649                      .dwattr $C$DW$297, DW_AT_decl_line(0x1b7)
    5650                      .dwattr $C$DW$297, DW_AT_decl_column(0x0d)
    5651              $C$DW$298       .dwtag  DW_TAG_member
    5652                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    5653                      .dwattr $C$DW$298, DW_AT_name("EXT_SOC_SEQ1")
    5654                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
    5655                      .dwattr $C$DW$298, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5656                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5657                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5658                      .dwattr $C$DW$298, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5659                      .dwattr $C$DW$298, DW_AT_decl_line(0x1b8)
    5660                      .dwattr $C$DW$298, DW_AT_decl_column(0x0d)
    5661              $C$DW$299       .dwtag  DW_TAG_member
    5662                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    5663                      .dwattr $C$DW$299, DW_AT_name("EPWM_SOCA_SEQ1")
    5664                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_EPWM_SOCA_SEQ1")
    5665                      .dwattr $C$DW$299, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5666                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5667                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5668                      .dwattr $C$DW$299, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5669                      .dwattr $C$DW$299, DW_AT_decl_line(0x1b9)
    5670                      .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    5671              $C$DW$300       .dwtag  DW_TAG_member
    5672                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    5673                      .dwattr $C$DW$300, DW_AT_name("rsvd3")
    5674                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_rsvd3")
    5675                      .dwattr $C$DW$300, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5676                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5677                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5678                      .dwattr $C$DW$300, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5679                      .dwattr $C$DW$300, DW_AT_decl_line(0x1ba)
    5680                      .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    5681              $C$DW$301       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    5683                      .dwattr $C$DW$301, DW_AT_name("INT_MOD_SEQ1")
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  120

    5684                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    5685                      .dwattr $C$DW$301, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5686                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5687                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5688                      .dwattr $C$DW$301, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5689                      .dwattr $C$DW$301, DW_AT_decl_line(0x1bb)
    5690                      .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    5691              $C$DW$302       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    5693                      .dwattr $C$DW$302, DW_AT_name("INT_ENA_SEQ1")
    5694                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    5695                      .dwattr $C$DW$302, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5696                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5697                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5698                      .dwattr $C$DW$302, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5699                      .dwattr $C$DW$302, DW_AT_decl_line(0x1bc)
    5700                      .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
    5701              $C$DW$303       .dwtag  DW_TAG_member
    5702                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    5703                      .dwattr $C$DW$303, DW_AT_name("rsvd4")
    5704                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_rsvd4")
    5705                      .dwattr $C$DW$303, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5706                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5707                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5708                      .dwattr $C$DW$303, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5709                      .dwattr $C$DW$303, DW_AT_decl_line(0x1bd)
    5710                      .dwattr $C$DW$303, DW_AT_decl_column(0x0d)
    5711              $C$DW$304       .dwtag  DW_TAG_member
    5712                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    5713                      .dwattr $C$DW$304, DW_AT_name("SOC_SEQ1")
    5714                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_SOC_SEQ1")
    5715                      .dwattr $C$DW$304, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5716                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5717                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5718                      .dwattr $C$DW$304, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5719                      .dwattr $C$DW$304, DW_AT_decl_line(0x1be)
    5720                      .dwattr $C$DW$304, DW_AT_decl_column(0x0d)
    5721              $C$DW$305       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    5723                      .dwattr $C$DW$305, DW_AT_name("RST_SEQ1")
    5724                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RST_SEQ1")
    5725                      .dwattr $C$DW$305, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5726                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5727                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5728                      .dwattr $C$DW$305, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5729                      .dwattr $C$DW$305, DW_AT_decl_line(0x1bf)
    5730                      .dwattr $C$DW$305, DW_AT_decl_column(0x0d)
    5731              $C$DW$306       .dwtag  DW_TAG_member
    5732                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    5733                      .dwattr $C$DW$306, DW_AT_name("EPWM_SOCB_SEQ")
    5734                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ")
    5735                      .dwattr $C$DW$306, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5736                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5737                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5738                      .dwattr $C$DW$306, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  121

    5739                      .dwattr $C$DW$306, DW_AT_decl_line(0x1c0)
    5740                      .dwattr $C$DW$306, DW_AT_decl_column(0x0d)
    5741                      .dwendtag $C$DW$T$22
    5742              
    5743                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5744                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x1b0)
    5745                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
    5746              
    5747              $C$DW$T$23      .dwtag  DW_TAG_union_type
    5748                      .dwattr $C$DW$T$23, DW_AT_name("ADCTRL2_REG")
    5749                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    5750              $C$DW$307       .dwtag  DW_TAG_member
    5751                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    5752                      .dwattr $C$DW$307, DW_AT_name("all")
    5753                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_all")
    5754                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5755                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5756                      .dwattr $C$DW$307, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5757                      .dwattr $C$DW$307, DW_AT_decl_line(0x1c5)
    5758                      .dwattr $C$DW$307, DW_AT_decl_column(0x1a)
    5759              $C$DW$308       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
    5761                      .dwattr $C$DW$308, DW_AT_name("bit")
    5762                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_bit")
    5763                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5764                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5765                      .dwattr $C$DW$308, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5766                      .dwattr $C$DW$308, DW_AT_decl_line(0x1c6)
    5767                      .dwattr $C$DW$308, DW_AT_decl_column(0x1a)
    5768                      .dwendtag $C$DW$T$23
    5769              
    5770                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5771                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x1c4)
    5772                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x07)
    5773              
    5774              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5775                      .dwattr $C$DW$T$24, DW_AT_name("ADCMAXCONV_BITS")
    5776                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    5777              $C$DW$309       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    5779                      .dwattr $C$DW$309, DW_AT_name("MAX_CONV1")
    5780                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_MAX_CONV1")
    5781                      .dwattr $C$DW$309, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    5782                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5783                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5784                      .dwattr $C$DW$309, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5785                      .dwattr $C$DW$309, DW_AT_decl_line(0x1d9)
    5786                      .dwattr $C$DW$309, DW_AT_decl_column(0x0d)
    5787              $C$DW$310       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    5789                      .dwattr $C$DW$310, DW_AT_name("MAX_CONV2")
    5790                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_MAX_CONV2")
    5791                      .dwattr $C$DW$310, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    5792                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5793                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  122

    5794                      .dwattr $C$DW$310, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5795                      .dwattr $C$DW$310, DW_AT_decl_line(0x1da)
    5796                      .dwattr $C$DW$310, DW_AT_decl_column(0x0d)
    5797              $C$DW$311       .dwtag  DW_TAG_member
    5798                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    5799                      .dwattr $C$DW$311, DW_AT_name("rsvd1")
    5800                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_rsvd1")
    5801                      .dwattr $C$DW$311, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    5802                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5803                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5804                      .dwattr $C$DW$311, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5805                      .dwattr $C$DW$311, DW_AT_decl_line(0x1db)
    5806                      .dwattr $C$DW$311, DW_AT_decl_column(0x0d)
    5807                      .dwendtag $C$DW$T$24
    5808              
    5809                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5810                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x1d8)
    5811                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x08)
    5812              
    5813              $C$DW$T$25      .dwtag  DW_TAG_union_type
    5814                      .dwattr $C$DW$T$25, DW_AT_name("ADCMAXCONV_REG")
    5815                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    5816              $C$DW$312       .dwtag  DW_TAG_member
    5817                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    5818                      .dwattr $C$DW$312, DW_AT_name("all")
    5819                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_all")
    5820                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5821                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5822                      .dwattr $C$DW$312, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5823                      .dwattr $C$DW$312, DW_AT_decl_line(0x1df)
    5824                      .dwattr $C$DW$312, DW_AT_decl_column(0x1c)
    5825              $C$DW$313       .dwtag  DW_TAG_member
    5826                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$24)
    5827                      .dwattr $C$DW$313, DW_AT_name("bit")
    5828                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_bit")
    5829                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5830                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5831                      .dwattr $C$DW$313, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5832                      .dwattr $C$DW$313, DW_AT_decl_line(0x1e0)
    5833                      .dwattr $C$DW$313, DW_AT_decl_column(0x1c)
    5834                      .dwendtag $C$DW$T$25
    5835              
    5836                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5837                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x1de)
    5838                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x07)
    5839              
    5840              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5841                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ1_BITS")
    5842                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5843              $C$DW$314       .dwtag  DW_TAG_member
    5844                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    5845                      .dwattr $C$DW$314, DW_AT_name("CONV00")
    5846                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_CONV00")
    5847                      .dwattr $C$DW$314, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    5848                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  123

    5849                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5850                      .dwattr $C$DW$314, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5851                      .dwattr $C$DW$314, DW_AT_decl_line(0x1e5)
    5852                      .dwattr $C$DW$314, DW_AT_decl_column(0x0d)
    5853              $C$DW$315       .dwtag  DW_TAG_member
    5854                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    5855                      .dwattr $C$DW$315, DW_AT_name("CONV01")
    5856                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_CONV01")
    5857                      .dwattr $C$DW$315, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    5858                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5859                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5860                      .dwattr $C$DW$315, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5861                      .dwattr $C$DW$315, DW_AT_decl_line(0x1e6)
    5862                      .dwattr $C$DW$315, DW_AT_decl_column(0x0d)
    5863              $C$DW$316       .dwtag  DW_TAG_member
    5864                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    5865                      .dwattr $C$DW$316, DW_AT_name("CONV02")
    5866                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_CONV02")
    5867                      .dwattr $C$DW$316, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    5868                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5869                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5870                      .dwattr $C$DW$316, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5871                      .dwattr $C$DW$316, DW_AT_decl_line(0x1e7)
    5872                      .dwattr $C$DW$316, DW_AT_decl_column(0x0d)
    5873              $C$DW$317       .dwtag  DW_TAG_member
    5874                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    5875                      .dwattr $C$DW$317, DW_AT_name("CONV03")
    5876                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_CONV03")
    5877                      .dwattr $C$DW$317, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    5878                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5879                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5880                      .dwattr $C$DW$317, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5881                      .dwattr $C$DW$317, DW_AT_decl_line(0x1e8)
    5882                      .dwattr $C$DW$317, DW_AT_decl_column(0x0d)
    5883                      .dwendtag $C$DW$T$26
    5884              
    5885                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5886                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x1e4)
    5887                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    5888              
    5889              $C$DW$T$27      .dwtag  DW_TAG_union_type
    5890                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ1_REG")
    5891                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5892              $C$DW$318       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    5894                      .dwattr $C$DW$318, DW_AT_name("all")
    5895                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_all")
    5896                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5897                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5898                      .dwattr $C$DW$318, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5899                      .dwattr $C$DW$318, DW_AT_decl_line(0x1ec)
    5900                      .dwattr $C$DW$318, DW_AT_decl_column(0x1e)
    5901              $C$DW$319       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$26)
    5903                      .dwattr $C$DW$319, DW_AT_name("bit")
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  124

    5904                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_bit")
    5905                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5906                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5907                      .dwattr $C$DW$319, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5908                      .dwattr $C$DW$319, DW_AT_decl_line(0x1ed)
    5909                      .dwattr $C$DW$319, DW_AT_decl_column(0x1e)
    5910                      .dwendtag $C$DW$T$27
    5911              
    5912                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5913                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x1eb)
    5914                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    5915              
    5916              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5917                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ2_BITS")
    5918                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5919              $C$DW$320       .dwtag  DW_TAG_member
    5920                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    5921                      .dwattr $C$DW$320, DW_AT_name("CONV04")
    5922                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_CONV04")
    5923                      .dwattr $C$DW$320, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    5924                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5925                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5926                      .dwattr $C$DW$320, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5927                      .dwattr $C$DW$320, DW_AT_decl_line(0x1f1)
    5928                      .dwattr $C$DW$320, DW_AT_decl_column(0x0d)
    5929              $C$DW$321       .dwtag  DW_TAG_member
    5930                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    5931                      .dwattr $C$DW$321, DW_AT_name("CONV05")
    5932                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_CONV05")
    5933                      .dwattr $C$DW$321, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    5934                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5935                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5936                      .dwattr $C$DW$321, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5937                      .dwattr $C$DW$321, DW_AT_decl_line(0x1f2)
    5938                      .dwattr $C$DW$321, DW_AT_decl_column(0x0d)
    5939              $C$DW$322       .dwtag  DW_TAG_member
    5940                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    5941                      .dwattr $C$DW$322, DW_AT_name("CONV06")
    5942                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_CONV06")
    5943                      .dwattr $C$DW$322, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    5944                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5945                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5946                      .dwattr $C$DW$322, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5947                      .dwattr $C$DW$322, DW_AT_decl_line(0x1f3)
    5948                      .dwattr $C$DW$322, DW_AT_decl_column(0x0d)
    5949              $C$DW$323       .dwtag  DW_TAG_member
    5950                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    5951                      .dwattr $C$DW$323, DW_AT_name("CONV07")
    5952                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_CONV07")
    5953                      .dwattr $C$DW$323, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    5954                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5955                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5956                      .dwattr $C$DW$323, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5957                      .dwattr $C$DW$323, DW_AT_decl_line(0x1f4)
    5958                      .dwattr $C$DW$323, DW_AT_decl_column(0x0d)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  125

    5959                      .dwendtag $C$DW$T$28
    5960              
    5961                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5962                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x1f0)
    5963                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x08)
    5964              
    5965              $C$DW$T$29      .dwtag  DW_TAG_union_type
    5966                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ2_REG")
    5967                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5968              $C$DW$324       .dwtag  DW_TAG_member
    5969                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    5970                      .dwattr $C$DW$324, DW_AT_name("all")
    5971                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_all")
    5972                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5973                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5974                      .dwattr $C$DW$324, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5975                      .dwattr $C$DW$324, DW_AT_decl_line(0x1f8)
    5976                      .dwattr $C$DW$324, DW_AT_decl_column(0x1e)
    5977              $C$DW$325       .dwtag  DW_TAG_member
    5978                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$28)
    5979                      .dwattr $C$DW$325, DW_AT_name("bit")
    5980                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_bit")
    5981                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5982                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5983                      .dwattr $C$DW$325, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    5984                      .dwattr $C$DW$325, DW_AT_decl_line(0x1f9)
    5985                      .dwattr $C$DW$325, DW_AT_decl_column(0x1e)
    5986                      .dwendtag $C$DW$T$29
    5987              
    5988                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    5989                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x1f7)
    5990                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
    5991              
    5992              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5993                      .dwattr $C$DW$T$30, DW_AT_name("ADCCHSELSEQ3_BITS")
    5994                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    5995              $C$DW$326       .dwtag  DW_TAG_member
    5996                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    5997                      .dwattr $C$DW$326, DW_AT_name("CONV08")
    5998                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_CONV08")
    5999                      .dwattr $C$DW$326, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    6000                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6001                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6002                      .dwattr $C$DW$326, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6003                      .dwattr $C$DW$326, DW_AT_decl_line(0x1fd)
    6004                      .dwattr $C$DW$326, DW_AT_decl_column(0x0d)
    6005              $C$DW$327       .dwtag  DW_TAG_member
    6006                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    6007                      .dwattr $C$DW$327, DW_AT_name("CONV09")
    6008                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_CONV09")
    6009                      .dwattr $C$DW$327, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    6010                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6011                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6012                      .dwattr $C$DW$327, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6013                      .dwattr $C$DW$327, DW_AT_decl_line(0x1fe)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  126

    6014                      .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    6015              $C$DW$328       .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    6017                      .dwattr $C$DW$328, DW_AT_name("CONV10")
    6018                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_CONV10")
    6019                      .dwattr $C$DW$328, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    6020                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6021                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6022                      .dwattr $C$DW$328, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6023                      .dwattr $C$DW$328, DW_AT_decl_line(0x1ff)
    6024                      .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    6025              $C$DW$329       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    6027                      .dwattr $C$DW$329, DW_AT_name("CONV11")
    6028                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_CONV11")
    6029                      .dwattr $C$DW$329, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    6030                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6031                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6032                      .dwattr $C$DW$329, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6033                      .dwattr $C$DW$329, DW_AT_decl_line(0x200)
    6034                      .dwattr $C$DW$329, DW_AT_decl_column(0x0d)
    6035                      .dwendtag $C$DW$T$30
    6036              
    6037                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6038                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x1fc)
    6039                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x08)
    6040              
    6041              $C$DW$T$31      .dwtag  DW_TAG_union_type
    6042                      .dwattr $C$DW$T$31, DW_AT_name("ADCCHSELSEQ3_REG")
    6043                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    6044              $C$DW$330       .dwtag  DW_TAG_member
    6045                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    6046                      .dwattr $C$DW$330, DW_AT_name("all")
    6047                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_all")
    6048                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6049                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6050                      .dwattr $C$DW$330, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6051                      .dwattr $C$DW$330, DW_AT_decl_line(0x204)
    6052                      .dwattr $C$DW$330, DW_AT_decl_column(0x1e)
    6053              $C$DW$331       .dwtag  DW_TAG_member
    6054                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$30)
    6055                      .dwattr $C$DW$331, DW_AT_name("bit")
    6056                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_bit")
    6057                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6058                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6059                      .dwattr $C$DW$331, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6060                      .dwattr $C$DW$331, DW_AT_decl_line(0x205)
    6061                      .dwattr $C$DW$331, DW_AT_decl_column(0x1e)
    6062                      .dwendtag $C$DW$T$31
    6063              
    6064                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6065                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x203)
    6066                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    6067              
    6068              $C$DW$T$32      .dwtag  DW_TAG_structure_type
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  127

    6069                      .dwattr $C$DW$T$32, DW_AT_name("ADCCHSELSEQ4_BITS")
    6070                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    6071              $C$DW$332       .dwtag  DW_TAG_member
    6072                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    6073                      .dwattr $C$DW$332, DW_AT_name("CONV12")
    6074                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_CONV12")
    6075                      .dwattr $C$DW$332, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    6076                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6077                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6078                      .dwattr $C$DW$332, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6079                      .dwattr $C$DW$332, DW_AT_decl_line(0x209)
    6080                      .dwattr $C$DW$332, DW_AT_decl_column(0x0d)
    6081              $C$DW$333       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    6083                      .dwattr $C$DW$333, DW_AT_name("CONV13")
    6084                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_CONV13")
    6085                      .dwattr $C$DW$333, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    6086                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6087                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6088                      .dwattr $C$DW$333, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6089                      .dwattr $C$DW$333, DW_AT_decl_line(0x20a)
    6090                      .dwattr $C$DW$333, DW_AT_decl_column(0x0d)
    6091              $C$DW$334       .dwtag  DW_TAG_member
    6092                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    6093                      .dwattr $C$DW$334, DW_AT_name("CONV14")
    6094                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_CONV14")
    6095                      .dwattr $C$DW$334, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    6096                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6097                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6098                      .dwattr $C$DW$334, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6099                      .dwattr $C$DW$334, DW_AT_decl_line(0x20b)
    6100                      .dwattr $C$DW$334, DW_AT_decl_column(0x0d)
    6101              $C$DW$335       .dwtag  DW_TAG_member
    6102                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    6103                      .dwattr $C$DW$335, DW_AT_name("CONV15")
    6104                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_CONV15")
    6105                      .dwattr $C$DW$335, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    6106                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6107                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6108                      .dwattr $C$DW$335, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6109                      .dwattr $C$DW$335, DW_AT_decl_line(0x20c)
    6110                      .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
    6111                      .dwendtag $C$DW$T$32
    6112              
    6113                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6114                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x208)
    6115                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x08)
    6116              
    6117              $C$DW$T$33      .dwtag  DW_TAG_union_type
    6118                      .dwattr $C$DW$T$33, DW_AT_name("ADCCHSELSEQ4_REG")
    6119                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6120              $C$DW$336       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    6122                      .dwattr $C$DW$336, DW_AT_name("all")
    6123                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_all")
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  128

    6124                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6125                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6126                      .dwattr $C$DW$336, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6127                      .dwattr $C$DW$336, DW_AT_decl_line(0x210)
    6128                      .dwattr $C$DW$336, DW_AT_decl_column(0x1e)
    6129              $C$DW$337       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$32)
    6131                      .dwattr $C$DW$337, DW_AT_name("bit")
    6132                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_bit")
    6133                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6134                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6135                      .dwattr $C$DW$337, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6136                      .dwattr $C$DW$337, DW_AT_decl_line(0x211)
    6137                      .dwattr $C$DW$337, DW_AT_decl_column(0x1e)
    6138                      .dwendtag $C$DW$T$33
    6139              
    6140                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6141                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x20f)
    6142                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
    6143              
    6144              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6145                      .dwattr $C$DW$T$34, DW_AT_name("ADCASEQSR_BITS")
    6146                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6147              $C$DW$338       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    6149                      .dwattr $C$DW$338, DW_AT_name("SEQ1_STATE")
    6150                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_SEQ1_STATE")
    6151                      .dwattr $C$DW$338, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    6152                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6153                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6154                      .dwattr $C$DW$338, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6155                      .dwattr $C$DW$338, DW_AT_decl_line(0x1cb)
    6156                      .dwattr $C$DW$338, DW_AT_decl_column(0x0d)
    6157              $C$DW$339       .dwtag  DW_TAG_member
    6158                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    6159                      .dwattr $C$DW$339, DW_AT_name("SEQ2_STATE")
    6160                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_SEQ2_STATE")
    6161                      .dwattr $C$DW$339, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    6162                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6163                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6164                      .dwattr $C$DW$339, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6165                      .dwattr $C$DW$339, DW_AT_decl_line(0x1cc)
    6166                      .dwattr $C$DW$339, DW_AT_decl_column(0x0d)
    6167              $C$DW$340       .dwtag  DW_TAG_member
    6168                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    6169                      .dwattr $C$DW$340, DW_AT_name("rsvd1")
    6170                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_rsvd1")
    6171                      .dwattr $C$DW$340, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6172                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6173                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6174                      .dwattr $C$DW$340, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6175                      .dwattr $C$DW$340, DW_AT_decl_line(0x1cd)
    6176                      .dwattr $C$DW$340, DW_AT_decl_column(0x0d)
    6177              $C$DW$341       .dwtag  DW_TAG_member
    6178                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  129

    6179                      .dwattr $C$DW$341, DW_AT_name("SEQ_CNTR")
    6180                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_SEQ_CNTR")
    6181                      .dwattr $C$DW$341, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    6182                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6183                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    6184                      .dwattr $C$DW$341, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6185                      .dwattr $C$DW$341, DW_AT_decl_line(0x1ce)
    6186                      .dwattr $C$DW$341, DW_AT_decl_column(0x0d)
    6187              $C$DW$342       .dwtag  DW_TAG_member
    6188                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    6189                      .dwattr $C$DW$342, DW_AT_name("rsvd2")
    6190                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_rsvd2")
    6191                      .dwattr $C$DW$342, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    6192                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6193                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    6194                      .dwattr $C$DW$342, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6195                      .dwattr $C$DW$342, DW_AT_decl_line(0x1cf)
    6196                      .dwattr $C$DW$342, DW_AT_decl_column(0x0d)
    6197                      .dwendtag $C$DW$T$34
    6198              
    6199                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6200                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x1ca)
    6201                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
    6202              
    6203              $C$DW$T$35      .dwtag  DW_TAG_union_type
    6204                      .dwattr $C$DW$T$35, DW_AT_name("ADCASEQSR_REG")
    6205                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    6206              $C$DW$343       .dwtag  DW_TAG_member
    6207                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    6208                      .dwattr $C$DW$343, DW_AT_name("all")
    6209                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_all")
    6210                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6211                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    6212                      .dwattr $C$DW$343, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6213                      .dwattr $C$DW$343, DW_AT_decl_line(0x1d3)
    6214                      .dwattr $C$DW$343, DW_AT_decl_column(0x1b)
    6215              $C$DW$344       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$34)
    6217                      .dwattr $C$DW$344, DW_AT_name("bit")
    6218                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_bit")
    6219                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6220                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6221                      .dwattr $C$DW$344, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6222                      .dwattr $C$DW$344, DW_AT_decl_line(0x1d4)
    6223                      .dwattr $C$DW$344, DW_AT_decl_column(0x1b)
    6224                      .dwendtag $C$DW$T$35
    6225              
    6226                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6227                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x1d2)
    6228                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x07)
    6229              
    6230              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6231                      .dwattr $C$DW$T$36, DW_AT_name("ADCTRL3_BITS")
    6232                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6233              $C$DW$345       .dwtag  DW_TAG_member
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  130

    6234                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    6235                      .dwattr $C$DW$345, DW_AT_name("SMODE_SEL")
    6236                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_SMODE_SEL")
    6237                      .dwattr $C$DW$345, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6238                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6239                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6240                      .dwattr $C$DW$345, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6241                      .dwattr $C$DW$345, DW_AT_decl_line(0x215)
    6242                      .dwattr $C$DW$345, DW_AT_decl_column(0x0e)
    6243              $C$DW$346       .dwtag  DW_TAG_member
    6244                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    6245                      .dwattr $C$DW$346, DW_AT_name("ADCCLKPS")
    6246                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_ADCCLKPS")
    6247                      .dwattr $C$DW$346, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x04)
    6248                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6249                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6250                      .dwattr $C$DW$346, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6251                      .dwattr $C$DW$346, DW_AT_decl_line(0x216)
    6252                      .dwattr $C$DW$346, DW_AT_decl_column(0x0e)
    6253              $C$DW$347       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    6255                      .dwattr $C$DW$347, DW_AT_name("ADCPWDN")
    6256                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ADCPWDN")
    6257                      .dwattr $C$DW$347, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6258                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6259                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6260                      .dwattr $C$DW$347, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6261                      .dwattr $C$DW$347, DW_AT_decl_line(0x217)
    6262                      .dwattr $C$DW$347, DW_AT_decl_column(0x0e)
    6263              $C$DW$348       .dwtag  DW_TAG_member
    6264                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    6265                      .dwattr $C$DW$348, DW_AT_name("ADCBGRFDN")
    6266                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_ADCBGRFDN")
    6267                      .dwattr $C$DW$348, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    6268                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6269                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6270                      .dwattr $C$DW$348, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6271                      .dwattr $C$DW$348, DW_AT_decl_line(0x218)
    6272                      .dwattr $C$DW$348, DW_AT_decl_column(0x0e)
    6273              $C$DW$349       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    6275                      .dwattr $C$DW$349, DW_AT_name("rsvd1")
    6276                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd1")
    6277                      .dwattr $C$DW$349, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    6278                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6279                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6280                      .dwattr $C$DW$349, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6281                      .dwattr $C$DW$349, DW_AT_decl_line(0x219)
    6282                      .dwattr $C$DW$349, DW_AT_decl_column(0x0e)
    6283                      .dwendtag $C$DW$T$36
    6284              
    6285                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6286                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x214)
    6287                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
    6288              
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  131

    6289              $C$DW$T$37      .dwtag  DW_TAG_union_type
    6290                      .dwattr $C$DW$T$37, DW_AT_name("ADCTRL3_REG")
    6291                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6292              $C$DW$350       .dwtag  DW_TAG_member
    6293                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    6294                      .dwattr $C$DW$350, DW_AT_name("all")
    6295                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_all")
    6296                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6297                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6298                      .dwattr $C$DW$350, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6299                      .dwattr $C$DW$350, DW_AT_decl_line(0x21d)
    6300                      .dwattr $C$DW$350, DW_AT_decl_column(0x1a)
    6301              $C$DW$351       .dwtag  DW_TAG_member
    6302                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$36)
    6303                      .dwattr $C$DW$351, DW_AT_name("bit")
    6304                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_bit")
    6305                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6306                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6307                      .dwattr $C$DW$351, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6308                      .dwattr $C$DW$351, DW_AT_decl_line(0x21e)
    6309                      .dwattr $C$DW$351, DW_AT_decl_column(0x1a)
    6310                      .dwendtag $C$DW$T$37
    6311              
    6312                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6313                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x21c)
    6314                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
    6315              
    6316              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6317                      .dwattr $C$DW$T$38, DW_AT_name("ADCST_BITS")
    6318                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    6319              $C$DW$352       .dwtag  DW_TAG_member
    6320                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    6321                      .dwattr $C$DW$352, DW_AT_name("INT_SEQ1")
    6322                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_INT_SEQ1")
    6323                      .dwattr $C$DW$352, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6324                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6325                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6326                      .dwattr $C$DW$352, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6327                      .dwattr $C$DW$352, DW_AT_decl_line(0x223)
    6328                      .dwattr $C$DW$352, DW_AT_decl_column(0x0e)
    6329              $C$DW$353       .dwtag  DW_TAG_member
    6330                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    6331                      .dwattr $C$DW$353, DW_AT_name("INT_SEQ2")
    6332                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_INT_SEQ2")
    6333                      .dwattr $C$DW$353, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    6334                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6335                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6336                      .dwattr $C$DW$353, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6337                      .dwattr $C$DW$353, DW_AT_decl_line(0x224)
    6338                      .dwattr $C$DW$353, DW_AT_decl_column(0x0e)
    6339              $C$DW$354       .dwtag  DW_TAG_member
    6340                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    6341                      .dwattr $C$DW$354, DW_AT_name("SEQ1_BSY")
    6342                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_SEQ1_BSY")
    6343                      .dwattr $C$DW$354, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  132

    6344                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6345                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6346                      .dwattr $C$DW$354, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6347                      .dwattr $C$DW$354, DW_AT_decl_line(0x225)
    6348                      .dwattr $C$DW$354, DW_AT_decl_column(0x0e)
    6349              $C$DW$355       .dwtag  DW_TAG_member
    6350                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    6351                      .dwattr $C$DW$355, DW_AT_name("SEQ2_BSY")
    6352                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_SEQ2_BSY")
    6353                      .dwattr $C$DW$355, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    6354                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6355                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6356                      .dwattr $C$DW$355, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6357                      .dwattr $C$DW$355, DW_AT_decl_line(0x226)
    6358                      .dwattr $C$DW$355, DW_AT_decl_column(0x0e)
    6359              $C$DW$356       .dwtag  DW_TAG_member
    6360                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    6361                      .dwattr $C$DW$356, DW_AT_name("INT_SEQ1_CLR")
    6362                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
    6363                      .dwattr $C$DW$356, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    6364                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6365                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    6366                      .dwattr $C$DW$356, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6367                      .dwattr $C$DW$356, DW_AT_decl_line(0x227)
    6368                      .dwattr $C$DW$356, DW_AT_decl_column(0x0e)
    6369              $C$DW$357       .dwtag  DW_TAG_member
    6370                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    6371                      .dwattr $C$DW$357, DW_AT_name("INT_SEQ2_CLR")
    6372                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
    6373                      .dwattr $C$DW$357, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6374                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6375                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    6376                      .dwattr $C$DW$357, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6377                      .dwattr $C$DW$357, DW_AT_decl_line(0x228)
    6378                      .dwattr $C$DW$357, DW_AT_decl_column(0x0e)
    6379              $C$DW$358       .dwtag  DW_TAG_member
    6380                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    6381                      .dwattr $C$DW$358, DW_AT_name("EOS_BUF1")
    6382                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_EOS_BUF1")
    6383                      .dwattr $C$DW$358, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6384                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6385                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6386                      .dwattr $C$DW$358, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6387                      .dwattr $C$DW$358, DW_AT_decl_line(0x229)
    6388                      .dwattr $C$DW$358, DW_AT_decl_column(0x0e)
    6389              $C$DW$359       .dwtag  DW_TAG_member
    6390                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    6391                      .dwattr $C$DW$359, DW_AT_name("EOS_BUF2")
    6392                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_EOS_BUF2")
    6393                      .dwattr $C$DW$359, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6394                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6395                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6396                      .dwattr $C$DW$359, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6397                      .dwattr $C$DW$359, DW_AT_decl_line(0x22a)
    6398                      .dwattr $C$DW$359, DW_AT_decl_column(0x0e)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  133

    6399              $C$DW$360       .dwtag  DW_TAG_member
    6400                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    6401                      .dwattr $C$DW$360, DW_AT_name("rsvd1")
    6402                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_rsvd1")
    6403                      .dwattr $C$DW$360, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    6404                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6405                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6406                      .dwattr $C$DW$360, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6407                      .dwattr $C$DW$360, DW_AT_decl_line(0x22b)
    6408                      .dwattr $C$DW$360, DW_AT_decl_column(0x0e)
    6409                      .dwendtag $C$DW$T$38
    6410              
    6411                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6412                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x222)
    6413                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    6414              
    6415              $C$DW$T$39      .dwtag  DW_TAG_union_type
    6416                      .dwattr $C$DW$T$39, DW_AT_name("ADCST_REG")
    6417                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6418              $C$DW$361       .dwtag  DW_TAG_member
    6419                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    6420                      .dwattr $C$DW$361, DW_AT_name("all")
    6421                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_all")
    6422                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6423                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6424                      .dwattr $C$DW$361, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6425                      .dwattr $C$DW$361, DW_AT_decl_line(0x230)
    6426                      .dwattr $C$DW$361, DW_AT_decl_column(0x17)
    6427              $C$DW$362       .dwtag  DW_TAG_member
    6428                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$38)
    6429                      .dwattr $C$DW$362, DW_AT_name("bit")
    6430                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_bit")
    6431                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6432                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    6433                      .dwattr $C$DW$362, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6434                      .dwattr $C$DW$362, DW_AT_decl_line(0x231)
    6435                      .dwattr $C$DW$362, DW_AT_decl_column(0x17)
    6436                      .dwendtag $C$DW$T$39
    6437              
    6438                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6439                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x22f)
    6440                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
    6441              
    6442              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6443                      .dwattr $C$DW$T$40, DW_AT_name("ADCREFSEL_BITS")
    6444                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    6445              $C$DW$363       .dwtag  DW_TAG_member
    6446                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    6447                      .dwattr $C$DW$363, DW_AT_name("rsvd1")
    6448                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd1")
    6449                      .dwattr $C$DW$363, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x0e)
    6450                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6451                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6452                      .dwattr $C$DW$363, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6453                      .dwattr $C$DW$363, DW_AT_decl_line(0x235)
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  134

    6454                      .dwattr $C$DW$363, DW_AT_decl_column(0x0b)
    6455              $C$DW$364       .dwtag  DW_TAG_member
    6456                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    6457                      .dwattr $C$DW$364, DW_AT_name("REF_SEL")
    6458                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_REF_SEL")
    6459                      .dwattr $C$DW$364, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    6460                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6461                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6462                      .dwattr $C$DW$364, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6463                      .dwattr $C$DW$364, DW_AT_decl_line(0x236)
    6464                      .dwattr $C$DW$364, DW_AT_decl_column(0x0b)
    6465                      .dwendtag $C$DW$T$40
    6466              
    6467                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6468                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x234)
    6469                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    6470              
    6471              $C$DW$T$41      .dwtag  DW_TAG_union_type
    6472                      .dwattr $C$DW$T$41, DW_AT_name("ADCREFSEL_REG")
    6473                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    6474              $C$DW$365       .dwtag  DW_TAG_member
    6475                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    6476                      .dwattr $C$DW$365, DW_AT_name("all")
    6477                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_all")
    6478                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6479                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6480                      .dwattr $C$DW$365, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6481                      .dwattr $C$DW$365, DW_AT_decl_line(0x239)
    6482                      .dwattr $C$DW$365, DW_AT_decl_column(0x0a)
    6483              $C$DW$366       .dwtag  DW_TAG_member
    6484                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$40)
    6485                      .dwattr $C$DW$366, DW_AT_name("bit")
    6486                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_bit")
    6487                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6488                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6489                      .dwattr $C$DW$366, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6490                      .dwattr $C$DW$366, DW_AT_decl_line(0x23a)
    6491                      .dwattr $C$DW$366, DW_AT_decl_column(0x18)
    6492                      .dwendtag $C$DW$T$41
    6493              
    6494                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6495                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x238)
    6496                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x07)
    6497              
    6498              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6499                      .dwattr $C$DW$T$43, DW_AT_name("ADCOFFTRIM_BITS")
    6500                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    6501              $C$DW$367       .dwtag  DW_TAG_member
    6502                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$42)
    6503                      .dwattr $C$DW$367, DW_AT_name("OFFSET_TRIM")
    6504                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_OFFSET_TRIM")
    6505                      .dwattr $C$DW$367, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
    6506                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6507                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6508                      .dwattr $C$DW$367, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
TMS320C2000 Evaluation Assembler PC v5.2.1 Wed Nov 06 13:30:56 2013

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\022283                              PAGE  135

    6509                      .dwattr $C$DW$367, DW_AT_decl_line(0x23e)
    6510                      .dwattr $C$DW$367, DW_AT_decl_column(0x08)
    6511              $C$DW$368       .dwtag  DW_TAG_member
    6512                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    6513                      .dwattr $C$DW$368, DW_AT_name("rsvd1")
    6514                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd1")
    6515                      .dwattr $C$DW$368, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    6516                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6517                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6518                      .dwattr $C$DW$368, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6519                      .dwattr $C$DW$368, DW_AT_decl_line(0x23f)
    6520                      .dwattr $C$DW$368, DW_AT_decl_column(0x09)
    6521                      .dwendtag $C$DW$T$43
    6522              
    6523                      .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6524                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x23d)
    6525                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x08)
    6526              
    6527              $C$DW$T$44      .dwtag  DW_TAG_union_type
    6528                      .dwattr $C$DW$T$44, DW_AT_name("ADCOFFTRIM_REG")
    6529                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    6530              $C$DW$369       .dwtag  DW_TAG_member
    6531                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    6532                      .dwattr $C$DW$369, DW_AT_name("all")
    6533                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_all")
    6534                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6535                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6536                      .dwattr $C$DW$369, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6537                      .dwattr $C$DW$369, DW_AT_decl_line(0x243)
    6538                      .dwattr $C$DW$369, DW_AT_decl_column(0x0a)
    6539              $C$DW$370       .dwtag  DW_TAG_member
    6540                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$43)
    6541                      .dwattr $C$DW$370, DW_AT_name("bit")
    6542                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_bit")
    6543                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6544                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6545                      .dwattr $C$DW$370, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    6546                      .dwattr $C$DW$370, DW_AT_decl_line(0x244)
    6547                      .dwattr $C$DW$370, DW_AT_decl_column(0x19)
    6548                      .dwendtag $C$DW$T$44
    6549              
    6550                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    6551                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x242)
    6552                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x07)
    6553              
    6554              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6555                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    6556                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x1e)
    6557              $C$DW$371       .dwtag  DW_TAG_member
