TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Mon Dec 21 19:54:17 2009                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mainfeedforward20091221.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2546              DW$140  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2547              DW$141  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2548                      .dwendtag DW$T$147
    2549              
    2550              
    2551              DW$T$148        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2552                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    2553              DW$142  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2554              DW$143  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2555              DW$144  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   56

    2556                      .dwendtag DW$T$148
    2557              
    2558              
    2559              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2560                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    2561              DW$145  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2562              DW$146  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2563                      .dwendtag DW$T$149
    2564              
    2565              
    2566              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2567                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    2568              DW$147  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2569                      .dwendtag DW$T$151
    2570              
    2571              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("_iq"), DW_AT_type(*DW$T$12)
    2572                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    2573              
    2574              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2575                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    2576                      .dwattr DW$T$154, DW_AT_byte_size(0x0c)
    2577              DW$148  .dwtag  DW_TAG_subrange_type
    2578                      .dwattr DW$148, DW_AT_upper_bound(0x05)
    2579                      .dwendtag DW$T$154
    2580              
    2581              
    2582              DW$T$155        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2583                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    2584                      .dwattr DW$T$155, DW_AT_byte_size(0x06)
    2585              DW$149  .dwtag  DW_TAG_subrange_type
    2586                      .dwattr DW$149, DW_AT_upper_bound(0x02)
    2587                      .dwendtag DW$T$155
    2588              
    2589              
    2590              DW$T$156        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2591                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    2592                      .dwattr DW$T$156, DW_AT_byte_size(0x04)
    2593              DW$150  .dwtag  DW_TAG_subrange_type
    2594                      .dwattr DW$150, DW_AT_upper_bound(0x01)
    2595                      .dwendtag DW$T$156
    2596              
    2597              
    2598              DW$T$159        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$158)
    2599                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    2600                      .dwattr DW$T$159, DW_AT_byte_size(0x0c)
    2601              DW$151  .dwtag  DW_TAG_subrange_type
    2602                      .dwattr DW$151, DW_AT_upper_bound(0x05)
    2603                      .dwendtag DW$T$159
    2604              
    2605              DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("_iq30"), DW_AT_type(*DW$T$12)
    2606                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    2607              DW$T$162        .dwtag  DW_TAG_typedef, DW_AT_name("_iq15"), DW_AT_type(*DW$T$12)
    2608                      .dwattr DW$T$162, DW_AT_language(DW_LANG_C)
    2609              DW$152  .dwtag  DW_TAG_far_type
    2610                      .dwattr DW$152, DW_AT_type(*DW$T$45)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   57

    2611              DW$T$175        .dwtag  DW_TAG_volatile_type
    2612                      .dwattr DW$T$175, DW_AT_type(*DW$152)
    2613              DW$153  .dwtag  DW_TAG_far_type
    2614                      .dwattr DW$153, DW_AT_type(*DW$T$91)
    2615              DW$T$204        .dwtag  DW_TAG_volatile_type
    2616                      .dwattr DW$T$204, DW_AT_type(*DW$153)
    2617              DW$154  .dwtag  DW_TAG_far_type
    2618                      .dwattr DW$154, DW_AT_type(*DW$T$109)
    2619              DW$T$211        .dwtag  DW_TAG_volatile_type
    2620                      .dwattr DW$T$211, DW_AT_type(*DW$154)
    2621              DW$155  .dwtag  DW_TAG_far_type
    2622                      .dwattr DW$155, DW_AT_type(*DW$T$111)
    2623              DW$T$212        .dwtag  DW_TAG_volatile_type
    2624                      .dwattr DW$T$212, DW_AT_type(*DW$155)
    2625              DW$156  .dwtag  DW_TAG_far_type
    2626                      .dwattr DW$156, DW_AT_type(*DW$T$120)
    2627              DW$T$216        .dwtag  DW_TAG_volatile_type
    2628                      .dwattr DW$T$216, DW_AT_type(*DW$156)
    2629              
    2630              DW$T$124        .dwtag  DW_TAG_structure_type
    2631                      .dwattr DW$T$124, DW_AT_name("PIE_VECT_TABLE")
    2632                      .dwattr DW$T$124, DW_AT_byte_size(0x100)
    2633              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2634                      .dwattr DW$157, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
    2635                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2637              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2638                      .dwattr DW$158, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
    2639                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2640                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2641              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2642                      .dwattr DW$159, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
    2643                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2644                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2645              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2646                      .dwattr DW$160, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
    2647                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2648                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2649              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2650                      .dwattr DW$161, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
    2651                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2652                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2653              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2654                      .dwattr DW$162, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
    2655                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2656                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2657              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2658                      .dwattr DW$163, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
    2659                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2660                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2661              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2662                      .dwattr DW$164, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
    2663                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2664                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2665              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   58

    2666                      .dwattr DW$165, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
    2667                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2668                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2669              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2670                      .dwattr DW$166, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
    2671                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2672                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2673              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2674                      .dwattr DW$167, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
    2675                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2676                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2677              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2678                      .dwattr DW$168, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
    2679                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2680                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2681              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2682                      .dwattr DW$169, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
    2683                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2684                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2685              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2686                      .dwattr DW$170, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
    2687                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2688                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2689              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2690                      .dwattr DW$171, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
    2691                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2692                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2693              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2694                      .dwattr DW$172, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
    2695                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2696                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2697              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2698                      .dwattr DW$173, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
    2699                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2700                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2701              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2702                      .dwattr DW$174, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
    2703                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2704                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2705              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2706                      .dwattr DW$175, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
    2707                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2708                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2709              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2710                      .dwattr DW$176, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
    2711                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2712                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2713              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2714                      .dwattr DW$177, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
    2715                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2716                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2717              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2718                      .dwattr DW$178, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
    2719                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2720                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   59

    2721              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2722                      .dwattr DW$179, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
    2723                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2724                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2725              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2726                      .dwattr DW$180, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
    2727                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2728                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2729              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2730                      .dwattr DW$181, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
    2731                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2732                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2733              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2734                      .dwattr DW$182, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
    2735                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2736                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2737              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2738                      .dwattr DW$183, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
    2739                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2740                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2741              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2742                      .dwattr DW$184, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
    2743                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2744                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2745              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2746                      .dwattr DW$185, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
    2747                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2748                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2749              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2750                      .dwattr DW$186, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
    2751                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2752                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2753              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2754                      .dwattr DW$187, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
    2755                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2756                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2757              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2758                      .dwattr DW$188, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
    2759                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2760                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2761              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2762                      .dwattr DW$189, DW_AT_name("SEQ1INT"), DW_AT_symbol_name("_SEQ1INT")
    2763                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2764                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2765              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2766                      .dwattr DW$190, DW_AT_name("SEQ2INT"), DW_AT_symbol_name("_SEQ2INT")
    2767                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2768                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2769              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2770                      .dwattr DW$191, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
    2771                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2772                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2773              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2774                      .dwattr DW$192, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
    2775                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   60

    2776                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2777              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2778                      .dwattr DW$193, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
    2779                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2780                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2781              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2782                      .dwattr DW$194, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
    2783                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2784                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2785              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2786                      .dwattr DW$195, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
    2787                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2788                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2789              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2790                      .dwattr DW$196, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
    2791                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2792                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2793              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2794                      .dwattr DW$197, DW_AT_name("EPWM1_TZINT"), DW_AT_symbol_name("_EPWM1_TZINT")
    2795                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2796                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2797              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2798                      .dwattr DW$198, DW_AT_name("EPWM2_TZINT"), DW_AT_symbol_name("_EPWM2_TZINT")
    2799                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2800                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2801              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2802                      .dwattr DW$199, DW_AT_name("EPWM3_TZINT"), DW_AT_symbol_name("_EPWM3_TZINT")
    2803                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2804                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2805              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2806                      .dwattr DW$200, DW_AT_name("EPWM4_TZINT"), DW_AT_symbol_name("_EPWM4_TZINT")
    2807                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2808                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2809              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2810                      .dwattr DW$201, DW_AT_name("EPWM5_TZINT"), DW_AT_symbol_name("_EPWM5_TZINT")
    2811                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2812                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2813              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2814                      .dwattr DW$202, DW_AT_name("EPWM6_TZINT"), DW_AT_symbol_name("_EPWM6_TZINT")
    2815                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2816                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2817              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2818                      .dwattr DW$203, DW_AT_name("rsvd2_7"), DW_AT_symbol_name("_rsvd2_7")
    2819                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2820                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2821              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2822                      .dwattr DW$204, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
    2823                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2824                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2825              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2826                      .dwattr DW$205, DW_AT_name("EPWM1_INT"), DW_AT_symbol_name("_EPWM1_INT")
    2827                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2828                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2829              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2830                      .dwattr DW$206, DW_AT_name("EPWM2_INT"), DW_AT_symbol_name("_EPWM2_INT")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   61

    2831                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2832                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2833              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2834                      .dwattr DW$207, DW_AT_name("EPWM3_INT"), DW_AT_symbol_name("_EPWM3_INT")
    2835                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2836                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2837              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2838                      .dwattr DW$208, DW_AT_name("EPWM4_INT"), DW_AT_symbol_name("_EPWM4_INT")
    2839                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2840                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2841              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2842                      .dwattr DW$209, DW_AT_name("EPWM5_INT"), DW_AT_symbol_name("_EPWM5_INT")
    2843                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2844                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2845              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2846                      .dwattr DW$210, DW_AT_name("EPWM6_INT"), DW_AT_symbol_name("_EPWM6_INT")
    2847                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2848                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2849              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2850                      .dwattr DW$211, DW_AT_name("rsvd3_7"), DW_AT_symbol_name("_rsvd3_7")
    2851                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2852                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2853              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2854                      .dwattr DW$212, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
    2855                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2856                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2857              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2858                      .dwattr DW$213, DW_AT_name("ECAP1_INT"), DW_AT_symbol_name("_ECAP1_INT")
    2859                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2860                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2861              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2862                      .dwattr DW$214, DW_AT_name("ECAP2_INT"), DW_AT_symbol_name("_ECAP2_INT")
    2863                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2864                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2865              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2866                      .dwattr DW$215, DW_AT_name("ECAP3_INT"), DW_AT_symbol_name("_ECAP3_INT")
    2867                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2868                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2869              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2870                      .dwattr DW$216, DW_AT_name("ECAP4_INT"), DW_AT_symbol_name("_ECAP4_INT")
    2871                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2872                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2873              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2874                      .dwattr DW$217, DW_AT_name("rsvd4_5"), DW_AT_symbol_name("_rsvd4_5")
    2875                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2876                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2877              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2878                      .dwattr DW$218, DW_AT_name("rsvd4_6"), DW_AT_symbol_name("_rsvd4_6")
    2879                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2880                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2881              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2882                      .dwattr DW$219, DW_AT_name("rsvd4_7"), DW_AT_symbol_name("_rsvd4_7")
    2883                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2884                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2885              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   62

    2886                      .dwattr DW$220, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
    2887                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2888                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2889              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2890                      .dwattr DW$221, DW_AT_name("EQEP1_INT"), DW_AT_symbol_name("_EQEP1_INT")
    2891                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2892                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2893              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2894                      .dwattr DW$222, DW_AT_name("EQEP2_INT"), DW_AT_symbol_name("_EQEP2_INT")
    2895                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2896                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2897              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2898                      .dwattr DW$223, DW_AT_name("rsvd5_3"), DW_AT_symbol_name("_rsvd5_3")
    2899                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2900                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2901              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2902                      .dwattr DW$224, DW_AT_name("rsvd5_4"), DW_AT_symbol_name("_rsvd5_4")
    2903                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2904                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2905              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2906                      .dwattr DW$225, DW_AT_name("rsvd5_5"), DW_AT_symbol_name("_rsvd5_5")
    2907                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2908                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2909              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2910                      .dwattr DW$226, DW_AT_name("rsvd5_6"), DW_AT_symbol_name("_rsvd5_6")
    2911                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2912                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2913              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2914                      .dwattr DW$227, DW_AT_name("rsvd5_7"), DW_AT_symbol_name("_rsvd5_7")
    2915                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2916                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2917              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2918                      .dwattr DW$228, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
    2919                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2920                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2921              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2922                      .dwattr DW$229, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
    2923                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2924                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2925              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2926                      .dwattr DW$230, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
    2927                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2928                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2929              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2930                      .dwattr DW$231, DW_AT_name("SPIRXINTB"), DW_AT_symbol_name("_SPIRXINTB")
    2931                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2932                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2933              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2934                      .dwattr DW$232, DW_AT_name("SPITXINTB"), DW_AT_symbol_name("_SPITXINTB")
    2935                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2936                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2937              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2938                      .dwattr DW$233, DW_AT_name("SPIRXINTC"), DW_AT_symbol_name("_SPIRXINTC")
    2939                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2940                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   63

    2941              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2942                      .dwattr DW$234, DW_AT_name("SPITXINTC"), DW_AT_symbol_name("_SPITXINTC")
    2943                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2944                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2945              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2946                      .dwattr DW$235, DW_AT_name("SPIRXINTD"), DW_AT_symbol_name("_SPIRXINTD")
    2947                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2948                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2949              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2950                      .dwattr DW$236, DW_AT_name("SPITXINTD"), DW_AT_symbol_name("_SPITXINTD")
    2951                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2952                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2953              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2954                      .dwattr DW$237, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
    2955                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2956                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2957              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2958                      .dwattr DW$238, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
    2959                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2960                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2961              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2962                      .dwattr DW$239, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
    2963                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2964                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2965              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2966                      .dwattr DW$240, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
    2967                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2968                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2969              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2970                      .dwattr DW$241, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
    2971                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2972                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2973              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2974                      .dwattr DW$242, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
    2975                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2976                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2977              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2978                      .dwattr DW$243, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
    2979                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2980                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2981              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2982                      .dwattr DW$244, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
    2983                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2984                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2985              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2986                      .dwattr DW$245, DW_AT_name("I2CINT1A"), DW_AT_symbol_name("_I2CINT1A")
    2987                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2988                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2989              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2990                      .dwattr DW$246, DW_AT_name("I2CINT2A"), DW_AT_symbol_name("_I2CINT2A")
    2991                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2992                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2993              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2994                      .dwattr DW$247, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
    2995                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   64

    2996                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2997              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2998                      .dwattr DW$248, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
    2999                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3000                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3001              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3002                      .dwattr DW$249, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
    3003                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3004                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3005              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3006                      .dwattr DW$250, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
    3007                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3008                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3009              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3010                      .dwattr DW$251, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
    3011                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3012                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3013              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3014                      .dwattr DW$252, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
    3015                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3016                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3017              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3018                      .dwattr DW$253, DW_AT_name("SCIRXINTA"), DW_AT_symbol_name("_SCIRXINTA")
    3019                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3020                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3021              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3022                      .dwattr DW$254, DW_AT_name("SCITXINTA"), DW_AT_symbol_name("_SCITXINTA")
    3023                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    3024                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3025              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3026                      .dwattr DW$255, DW_AT_name("SCIRXINTB"), DW_AT_symbol_name("_SCIRXINTB")
    3027                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3028                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3029              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3030                      .dwattr DW$256, DW_AT_name("SCITXINTB"), DW_AT_symbol_name("_SCITXINTB")
    3031                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3032                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3033              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3034                      .dwattr DW$257, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
    3035                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3036                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3037              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3038                      .dwattr DW$258, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
    3039                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3040                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3041              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3042                      .dwattr DW$259, DW_AT_name("ECAN0INTB"), DW_AT_symbol_name("_ECAN0INTB")
    3043                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3044                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3045              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3046                      .dwattr DW$260, DW_AT_name("ECAN1INTB"), DW_AT_symbol_name("_ECAN1INTB")
    3047                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3048                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3049              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3050                      .dwattr DW$261, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   65

    3051                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3052                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3053              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3054                      .dwattr DW$262, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
    3055                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3056                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3057              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3058                      .dwattr DW$263, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
    3059                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3060                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3061              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3062                      .dwattr DW$264, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
    3063                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3064                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3065              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3066                      .dwattr DW$265, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
    3067                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3068                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3069              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3070                      .dwattr DW$266, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
    3071                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3072                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3073              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3074                      .dwattr DW$267, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
    3075                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3076                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3077              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3078                      .dwattr DW$268, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
    3079                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3080                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3081              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3082                      .dwattr DW$269, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
    3083                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3084                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3085              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3086                      .dwattr DW$270, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
    3087                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3088                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3089              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3090                      .dwattr DW$271, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
    3091                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3092                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3093              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3094                      .dwattr DW$272, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
    3095                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3096                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3097              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3098                      .dwattr DW$273, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
    3099                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3100                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3101              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3102                      .dwattr DW$274, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
    3103                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3104                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3105              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   66

    3106                      .dwattr DW$275, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
    3107                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3108                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3109              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3110                      .dwattr DW$276, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
    3111                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3112                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3113              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3114                      .dwattr DW$277, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
    3115                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3116                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3117              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3118                      .dwattr DW$278, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
    3119                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3120                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3121              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3122                      .dwattr DW$279, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
    3123                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3124                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3125              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3126                      .dwattr DW$280, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
    3127                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3128                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3129              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3130                      .dwattr DW$281, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
    3131                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3132                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3134                      .dwattr DW$282, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
    3135                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3136                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3137              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3138                      .dwattr DW$283, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
    3139                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3140                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3141              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3142                      .dwattr DW$284, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
    3143                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3144                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3145                      .dwendtag DW$T$124
    3146              
    3147              DW$285  .dwtag  DW_TAG_far_type
    3148                      .dwattr DW$285, DW_AT_type(*DW$T$144)
    3149              DW$T$219        .dwtag  DW_TAG_volatile_type
    3150                      .dwattr DW$T$219, DW_AT_type(*DW$285)
    3151              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$122)
    3152                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    3153              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3154                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3155                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3156              DW$T$158        .dwtag  DW_TAG_typedef, DW_AT_name("_iq28"), DW_AT_type(*DW$T$12)
    3157                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    3158              
    3159              DW$T$45 .dwtag  DW_TAG_structure_type
    3160                      .dwattr DW$T$45, DW_AT_name("ADC_REGS")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   67

    3161                      .dwattr DW$T$45, DW_AT_byte_size(0x1e)
    3162              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    3163                      .dwattr DW$286, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
    3164                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3165                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3166              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3167                      .dwattr DW$287, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
    3168                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3169                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3170              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3171                      .dwattr DW$288, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
    3172                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3173                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3174              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3175                      .dwattr DW$289, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
    3176                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3177                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3178              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3179                      .dwattr DW$290, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
    3180                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3181                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3182              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3183                      .dwattr DW$291, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
    3184                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3185                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3186              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    3187                      .dwattr DW$292, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
    3188                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3189                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3190              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3191                      .dwattr DW$293, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
    3192                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3193                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3194              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3195                      .dwattr DW$294, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
    3196                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3197                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3198              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3199                      .dwattr DW$295, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
    3200                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3201                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3202              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3203                      .dwattr DW$296, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
    3204                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3205                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3206              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3207                      .dwattr DW$297, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
    3208                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3209                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3210              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3211                      .dwattr DW$298, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
    3212                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3213                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3214              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3215                      .dwattr DW$299, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   68

    3216                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3217                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3218              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3219                      .dwattr DW$300, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
    3220                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3221                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3222              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3223                      .dwattr DW$301, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
    3224                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3225                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3226              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3227                      .dwattr DW$302, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
    3228                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3229                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3230              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3231                      .dwattr DW$303, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
    3232                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3233                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3234              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3235                      .dwattr DW$304, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
    3236                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3237                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3238              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3239                      .dwattr DW$305, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
    3240                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3241                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3242              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3243                      .dwattr DW$306, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
    3244                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3245                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3246              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3247                      .dwattr DW$307, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
    3248                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3249                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3250              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3251                      .dwattr DW$308, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
    3252                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3253                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3254              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3255                      .dwattr DW$309, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
    3256                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3257                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3258              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3259                      .dwattr DW$310, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
    3260                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3261                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3262              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3263                      .dwattr DW$311, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
    3264                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3265                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3266              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3267                      .dwattr DW$312, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3268                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3269                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3270              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   69

    3271                      .dwattr DW$313, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3272                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3273                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3274              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3275                      .dwattr DW$314, DW_AT_name("ADCREFSEL"), DW_AT_symbol_name("_ADCREFSEL")
    3276                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3277                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3278              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3279                      .dwattr DW$315, DW_AT_name("ADCOFFTRIM"), DW_AT_symbol_name("_ADCOFFTRIM")
    3280                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3281                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3282                      .dwendtag DW$T$45
    3283              
    3284              
    3285              DW$T$91 .dwtag  DW_TAG_structure_type
    3286                      .dwattr DW$T$91, DW_AT_name("EPWM_REGS")
    3287                      .dwattr DW$T$91, DW_AT_byte_size(0x22)
    3288              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3289                      .dwattr DW$316, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
    3290                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3291                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3292              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3293                      .dwattr DW$317, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
    3294                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3295                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3296              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3297                      .dwattr DW$318, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
    3298                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3299                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3300              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3301                      .dwattr DW$319, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
    3302                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3303                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3304              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3305                      .dwattr DW$320, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
    3306                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3307                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3308              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3309                      .dwattr DW$321, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3310                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3311                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3312              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3313                      .dwattr DW$322, DW_AT_name("CMPCTL"), DW_AT_symbol_name("_CMPCTL")
    3314                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3315                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3316              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    3317                      .dwattr DW$323, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
    3318                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3319                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3320              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3321                      .dwattr DW$324, DW_AT_name("CMPB"), DW_AT_symbol_name("_CMPB")
    3322                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3323                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3324              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3325                      .dwattr DW$325, DW_AT_name("AQCTLA"), DW_AT_symbol_name("_AQCTLA")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   70

    3326                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3327                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3328              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3329                      .dwattr DW$326, DW_AT_name("AQCTLB"), DW_AT_symbol_name("_AQCTLB")
    3330                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3331                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3332              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3333                      .dwattr DW$327, DW_AT_name("AQSFRC"), DW_AT_symbol_name("_AQSFRC")
    3334                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3335                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3336              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3337                      .dwattr DW$328, DW_AT_name("AQCSFRC"), DW_AT_symbol_name("_AQCSFRC")
    3338                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3339                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3340              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3341                      .dwattr DW$329, DW_AT_name("DBCTL"), DW_AT_symbol_name("_DBCTL")
    3342                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3343                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3344              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3345                      .dwattr DW$330, DW_AT_name("DBRED"), DW_AT_symbol_name("_DBRED")
    3346                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3347                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3348              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3349                      .dwattr DW$331, DW_AT_name("DBFED"), DW_AT_symbol_name("_DBFED")
    3350                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3351                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3352              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3353                      .dwattr DW$332, DW_AT_name("TZSEL"), DW_AT_symbol_name("_TZSEL")
    3354                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3355                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3356              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3357                      .dwattr DW$333, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3358                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3359                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3360              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3361                      .dwattr DW$334, DW_AT_name("TZCTL"), DW_AT_symbol_name("_TZCTL")
    3362                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3363                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3364              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3365                      .dwattr DW$335, DW_AT_name("TZEINT"), DW_AT_symbol_name("_TZEINT")
    3366                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3367                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3368              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3369                      .dwattr DW$336, DW_AT_name("TZFLG"), DW_AT_symbol_name("_TZFLG")
    3370                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3371                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3372              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3373                      .dwattr DW$337, DW_AT_name("TZCLR"), DW_AT_symbol_name("_TZCLR")
    3374                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3375                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3376              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3377                      .dwattr DW$338, DW_AT_name("TZFRC"), DW_AT_symbol_name("_TZFRC")
    3378                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3379                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3380              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   71

    3381                      .dwattr DW$339, DW_AT_name("ETSEL"), DW_AT_symbol_name("_ETSEL")
    3382                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3383                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3384              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3385                      .dwattr DW$340, DW_AT_name("ETPS"), DW_AT_symbol_name("_ETPS")
    3386                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3387                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3388              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3389                      .dwattr DW$341, DW_AT_name("ETFLG"), DW_AT_symbol_name("_ETFLG")
    3390                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3391                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3392              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3393                      .dwattr DW$342, DW_AT_name("ETCLR"), DW_AT_symbol_name("_ETCLR")
    3394                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3395                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3396              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3397                      .dwattr DW$343, DW_AT_name("ETFRC"), DW_AT_symbol_name("_ETFRC")
    3398                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3399                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3400              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3401                      .dwattr DW$344, DW_AT_name("PCCTL"), DW_AT_symbol_name("_PCCTL")
    3402                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3403                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3404              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3405                      .dwattr DW$345, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3406                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3407                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3408              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3409                      .dwattr DW$346, DW_AT_name("HRCNFG"), DW_AT_symbol_name("_HRCNFG")
    3410                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3411                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3412                      .dwendtag DW$T$91
    3413              
    3414              
    3415              DW$T$109        .dwtag  DW_TAG_structure_type
    3416                      .dwattr DW$T$109, DW_AT_name("GPIO_CTRL_REGS")
    3417                      .dwattr DW$T$109, DW_AT_byte_size(0x40)
    3418              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3419                      .dwattr DW$347, DW_AT_name("GPACTRL"), DW_AT_symbol_name("_GPACTRL")
    3420                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3421                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3422              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3423                      .dwattr DW$348, DW_AT_name("GPAQSEL1"), DW_AT_symbol_name("_GPAQSEL1")
    3424                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3425                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3426              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3427                      .dwattr DW$349, DW_AT_name("GPAQSEL2"), DW_AT_symbol_name("_GPAQSEL2")
    3428                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3429                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3430              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3431                      .dwattr DW$350, DW_AT_name("GPAMUX1"), DW_AT_symbol_name("_GPAMUX1")
    3432                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3433                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3434              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3435                      .dwattr DW$351, DW_AT_name("GPAMUX2"), DW_AT_symbol_name("_GPAMUX2")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   72

    3436                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3437                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3438              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3439                      .dwattr DW$352, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3440                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3441                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3442              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3443                      .dwattr DW$353, DW_AT_name("GPAPUD"), DW_AT_symbol_name("_GPAPUD")
    3444                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3445                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3446              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3447                      .dwattr DW$354, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3448                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3449                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3450              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3451                      .dwattr DW$355, DW_AT_name("GPBCTRL"), DW_AT_symbol_name("_GPBCTRL")
    3452                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3453                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3454              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3455                      .dwattr DW$356, DW_AT_name("GPBQSEL1"), DW_AT_symbol_name("_GPBQSEL1")
    3456                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3457                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3458              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3459                      .dwattr DW$357, DW_AT_name("GPBQSEL2"), DW_AT_symbol_name("_GPBQSEL2")
    3460                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3461                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3462              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3463                      .dwattr DW$358, DW_AT_name("GPBMUX1"), DW_AT_symbol_name("_GPBMUX1")
    3464                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3465                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3466              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3467                      .dwattr DW$359, DW_AT_name("GPBMUX2"), DW_AT_symbol_name("_GPBMUX2")
    3468                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3469                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3470              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3471                      .dwattr DW$360, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3472                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3473                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3474              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3475                      .dwattr DW$361, DW_AT_name("GPBPUD"), DW_AT_symbol_name("_GPBPUD")
    3476                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3477                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3478              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    3479                      .dwattr DW$362, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3480                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3481                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3482                      .dwendtag DW$T$109
    3483              
    3484              
    3485              DW$T$111        .dwtag  DW_TAG_structure_type
    3486                      .dwattr DW$T$111, DW_AT_name("GPIO_DATA_REGS")
    3487                      .dwattr DW$T$111, DW_AT_byte_size(0x20)
    3488              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3489                      .dwattr DW$363, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3490                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   73

    3491                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3492              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3493                      .dwattr DW$364, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3494                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3495                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3496              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3497                      .dwattr DW$365, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3498                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3499                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3500              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3501                      .dwattr DW$366, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3502                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3503                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3504              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3505                      .dwattr DW$367, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3506                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3507                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3508              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3509                      .dwattr DW$368, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3510                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3511                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3512              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3513                      .dwattr DW$369, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3514                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3515                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3516              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3517                      .dwattr DW$370, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3518                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3519                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3520              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    3521                      .dwattr DW$371, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3522                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3523                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3524                      .dwendtag DW$T$111
    3525              
    3526              
    3527              DW$T$120        .dwtag  DW_TAG_structure_type
    3528                      .dwattr DW$T$120, DW_AT_name("PIE_CTRL_REGS")
    3529                      .dwattr DW$T$120, DW_AT_byte_size(0x1a)
    3530              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3531                      .dwattr DW$372, DW_AT_name("PIECTRL"), DW_AT_symbol_name("_PIECTRL")
    3532                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3533                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3534              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3535                      .dwattr DW$373, DW_AT_name("PIEACK"), DW_AT_symbol_name("_PIEACK")
    3536                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3537                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3538              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3539                      .dwattr DW$374, DW_AT_name("PIEIER1"), DW_AT_symbol_name("_PIEIER1")
    3540                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3541                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3542              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3543                      .dwattr DW$375, DW_AT_name("PIEIFR1"), DW_AT_symbol_name("_PIEIFR1")
    3544                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3545                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   74

    3546              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3547                      .dwattr DW$376, DW_AT_name("PIEIER2"), DW_AT_symbol_name("_PIEIER2")
    3548                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3549                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3550              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3551                      .dwattr DW$377, DW_AT_name("PIEIFR2"), DW_AT_symbol_name("_PIEIFR2")
    3552                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3553                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3554              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3555                      .dwattr DW$378, DW_AT_name("PIEIER3"), DW_AT_symbol_name("_PIEIER3")
    3556                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3557                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3558              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3559                      .dwattr DW$379, DW_AT_name("PIEIFR3"), DW_AT_symbol_name("_PIEIFR3")
    3560                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3561                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3562              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3563                      .dwattr DW$380, DW_AT_name("PIEIER4"), DW_AT_symbol_name("_PIEIER4")
    3564                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3565                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3566              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3567                      .dwattr DW$381, DW_AT_name("PIEIFR4"), DW_AT_symbol_name("_PIEIFR4")
    3568                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3569                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3570              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3571                      .dwattr DW$382, DW_AT_name("PIEIER5"), DW_AT_symbol_name("_PIEIER5")
    3572                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3573                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3574              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3575                      .dwattr DW$383, DW_AT_name("PIEIFR5"), DW_AT_symbol_name("_PIEIFR5")
    3576                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3577                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3578              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3579                      .dwattr DW$384, DW_AT_name("PIEIER6"), DW_AT_symbol_name("_PIEIER6")
    3580                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3581                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3582              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3583                      .dwattr DW$385, DW_AT_name("PIEIFR6"), DW_AT_symbol_name("_PIEIFR6")
    3584                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3585                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3586              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3587                      .dwattr DW$386, DW_AT_name("PIEIER7"), DW_AT_symbol_name("_PIEIER7")
    3588                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3589                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3590              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3591                      .dwattr DW$387, DW_AT_name("PIEIFR7"), DW_AT_symbol_name("_PIEIFR7")
    3592                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3593                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3594              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3595                      .dwattr DW$388, DW_AT_name("PIEIER8"), DW_AT_symbol_name("_PIEIER8")
    3596                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3597                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3598              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3599                      .dwattr DW$389, DW_AT_name("PIEIFR8"), DW_AT_symbol_name("_PIEIFR8")
    3600                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 19:54:18 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8922                            PAGE   75

    3601                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3602              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3603                      .dwattr DW$390, DW_AT_name("PIEIER9"), DW_AT_symbol_name("_PIEIER9")
    3604                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3605                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3606              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3607                      .dwattr DW$391, DW_AT_name("PIEIFR9"), DW_AT_symbol_name("_PIEIFR9")
    3608                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3609                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3610              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3611                      .dwattr DW$392, DW_AT_name("PIEIER10"), DW_AT_symbol_name("_PIEIER10")
    3612                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3613                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3614              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3615                      .dwattr DW$393, DW_AT_name("PIEIFR10"), DW_AT_symbol_name("_PIEIFR10")
    3616                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3617                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3618              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3619                      .dwattr DW$394, DW_AT_name("PIEIER11"), DW_AT_symbol_name("_PIEIER11")
    3620                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3621                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3622              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3623                      .dwattr DW$395, DW_AT_name("PIEIFR11"), DW_AT_symbol_name("_PIEIFR11")
    3624                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3625                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3626              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3627                      .dwattr DW$396, DW_AT_name("PIEIER12"), DW_AT_symbol_name("_PIEIER12")
    3628                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3629                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3630              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3631                      .dwattr DW$397, DW_AT_name("PIEIFR12"), DW_AT_symbol_name("_PIEIFR12")
    3632                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3633                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3634                      .dwendtag DW$T$120
    3635              
    3636              
    3637              DW$T$144        .dwtag  DW_TAG_structure_type
    3638                      .dwattr DW$T$144, DW_AT_name("SYS_CTRL_REGS")
    3639                      .dwattr DW$T$144, DW_AT_byte_size(0x20)
    3640              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    3641                      .dwattr DW$398, DW_AT_name("XCLK"), DW_AT_symbol_name("_XCLK")
    3642                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3643                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3644              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    3645                      .dwattr DW$399, DW_AT_name("PLLSTS"), DW_AT_symbol_name("_PLLSTS")
    3646                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3647                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3648              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    3649                      .dwattr DW$400, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
