TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Wed Dec 02 20:15:13 2009                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("maindouble.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2306              DW$123  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2307              DW$124  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2308                      .dwendtag DW$T$147
    2309              
    2310              
    2311              DW$T$148        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2312                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    2313              DW$125  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2314              DW$126  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2315              DW$127  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2316                      .dwendtag DW$T$148
    2317              
    2318              
    2319              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2320                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    2321              DW$128  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2322              DW$129  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2323                      .dwendtag DW$T$149
    2324              
    2325              
    2326              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2327                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    2328              DW$130  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2329                      .dwendtag DW$T$151
    2330              
    2331              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("_iq"), DW_AT_type(*DW$T$12)
    2332                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    2333              
    2334              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2335                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    2336                      .dwattr DW$T$154, DW_AT_byte_size(0x0c)
    2337              DW$131  .dwtag  DW_TAG_subrange_type
    2338                      .dwattr DW$131, DW_AT_upper_bound(0x05)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   51

    2339                      .dwendtag DW$T$154
    2340              
    2341              
    2342              DW$T$155        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2343                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    2344                      .dwattr DW$T$155, DW_AT_byte_size(0x06)
    2345              DW$132  .dwtag  DW_TAG_subrange_type
    2346                      .dwattr DW$132, DW_AT_upper_bound(0x02)
    2347                      .dwendtag DW$T$155
    2348              
    2349              
    2350              DW$T$156        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2351                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    2352                      .dwattr DW$T$156, DW_AT_byte_size(0x04)
    2353              DW$133  .dwtag  DW_TAG_subrange_type
    2354                      .dwattr DW$133, DW_AT_upper_bound(0x01)
    2355                      .dwendtag DW$T$156
    2356              
    2357              
    2358              DW$T$159        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$158)
    2359                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    2360                      .dwattr DW$T$159, DW_AT_byte_size(0x0c)
    2361              DW$134  .dwtag  DW_TAG_subrange_type
    2362                      .dwattr DW$134, DW_AT_upper_bound(0x05)
    2363                      .dwendtag DW$T$159
    2364              
    2365              DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("_iq30"), DW_AT_type(*DW$T$12)
    2366                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    2367              DW$T$162        .dwtag  DW_TAG_typedef, DW_AT_name("_iq15"), DW_AT_type(*DW$T$12)
    2368                      .dwattr DW$T$162, DW_AT_language(DW_LANG_C)
    2369              DW$135  .dwtag  DW_TAG_far_type
    2370                      .dwattr DW$135, DW_AT_type(*DW$T$45)
    2371              DW$T$173        .dwtag  DW_TAG_volatile_type
    2372                      .dwattr DW$T$173, DW_AT_type(*DW$135)
    2373              DW$136  .dwtag  DW_TAG_far_type
    2374                      .dwattr DW$136, DW_AT_type(*DW$T$91)
    2375              DW$T$202        .dwtag  DW_TAG_volatile_type
    2376                      .dwattr DW$T$202, DW_AT_type(*DW$136)
    2377              DW$137  .dwtag  DW_TAG_far_type
    2378                      .dwattr DW$137, DW_AT_type(*DW$T$109)
    2379              DW$T$209        .dwtag  DW_TAG_volatile_type
    2380                      .dwattr DW$T$209, DW_AT_type(*DW$137)
    2381              DW$138  .dwtag  DW_TAG_far_type
    2382                      .dwattr DW$138, DW_AT_type(*DW$T$111)
    2383              DW$T$210        .dwtag  DW_TAG_volatile_type
    2384                      .dwattr DW$T$210, DW_AT_type(*DW$138)
    2385              DW$139  .dwtag  DW_TAG_far_type
    2386                      .dwattr DW$139, DW_AT_type(*DW$T$120)
    2387              DW$T$214        .dwtag  DW_TAG_volatile_type
    2388                      .dwattr DW$T$214, DW_AT_type(*DW$139)
    2389              
    2390              DW$T$124        .dwtag  DW_TAG_structure_type
    2391                      .dwattr DW$T$124, DW_AT_name("PIE_VECT_TABLE")
    2392                      .dwattr DW$T$124, DW_AT_byte_size(0x100)
    2393              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   52

    2394                      .dwattr DW$140, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
    2395                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2396                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2397              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2398                      .dwattr DW$141, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
    2399                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2400                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2401              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2402                      .dwattr DW$142, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
    2403                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2404                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2405              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2406                      .dwattr DW$143, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
    2407                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2408                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2409              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2410                      .dwattr DW$144, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
    2411                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2412                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2413              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2414                      .dwattr DW$145, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
    2415                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2416                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2417              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2418                      .dwattr DW$146, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
    2419                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2420                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2421              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2422                      .dwattr DW$147, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
    2423                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2424                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2425              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2426                      .dwattr DW$148, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
    2427                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2428                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2429              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2430                      .dwattr DW$149, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
    2431                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2432                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2433              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2434                      .dwattr DW$150, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
    2435                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2436                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2437              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2438                      .dwattr DW$151, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
    2439                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2440                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2441              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2442                      .dwattr DW$152, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
    2443                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2444                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2445              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2446                      .dwattr DW$153, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
    2447                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2448                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   53

    2449              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2450                      .dwattr DW$154, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
    2451                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2452                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2453              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2454                      .dwattr DW$155, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
    2455                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2456                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2457              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2458                      .dwattr DW$156, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
    2459                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2460                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2461              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2462                      .dwattr DW$157, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
    2463                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2464                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2465              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2466                      .dwattr DW$158, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
    2467                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2468                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2469              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2470                      .dwattr DW$159, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
    2471                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2472                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2473              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2474                      .dwattr DW$160, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
    2475                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2476                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2477              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2478                      .dwattr DW$161, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
    2479                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2480                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2481              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2482                      .dwattr DW$162, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
    2483                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2484                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2485              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2486                      .dwattr DW$163, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
    2487                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2488                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2489              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2490                      .dwattr DW$164, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
    2491                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2492                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2493              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2494                      .dwattr DW$165, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
    2495                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2496                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2497              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2498                      .dwattr DW$166, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
    2499                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2500                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2501              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2502                      .dwattr DW$167, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
    2503                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   54

    2504                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2505              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2506                      .dwattr DW$168, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
    2507                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2508                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2509              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2510                      .dwattr DW$169, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
    2511                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2512                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2513              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2514                      .dwattr DW$170, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
    2515                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2516                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2517              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2518                      .dwattr DW$171, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
    2519                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2520                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2521              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2522                      .dwattr DW$172, DW_AT_name("SEQ1INT"), DW_AT_symbol_name("_SEQ1INT")
    2523                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2524                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2525              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2526                      .dwattr DW$173, DW_AT_name("SEQ2INT"), DW_AT_symbol_name("_SEQ2INT")
    2527                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2528                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2529              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2530                      .dwattr DW$174, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
    2531                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2532                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2533              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2534                      .dwattr DW$175, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
    2535                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2536                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2537              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2538                      .dwattr DW$176, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
    2539                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2540                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2541              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2542                      .dwattr DW$177, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
    2543                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2544                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2545              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2546                      .dwattr DW$178, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
    2547                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2548                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2549              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2550                      .dwattr DW$179, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
    2551                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2552                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2553              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2554                      .dwattr DW$180, DW_AT_name("EPWM1_TZINT"), DW_AT_symbol_name("_EPWM1_TZINT")
    2555                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2556                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2557              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2558                      .dwattr DW$181, DW_AT_name("EPWM2_TZINT"), DW_AT_symbol_name("_EPWM2_TZINT")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   55

    2559                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2560                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2561              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2562                      .dwattr DW$182, DW_AT_name("EPWM3_TZINT"), DW_AT_symbol_name("_EPWM3_TZINT")
    2563                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2564                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2565              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2566                      .dwattr DW$183, DW_AT_name("EPWM4_TZINT"), DW_AT_symbol_name("_EPWM4_TZINT")
    2567                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2568                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2569              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2570                      .dwattr DW$184, DW_AT_name("EPWM5_TZINT"), DW_AT_symbol_name("_EPWM5_TZINT")
    2571                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2572                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2573              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2574                      .dwattr DW$185, DW_AT_name("EPWM6_TZINT"), DW_AT_symbol_name("_EPWM6_TZINT")
    2575                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2576                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2577              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2578                      .dwattr DW$186, DW_AT_name("rsvd2_7"), DW_AT_symbol_name("_rsvd2_7")
    2579                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2580                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2581              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2582                      .dwattr DW$187, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
    2583                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2584                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2585              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2586                      .dwattr DW$188, DW_AT_name("EPWM1_INT"), DW_AT_symbol_name("_EPWM1_INT")
    2587                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2588                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2589              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2590                      .dwattr DW$189, DW_AT_name("EPWM2_INT"), DW_AT_symbol_name("_EPWM2_INT")
    2591                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2592                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2593              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2594                      .dwattr DW$190, DW_AT_name("EPWM3_INT"), DW_AT_symbol_name("_EPWM3_INT")
    2595                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2596                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2597              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2598                      .dwattr DW$191, DW_AT_name("EPWM4_INT"), DW_AT_symbol_name("_EPWM4_INT")
    2599                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2600                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2601              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2602                      .dwattr DW$192, DW_AT_name("EPWM5_INT"), DW_AT_symbol_name("_EPWM5_INT")
    2603                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2604                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2605              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2606                      .dwattr DW$193, DW_AT_name("EPWM6_INT"), DW_AT_symbol_name("_EPWM6_INT")
    2607                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2608                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2609              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2610                      .dwattr DW$194, DW_AT_name("rsvd3_7"), DW_AT_symbol_name("_rsvd3_7")
    2611                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2612                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2613              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   56

    2614                      .dwattr DW$195, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
    2615                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2616                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2617              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2618                      .dwattr DW$196, DW_AT_name("ECAP1_INT"), DW_AT_symbol_name("_ECAP1_INT")
    2619                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2620                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2621              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2622                      .dwattr DW$197, DW_AT_name("ECAP2_INT"), DW_AT_symbol_name("_ECAP2_INT")
    2623                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2624                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2625              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2626                      .dwattr DW$198, DW_AT_name("ECAP3_INT"), DW_AT_symbol_name("_ECAP3_INT")
    2627                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2628                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2629              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2630                      .dwattr DW$199, DW_AT_name("ECAP4_INT"), DW_AT_symbol_name("_ECAP4_INT")
    2631                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2632                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2633              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2634                      .dwattr DW$200, DW_AT_name("rsvd4_5"), DW_AT_symbol_name("_rsvd4_5")
    2635                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2636                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2637              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2638                      .dwattr DW$201, DW_AT_name("rsvd4_6"), DW_AT_symbol_name("_rsvd4_6")
    2639                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2640                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2641              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2642                      .dwattr DW$202, DW_AT_name("rsvd4_7"), DW_AT_symbol_name("_rsvd4_7")
    2643                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2644                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2645              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2646                      .dwattr DW$203, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
    2647                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2648                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2649              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2650                      .dwattr DW$204, DW_AT_name("EQEP1_INT"), DW_AT_symbol_name("_EQEP1_INT")
    2651                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2652                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2653              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2654                      .dwattr DW$205, DW_AT_name("EQEP2_INT"), DW_AT_symbol_name("_EQEP2_INT")
    2655                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2656                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2657              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2658                      .dwattr DW$206, DW_AT_name("rsvd5_3"), DW_AT_symbol_name("_rsvd5_3")
    2659                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2660                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2661              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2662                      .dwattr DW$207, DW_AT_name("rsvd5_4"), DW_AT_symbol_name("_rsvd5_4")
    2663                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2664                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2665              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2666                      .dwattr DW$208, DW_AT_name("rsvd5_5"), DW_AT_symbol_name("_rsvd5_5")
    2667                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2668                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   57

    2669              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2670                      .dwattr DW$209, DW_AT_name("rsvd5_6"), DW_AT_symbol_name("_rsvd5_6")
    2671                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2672                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2673              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2674                      .dwattr DW$210, DW_AT_name("rsvd5_7"), DW_AT_symbol_name("_rsvd5_7")
    2675                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2676                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2677              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2678                      .dwattr DW$211, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
    2679                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2680                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2681              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2682                      .dwattr DW$212, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
    2683                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2684                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2685              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2686                      .dwattr DW$213, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
    2687                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2688                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2689              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2690                      .dwattr DW$214, DW_AT_name("SPIRXINTB"), DW_AT_symbol_name("_SPIRXINTB")
    2691                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2692                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2693              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2694                      .dwattr DW$215, DW_AT_name("SPITXINTB"), DW_AT_symbol_name("_SPITXINTB")
    2695                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2696                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2697              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2698                      .dwattr DW$216, DW_AT_name("SPIRXINTC"), DW_AT_symbol_name("_SPIRXINTC")
    2699                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2700                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2701              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2702                      .dwattr DW$217, DW_AT_name("SPITXINTC"), DW_AT_symbol_name("_SPITXINTC")
    2703                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2704                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2705              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2706                      .dwattr DW$218, DW_AT_name("SPIRXINTD"), DW_AT_symbol_name("_SPIRXINTD")
    2707                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2708                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2709              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2710                      .dwattr DW$219, DW_AT_name("SPITXINTD"), DW_AT_symbol_name("_SPITXINTD")
    2711                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2712                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2713              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2714                      .dwattr DW$220, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
    2715                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2716                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2717              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2718                      .dwattr DW$221, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
    2719                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2720                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2721              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2722                      .dwattr DW$222, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
    2723                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   58

    2724                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2725              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2726                      .dwattr DW$223, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
    2727                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2728                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2729              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2730                      .dwattr DW$224, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
    2731                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2732                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2733              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2734                      .dwattr DW$225, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
    2735                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2736                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2737              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2738                      .dwattr DW$226, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
    2739                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2740                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2741              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2742                      .dwattr DW$227, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
    2743                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2744                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2745              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2746                      .dwattr DW$228, DW_AT_name("I2CINT1A"), DW_AT_symbol_name("_I2CINT1A")
    2747                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2748                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2749              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2750                      .dwattr DW$229, DW_AT_name("I2CINT2A"), DW_AT_symbol_name("_I2CINT2A")
    2751                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2752                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2753              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2754                      .dwattr DW$230, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
    2755                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2756                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2757              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2758                      .dwattr DW$231, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
    2759                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2760                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2761              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2762                      .dwattr DW$232, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
    2763                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2764                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2765              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2766                      .dwattr DW$233, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
    2767                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2768                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2769              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2770                      .dwattr DW$234, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
    2771                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2772                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2773              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2774                      .dwattr DW$235, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
    2775                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2776                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2777              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2778                      .dwattr DW$236, DW_AT_name("SCIRXINTA"), DW_AT_symbol_name("_SCIRXINTA")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   59

    2779                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2780                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2781              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2782                      .dwattr DW$237, DW_AT_name("SCITXINTA"), DW_AT_symbol_name("_SCITXINTA")
    2783                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2784                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2785              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2786                      .dwattr DW$238, DW_AT_name("SCIRXINTB"), DW_AT_symbol_name("_SCIRXINTB")
    2787                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2788                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2789              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2790                      .dwattr DW$239, DW_AT_name("SCITXINTB"), DW_AT_symbol_name("_SCITXINTB")
    2791                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2792                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2793              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2794                      .dwattr DW$240, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
    2795                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2796                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2797              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2798                      .dwattr DW$241, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
    2799                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2800                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2801              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2802                      .dwattr DW$242, DW_AT_name("ECAN0INTB"), DW_AT_symbol_name("_ECAN0INTB")
    2803                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2804                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2805              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2806                      .dwattr DW$243, DW_AT_name("ECAN1INTB"), DW_AT_symbol_name("_ECAN1INTB")
    2807                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2808                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2809              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2810                      .dwattr DW$244, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
    2811                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2812                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2813              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2814                      .dwattr DW$245, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
    2815                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2816                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2817              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2818                      .dwattr DW$246, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
    2819                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2820                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2821              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2822                      .dwattr DW$247, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
    2823                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2824                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2825              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2826                      .dwattr DW$248, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
    2827                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2828                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2829              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2830                      .dwattr DW$249, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
    2831                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2832                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2833              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   60

    2834                      .dwattr DW$250, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
    2835                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2836                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2837              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2838                      .dwattr DW$251, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
    2839                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2840                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2841              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2842                      .dwattr DW$252, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
    2843                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2844                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2845              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2846                      .dwattr DW$253, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
    2847                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2848                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2849              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2850                      .dwattr DW$254, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
    2851                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2852                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2853              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2854                      .dwattr DW$255, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
    2855                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2856                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2857              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2858                      .dwattr DW$256, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
    2859                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2860                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2861              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2862                      .dwattr DW$257, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
    2863                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2864                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2865              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2866                      .dwattr DW$258, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
    2867                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2868                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2869              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2870                      .dwattr DW$259, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
    2871                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2872                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2873              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2874                      .dwattr DW$260, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
    2875                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2876                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2877              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2878                      .dwattr DW$261, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
    2879                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2880                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2881              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2882                      .dwattr DW$262, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
    2883                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2884                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2885              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2886                      .dwattr DW$263, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
    2887                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2888                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   61

    2889              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2890                      .dwattr DW$264, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
    2891                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2892                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2893              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2894                      .dwattr DW$265, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
    2895                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2896                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2897              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2898                      .dwattr DW$266, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
    2899                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2900                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2901              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2902                      .dwattr DW$267, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
    2903                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2904                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2905                      .dwendtag DW$T$124
    2906              
    2907              DW$268  .dwtag  DW_TAG_far_type
    2908                      .dwattr DW$268, DW_AT_type(*DW$T$144)
    2909              DW$T$217        .dwtag  DW_TAG_volatile_type
    2910                      .dwattr DW$T$217, DW_AT_type(*DW$268)
    2911              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$122)
    2912                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    2913              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2914                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2915                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2916              DW$T$158        .dwtag  DW_TAG_typedef, DW_AT_name("_iq28"), DW_AT_type(*DW$T$12)
    2917                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    2918              
    2919              DW$T$45 .dwtag  DW_TAG_structure_type
    2920                      .dwattr DW$T$45, DW_AT_name("ADC_REGS")
    2921                      .dwattr DW$T$45, DW_AT_byte_size(0x1e)
    2922              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2923                      .dwattr DW$269, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
    2924                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2925                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2926              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2927                      .dwattr DW$270, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
    2928                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2929                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2930              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2931                      .dwattr DW$271, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
    2932                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2933                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2934              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2935                      .dwattr DW$272, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
    2936                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2937                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2938              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2939                      .dwattr DW$273, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
    2940                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2941                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2942              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2943                      .dwattr DW$274, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   62

    2944                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2945                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2946              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2947                      .dwattr DW$275, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
    2948                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2949                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2950              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2951                      .dwattr DW$276, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
    2952                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2953                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2954              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2955                      .dwattr DW$277, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
    2956                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2957                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2958              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2959                      .dwattr DW$278, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
    2960                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2961                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2962              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2963                      .dwattr DW$279, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
    2964                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2965                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2966              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2967                      .dwattr DW$280, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
    2968                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2969                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2970              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2971                      .dwattr DW$281, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
    2972                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2973                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2974              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2975                      .dwattr DW$282, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
    2976                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2977                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2978              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2979                      .dwattr DW$283, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
    2980                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2981                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2982              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2983                      .dwattr DW$284, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
    2984                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2985                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2986              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2987                      .dwattr DW$285, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
    2988                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2989                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2990              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2991                      .dwattr DW$286, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
    2992                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2993                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2994              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2995                      .dwattr DW$287, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
    2996                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2997                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2998              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   63

    2999                      .dwattr DW$288, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
    3000                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3001                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3002              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3003                      .dwattr DW$289, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
    3004                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3005                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3006              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3007                      .dwattr DW$290, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
    3008                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3009                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3010              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3011                      .dwattr DW$291, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
    3012                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3013                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3014              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3015                      .dwattr DW$292, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
    3016                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3017                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3018              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3019                      .dwattr DW$293, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
    3020                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3021                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3022              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3023                      .dwattr DW$294, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
    3024                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3025                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3026              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3027                      .dwattr DW$295, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3028                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3029                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3030              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3031                      .dwattr DW$296, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3032                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3033                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3034              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3035                      .dwattr DW$297, DW_AT_name("ADCREFSEL"), DW_AT_symbol_name("_ADCREFSEL")
    3036                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3037                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3038              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3039                      .dwattr DW$298, DW_AT_name("ADCOFFTRIM"), DW_AT_symbol_name("_ADCOFFTRIM")
    3040                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3041                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3042                      .dwendtag DW$T$45
    3043              
    3044              
    3045              DW$T$91 .dwtag  DW_TAG_structure_type
    3046                      .dwattr DW$T$91, DW_AT_name("EPWM_REGS")
    3047                      .dwattr DW$T$91, DW_AT_byte_size(0x22)
    3048              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3049                      .dwattr DW$299, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
    3050                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3051                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3052              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3053                      .dwattr DW$300, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   64

    3054                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3055                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3056              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3057                      .dwattr DW$301, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
    3058                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3059                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3060              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3061                      .dwattr DW$302, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
    3062                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3063                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3064              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3065                      .dwattr DW$303, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
    3066                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3067                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3068              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3069                      .dwattr DW$304, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3070                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3071                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3072              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3073                      .dwattr DW$305, DW_AT_name("CMPCTL"), DW_AT_symbol_name("_CMPCTL")
    3074                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3075                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3076              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    3077                      .dwattr DW$306, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
    3078                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3079                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3080              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3081                      .dwattr DW$307, DW_AT_name("CMPB"), DW_AT_symbol_name("_CMPB")
    3082                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3083                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3084              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3085                      .dwattr DW$308, DW_AT_name("AQCTLA"), DW_AT_symbol_name("_AQCTLA")
    3086                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3087                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3088              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3089                      .dwattr DW$309, DW_AT_name("AQCTLB"), DW_AT_symbol_name("_AQCTLB")
    3090                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3091                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3092              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3093                      .dwattr DW$310, DW_AT_name("AQSFRC"), DW_AT_symbol_name("_AQSFRC")
    3094                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3095                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3096              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3097                      .dwattr DW$311, DW_AT_name("AQCSFRC"), DW_AT_symbol_name("_AQCSFRC")
    3098                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3099                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3100              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3101                      .dwattr DW$312, DW_AT_name("DBCTL"), DW_AT_symbol_name("_DBCTL")
    3102                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3103                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3104              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3105                      .dwattr DW$313, DW_AT_name("DBRED"), DW_AT_symbol_name("_DBRED")
    3106                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3107                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3108              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   65

    3109                      .dwattr DW$314, DW_AT_name("DBFED"), DW_AT_symbol_name("_DBFED")
    3110                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3111                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3112              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3113                      .dwattr DW$315, DW_AT_name("TZSEL"), DW_AT_symbol_name("_TZSEL")
    3114                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3115                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3116              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3117                      .dwattr DW$316, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3118                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3119                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3120              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3121                      .dwattr DW$317, DW_AT_name("TZCTL"), DW_AT_symbol_name("_TZCTL")
    3122                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3123                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3124              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3125                      .dwattr DW$318, DW_AT_name("TZEINT"), DW_AT_symbol_name("_TZEINT")
    3126                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3127                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3128              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3129                      .dwattr DW$319, DW_AT_name("TZFLG"), DW_AT_symbol_name("_TZFLG")
    3130                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3131                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3132              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3133                      .dwattr DW$320, DW_AT_name("TZCLR"), DW_AT_symbol_name("_TZCLR")
    3134                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3135                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3136              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3137                      .dwattr DW$321, DW_AT_name("TZFRC"), DW_AT_symbol_name("_TZFRC")
    3138                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3139                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3140              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    3141                      .dwattr DW$322, DW_AT_name("ETSEL"), DW_AT_symbol_name("_ETSEL")
    3142                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3143                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3144              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3145                      .dwattr DW$323, DW_AT_name("ETPS"), DW_AT_symbol_name("_ETPS")
    3146                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3147                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3148              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3149                      .dwattr DW$324, DW_AT_name("ETFLG"), DW_AT_symbol_name("_ETFLG")
    3150                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3151                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3152              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3153                      .dwattr DW$325, DW_AT_name("ETCLR"), DW_AT_symbol_name("_ETCLR")
    3154                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3155                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3156              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3157                      .dwattr DW$326, DW_AT_name("ETFRC"), DW_AT_symbol_name("_ETFRC")
    3158                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3159                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3160              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3161                      .dwattr DW$327, DW_AT_name("PCCTL"), DW_AT_symbol_name("_PCCTL")
    3162                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3163                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   66

    3164              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3165                      .dwattr DW$328, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3166                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3167                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3168              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3169                      .dwattr DW$329, DW_AT_name("HRCNFG"), DW_AT_symbol_name("_HRCNFG")
    3170                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3171                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3172                      .dwendtag DW$T$91
    3173              
    3174              
    3175              DW$T$109        .dwtag  DW_TAG_structure_type
    3176                      .dwattr DW$T$109, DW_AT_name("GPIO_CTRL_REGS")
    3177                      .dwattr DW$T$109, DW_AT_byte_size(0x40)
    3178              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3179                      .dwattr DW$330, DW_AT_name("GPACTRL"), DW_AT_symbol_name("_GPACTRL")
    3180                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3181                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3182              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3183                      .dwattr DW$331, DW_AT_name("GPAQSEL1"), DW_AT_symbol_name("_GPAQSEL1")
    3184                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3185                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3186              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3187                      .dwattr DW$332, DW_AT_name("GPAQSEL2"), DW_AT_symbol_name("_GPAQSEL2")
    3188                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3189                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3190              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3191                      .dwattr DW$333, DW_AT_name("GPAMUX1"), DW_AT_symbol_name("_GPAMUX1")
    3192                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3193                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3194              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3195                      .dwattr DW$334, DW_AT_name("GPAMUX2"), DW_AT_symbol_name("_GPAMUX2")
    3196                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3197                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3198              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3199                      .dwattr DW$335, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3200                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3201                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3202              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3203                      .dwattr DW$336, DW_AT_name("GPAPUD"), DW_AT_symbol_name("_GPAPUD")
    3204                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3205                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3206              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3207                      .dwattr DW$337, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3208                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3209                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3210              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3211                      .dwattr DW$338, DW_AT_name("GPBCTRL"), DW_AT_symbol_name("_GPBCTRL")
    3212                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3213                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3214              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3215                      .dwattr DW$339, DW_AT_name("GPBQSEL1"), DW_AT_symbol_name("_GPBQSEL1")
    3216                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3217                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3218              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   67

    3219                      .dwattr DW$340, DW_AT_name("GPBQSEL2"), DW_AT_symbol_name("_GPBQSEL2")
    3220                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3221                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3222              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3223                      .dwattr DW$341, DW_AT_name("GPBMUX1"), DW_AT_symbol_name("_GPBMUX1")
    3224                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3225                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3226              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3227                      .dwattr DW$342, DW_AT_name("GPBMUX2"), DW_AT_symbol_name("_GPBMUX2")
    3228                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3229                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3230              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3231                      .dwattr DW$343, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3232                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3233                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3234              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3235                      .dwattr DW$344, DW_AT_name("GPBPUD"), DW_AT_symbol_name("_GPBPUD")
    3236                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3237                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3238              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    3239                      .dwattr DW$345, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3240                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3241                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3242                      .dwendtag DW$T$109
    3243              
    3244              
    3245              DW$T$111        .dwtag  DW_TAG_structure_type
    3246                      .dwattr DW$T$111, DW_AT_name("GPIO_DATA_REGS")
    3247                      .dwattr DW$T$111, DW_AT_byte_size(0x20)
    3248              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3249                      .dwattr DW$346, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3250                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3251                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3252              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3253                      .dwattr DW$347, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3254                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3255                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3256              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3257                      .dwattr DW$348, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3258                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3259                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3260              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3261                      .dwattr DW$349, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3262                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3263                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3264              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3265                      .dwattr DW$350, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3266                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3267                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3268              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3269                      .dwattr DW$351, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3270                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3271                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3272              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3273                      .dwattr DW$352, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   68

    3274                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3275                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3276              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3277                      .dwattr DW$353, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3278                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3279                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3280              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    3281                      .dwattr DW$354, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3282                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3283                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3284                      .dwendtag DW$T$111
    3285              
    3286              
    3287              DW$T$120        .dwtag  DW_TAG_structure_type
    3288                      .dwattr DW$T$120, DW_AT_name("PIE_CTRL_REGS")
    3289                      .dwattr DW$T$120, DW_AT_byte_size(0x1a)
    3290              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3291                      .dwattr DW$355, DW_AT_name("PIECTRL"), DW_AT_symbol_name("_PIECTRL")
    3292                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3293                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3294              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3295                      .dwattr DW$356, DW_AT_name("PIEACK"), DW_AT_symbol_name("_PIEACK")
    3296                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3297                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3298              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3299                      .dwattr DW$357, DW_AT_name("PIEIER1"), DW_AT_symbol_name("_PIEIER1")
    3300                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3301                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3302              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3303                      .dwattr DW$358, DW_AT_name("PIEIFR1"), DW_AT_symbol_name("_PIEIFR1")
    3304                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3305                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3306              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3307                      .dwattr DW$359, DW_AT_name("PIEIER2"), DW_AT_symbol_name("_PIEIER2")
    3308                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3309                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3310              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3311                      .dwattr DW$360, DW_AT_name("PIEIFR2"), DW_AT_symbol_name("_PIEIFR2")
    3312                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3313                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3314              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3315                      .dwattr DW$361, DW_AT_name("PIEIER3"), DW_AT_symbol_name("_PIEIER3")
    3316                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3317                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3318              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3319                      .dwattr DW$362, DW_AT_name("PIEIFR3"), DW_AT_symbol_name("_PIEIFR3")
    3320                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3321                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3322              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3323                      .dwattr DW$363, DW_AT_name("PIEIER4"), DW_AT_symbol_name("_PIEIER4")
    3324                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3325                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3326              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3327                      .dwattr DW$364, DW_AT_name("PIEIFR4"), DW_AT_symbol_name("_PIEIFR4")
    3328                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   69

    3329                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3330              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3331                      .dwattr DW$365, DW_AT_name("PIEIER5"), DW_AT_symbol_name("_PIEIER5")
    3332                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3333                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3334              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3335                      .dwattr DW$366, DW_AT_name("PIEIFR5"), DW_AT_symbol_name("_PIEIFR5")
    3336                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3337                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3338              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3339                      .dwattr DW$367, DW_AT_name("PIEIER6"), DW_AT_symbol_name("_PIEIER6")
    3340                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3341                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3342              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3343                      .dwattr DW$368, DW_AT_name("PIEIFR6"), DW_AT_symbol_name("_PIEIFR6")
    3344                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3345                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3346              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3347                      .dwattr DW$369, DW_AT_name("PIEIER7"), DW_AT_symbol_name("_PIEIER7")
    3348                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3349                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3350              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3351                      .dwattr DW$370, DW_AT_name("PIEIFR7"), DW_AT_symbol_name("_PIEIFR7")
    3352                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3353                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3354              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3355                      .dwattr DW$371, DW_AT_name("PIEIER8"), DW_AT_symbol_name("_PIEIER8")
    3356                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3357                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3358              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3359                      .dwattr DW$372, DW_AT_name("PIEIFR8"), DW_AT_symbol_name("_PIEIFR8")
    3360                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3361                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3362              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3363                      .dwattr DW$373, DW_AT_name("PIEIER9"), DW_AT_symbol_name("_PIEIER9")
    3364                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3365                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3366              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3367                      .dwattr DW$374, DW_AT_name("PIEIFR9"), DW_AT_symbol_name("_PIEIFR9")
    3368                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3369                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3370              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3371                      .dwattr DW$375, DW_AT_name("PIEIER10"), DW_AT_symbol_name("_PIEIER10")
    3372                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3373                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3374              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3375                      .dwattr DW$376, DW_AT_name("PIEIFR10"), DW_AT_symbol_name("_PIEIFR10")
    3376                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3377                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3378              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3379                      .dwattr DW$377, DW_AT_name("PIEIER11"), DW_AT_symbol_name("_PIEIER11")
    3380                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3381                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3382              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3383                      .dwattr DW$378, DW_AT_name("PIEIFR11"), DW_AT_symbol_name("_PIEIFR11")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 20:15:15 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8882                            PAGE   70

    3384                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3385                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3386              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3387                      .dwattr DW$379, DW_AT_name("PIEIER12"), DW_AT_symbol_name("_PIEIER12")
    3388                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3389                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3390              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3391                      .dwattr DW$380, DW_AT_name("PIEIFR12"), DW_AT_symbol_name("_PIEIFR12")
    3392                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3393                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3394                      .dwendtag DW$T$120
    3395              
    3396              
    3397              DW$T$144        .dwtag  DW_TAG_structure_type
    3398                      .dwattr DW$T$144, DW_AT_name("SYS_CTRL_REGS")
    3399                      .dwattr DW$T$144, DW_AT_byte_size(0x20)
    3400              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    3401                      .dwattr DW$381, DW_AT_name("XCLK"), DW_AT_symbol_name("_XCLK")
    3402                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3403                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3404              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    3405                      .dwattr DW$382, DW_AT_name("PLLSTS"), DW_AT_symbol_name("_PLLSTS")
    3406                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3407                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3408              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    3409                      .dwattr DW$383, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
