TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Mon Dec 21 14:54:54 2009                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mainfeedforward.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2457              DW$138  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2458              DW$139  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2459                      .dwendtag DW$T$147
    2460              
    2461              
    2462              DW$T$148        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2463                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    2464              DW$140  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2465              DW$141  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2466              DW$142  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2467                      .dwendtag DW$T$148
    2468              
    2469              
    2470              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2471                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    2472              DW$143  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2473              DW$144  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2474                      .dwendtag DW$T$149
    2475              
    2476              
    2477              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2478                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    2479              DW$145  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2480                      .dwendtag DW$T$151
    2481              
    2482              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("_iq"), DW_AT_type(*DW$T$12)
    2483                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    2484              
    2485              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   54

    2486                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    2487                      .dwattr DW$T$154, DW_AT_byte_size(0x0c)
    2488              DW$146  .dwtag  DW_TAG_subrange_type
    2489                      .dwattr DW$146, DW_AT_upper_bound(0x05)
    2490                      .dwendtag DW$T$154
    2491              
    2492              
    2493              DW$T$155        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2494                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    2495                      .dwattr DW$T$155, DW_AT_byte_size(0x06)
    2496              DW$147  .dwtag  DW_TAG_subrange_type
    2497                      .dwattr DW$147, DW_AT_upper_bound(0x02)
    2498                      .dwendtag DW$T$155
    2499              
    2500              
    2501              DW$T$156        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2502                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    2503                      .dwattr DW$T$156, DW_AT_byte_size(0x04)
    2504              DW$148  .dwtag  DW_TAG_subrange_type
    2505                      .dwattr DW$148, DW_AT_upper_bound(0x01)
    2506                      .dwendtag DW$T$156
    2507              
    2508              
    2509              DW$T$159        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$158)
    2510                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    2511                      .dwattr DW$T$159, DW_AT_byte_size(0x0c)
    2512              DW$149  .dwtag  DW_TAG_subrange_type
    2513                      .dwattr DW$149, DW_AT_upper_bound(0x05)
    2514                      .dwendtag DW$T$159
    2515              
    2516              DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("_iq30"), DW_AT_type(*DW$T$12)
    2517                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    2518              DW$T$162        .dwtag  DW_TAG_typedef, DW_AT_name("_iq15"), DW_AT_type(*DW$T$12)
    2519                      .dwattr DW$T$162, DW_AT_language(DW_LANG_C)
    2520              DW$150  .dwtag  DW_TAG_far_type
    2521                      .dwattr DW$150, DW_AT_type(*DW$T$45)
    2522              DW$T$175        .dwtag  DW_TAG_volatile_type
    2523                      .dwattr DW$T$175, DW_AT_type(*DW$150)
    2524              DW$151  .dwtag  DW_TAG_far_type
    2525                      .dwattr DW$151, DW_AT_type(*DW$T$91)
    2526              DW$T$204        .dwtag  DW_TAG_volatile_type
    2527                      .dwattr DW$T$204, DW_AT_type(*DW$151)
    2528              DW$152  .dwtag  DW_TAG_far_type
    2529                      .dwattr DW$152, DW_AT_type(*DW$T$109)
    2530              DW$T$211        .dwtag  DW_TAG_volatile_type
    2531                      .dwattr DW$T$211, DW_AT_type(*DW$152)
    2532              DW$153  .dwtag  DW_TAG_far_type
    2533                      .dwattr DW$153, DW_AT_type(*DW$T$111)
    2534              DW$T$212        .dwtag  DW_TAG_volatile_type
    2535                      .dwattr DW$T$212, DW_AT_type(*DW$153)
    2536              DW$154  .dwtag  DW_TAG_far_type
    2537                      .dwattr DW$154, DW_AT_type(*DW$T$120)
    2538              DW$T$216        .dwtag  DW_TAG_volatile_type
    2539                      .dwattr DW$T$216, DW_AT_type(*DW$154)
    2540              
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   55

    2541              DW$T$124        .dwtag  DW_TAG_structure_type
    2542                      .dwattr DW$T$124, DW_AT_name("PIE_VECT_TABLE")
    2543                      .dwattr DW$T$124, DW_AT_byte_size(0x100)
    2544              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2545                      .dwattr DW$155, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
    2546                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2548              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2549                      .dwattr DW$156, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
    2550                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2551                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2552              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2553                      .dwattr DW$157, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
    2554                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2555                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2556              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2557                      .dwattr DW$158, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
    2558                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2559                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2560              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2561                      .dwattr DW$159, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
    2562                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2563                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2564              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2565                      .dwattr DW$160, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
    2566                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2567                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2568              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2569                      .dwattr DW$161, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
    2570                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2571                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2572              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2573                      .dwattr DW$162, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
    2574                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2575                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2576              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2577                      .dwattr DW$163, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
    2578                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2579                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2580              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2581                      .dwattr DW$164, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
    2582                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2583                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2584              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2585                      .dwattr DW$165, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
    2586                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2587                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2588              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2589                      .dwattr DW$166, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
    2590                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2591                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2592              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2593                      .dwattr DW$167, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
    2594                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2595                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   56

    2596              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2597                      .dwattr DW$168, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
    2598                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2599                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2600              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2601                      .dwattr DW$169, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
    2602                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2603                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2604              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2605                      .dwattr DW$170, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
    2606                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2607                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2608              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2609                      .dwattr DW$171, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
    2610                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2611                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2612              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2613                      .dwattr DW$172, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
    2614                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2615                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2616              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2617                      .dwattr DW$173, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
    2618                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2619                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2620              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2621                      .dwattr DW$174, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
    2622                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2623                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2624              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2625                      .dwattr DW$175, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
    2626                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2627                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2628              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2629                      .dwattr DW$176, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
    2630                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2631                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2632              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2633                      .dwattr DW$177, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
    2634                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2635                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2636              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2637                      .dwattr DW$178, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
    2638                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2639                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2640              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2641                      .dwattr DW$179, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
    2642                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2643                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2644              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2645                      .dwattr DW$180, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
    2646                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2647                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2648              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2649                      .dwattr DW$181, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
    2650                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   57

    2651                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2652              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2653                      .dwattr DW$182, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
    2654                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2655                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2656              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2657                      .dwattr DW$183, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
    2658                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2659                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2660              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2661                      .dwattr DW$184, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
    2662                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2663                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2664              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2665                      .dwattr DW$185, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
    2666                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2667                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2668              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2669                      .dwattr DW$186, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
    2670                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2671                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2672              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2673                      .dwattr DW$187, DW_AT_name("SEQ1INT"), DW_AT_symbol_name("_SEQ1INT")
    2674                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2675                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2676              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2677                      .dwattr DW$188, DW_AT_name("SEQ2INT"), DW_AT_symbol_name("_SEQ2INT")
    2678                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2679                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2680              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2681                      .dwattr DW$189, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
    2682                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2683                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2684              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2685                      .dwattr DW$190, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
    2686                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2687                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2688              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2689                      .dwattr DW$191, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
    2690                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2691                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2692              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2693                      .dwattr DW$192, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
    2694                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2695                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2696              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2697                      .dwattr DW$193, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
    2698                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2699                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2700              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2701                      .dwattr DW$194, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
    2702                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2703                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2704              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2705                      .dwattr DW$195, DW_AT_name("EPWM1_TZINT"), DW_AT_symbol_name("_EPWM1_TZINT")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   58

    2706                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2707                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2708              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2709                      .dwattr DW$196, DW_AT_name("EPWM2_TZINT"), DW_AT_symbol_name("_EPWM2_TZINT")
    2710                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2711                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2712              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2713                      .dwattr DW$197, DW_AT_name("EPWM3_TZINT"), DW_AT_symbol_name("_EPWM3_TZINT")
    2714                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2715                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2716              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2717                      .dwattr DW$198, DW_AT_name("EPWM4_TZINT"), DW_AT_symbol_name("_EPWM4_TZINT")
    2718                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2719                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2720              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2721                      .dwattr DW$199, DW_AT_name("EPWM5_TZINT"), DW_AT_symbol_name("_EPWM5_TZINT")
    2722                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2723                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2724              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2725                      .dwattr DW$200, DW_AT_name("EPWM6_TZINT"), DW_AT_symbol_name("_EPWM6_TZINT")
    2726                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2727                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2728              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2729                      .dwattr DW$201, DW_AT_name("rsvd2_7"), DW_AT_symbol_name("_rsvd2_7")
    2730                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2731                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2732              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2733                      .dwattr DW$202, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
    2734                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2735                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2736              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2737                      .dwattr DW$203, DW_AT_name("EPWM1_INT"), DW_AT_symbol_name("_EPWM1_INT")
    2738                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2739                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2740              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2741                      .dwattr DW$204, DW_AT_name("EPWM2_INT"), DW_AT_symbol_name("_EPWM2_INT")
    2742                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2743                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2744              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2745                      .dwattr DW$205, DW_AT_name("EPWM3_INT"), DW_AT_symbol_name("_EPWM3_INT")
    2746                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2747                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2748              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2749                      .dwattr DW$206, DW_AT_name("EPWM4_INT"), DW_AT_symbol_name("_EPWM4_INT")
    2750                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2751                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2752              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2753                      .dwattr DW$207, DW_AT_name("EPWM5_INT"), DW_AT_symbol_name("_EPWM5_INT")
    2754                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2755                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2756              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2757                      .dwattr DW$208, DW_AT_name("EPWM6_INT"), DW_AT_symbol_name("_EPWM6_INT")
    2758                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2759                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2760              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   59

    2761                      .dwattr DW$209, DW_AT_name("rsvd3_7"), DW_AT_symbol_name("_rsvd3_7")
    2762                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2763                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2764              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2765                      .dwattr DW$210, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
    2766                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2767                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2768              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2769                      .dwattr DW$211, DW_AT_name("ECAP1_INT"), DW_AT_symbol_name("_ECAP1_INT")
    2770                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2771                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2772              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2773                      .dwattr DW$212, DW_AT_name("ECAP2_INT"), DW_AT_symbol_name("_ECAP2_INT")
    2774                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2775                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2776              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2777                      .dwattr DW$213, DW_AT_name("ECAP3_INT"), DW_AT_symbol_name("_ECAP3_INT")
    2778                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2779                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2780              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2781                      .dwattr DW$214, DW_AT_name("ECAP4_INT"), DW_AT_symbol_name("_ECAP4_INT")
    2782                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2783                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2784              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2785                      .dwattr DW$215, DW_AT_name("rsvd4_5"), DW_AT_symbol_name("_rsvd4_5")
    2786                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2787                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2788              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2789                      .dwattr DW$216, DW_AT_name("rsvd4_6"), DW_AT_symbol_name("_rsvd4_6")
    2790                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2791                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2792              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2793                      .dwattr DW$217, DW_AT_name("rsvd4_7"), DW_AT_symbol_name("_rsvd4_7")
    2794                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2795                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2796              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2797                      .dwattr DW$218, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
    2798                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2799                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2800              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2801                      .dwattr DW$219, DW_AT_name("EQEP1_INT"), DW_AT_symbol_name("_EQEP1_INT")
    2802                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2803                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2804              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2805                      .dwattr DW$220, DW_AT_name("EQEP2_INT"), DW_AT_symbol_name("_EQEP2_INT")
    2806                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2807                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2808              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2809                      .dwattr DW$221, DW_AT_name("rsvd5_3"), DW_AT_symbol_name("_rsvd5_3")
    2810                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2811                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2812              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2813                      .dwattr DW$222, DW_AT_name("rsvd5_4"), DW_AT_symbol_name("_rsvd5_4")
    2814                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2815                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   60

    2816              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2817                      .dwattr DW$223, DW_AT_name("rsvd5_5"), DW_AT_symbol_name("_rsvd5_5")
    2818                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2819                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2820              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2821                      .dwattr DW$224, DW_AT_name("rsvd5_6"), DW_AT_symbol_name("_rsvd5_6")
    2822                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2823                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2824              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2825                      .dwattr DW$225, DW_AT_name("rsvd5_7"), DW_AT_symbol_name("_rsvd5_7")
    2826                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2827                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2828              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2829                      .dwattr DW$226, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
    2830                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2831                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2832              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2833                      .dwattr DW$227, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
    2834                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2835                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2836              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2837                      .dwattr DW$228, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
    2838                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2839                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2840              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2841                      .dwattr DW$229, DW_AT_name("SPIRXINTB"), DW_AT_symbol_name("_SPIRXINTB")
    2842                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2843                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2844              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2845                      .dwattr DW$230, DW_AT_name("SPITXINTB"), DW_AT_symbol_name("_SPITXINTB")
    2846                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2847                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2848              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2849                      .dwattr DW$231, DW_AT_name("SPIRXINTC"), DW_AT_symbol_name("_SPIRXINTC")
    2850                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2851                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2852              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2853                      .dwattr DW$232, DW_AT_name("SPITXINTC"), DW_AT_symbol_name("_SPITXINTC")
    2854                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2855                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2856              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2857                      .dwattr DW$233, DW_AT_name("SPIRXINTD"), DW_AT_symbol_name("_SPIRXINTD")
    2858                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2859                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2860              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2861                      .dwattr DW$234, DW_AT_name("SPITXINTD"), DW_AT_symbol_name("_SPITXINTD")
    2862                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2863                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2864              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2865                      .dwattr DW$235, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
    2866                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2867                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2868              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2869                      .dwattr DW$236, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
    2870                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   61

    2871                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2872              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2873                      .dwattr DW$237, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
    2874                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2875                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2876              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2877                      .dwattr DW$238, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
    2878                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2879                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2880              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2881                      .dwattr DW$239, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
    2882                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2883                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2884              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2885                      .dwattr DW$240, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
    2886                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2887                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2888              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2889                      .dwattr DW$241, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
    2890                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2891                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2892              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2893                      .dwattr DW$242, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
    2894                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2895                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2896              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2897                      .dwattr DW$243, DW_AT_name("I2CINT1A"), DW_AT_symbol_name("_I2CINT1A")
    2898                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2899                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2900              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2901                      .dwattr DW$244, DW_AT_name("I2CINT2A"), DW_AT_symbol_name("_I2CINT2A")
    2902                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2903                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2904              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2905                      .dwattr DW$245, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
    2906                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2907                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2908              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2909                      .dwattr DW$246, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
    2910                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2911                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2912              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2913                      .dwattr DW$247, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
    2914                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2915                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2916              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2917                      .dwattr DW$248, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
    2918                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2919                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2920              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2921                      .dwattr DW$249, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
    2922                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2923                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2924              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2925                      .dwattr DW$250, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   62

    2926                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2927                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2928              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2929                      .dwattr DW$251, DW_AT_name("SCIRXINTA"), DW_AT_symbol_name("_SCIRXINTA")
    2930                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2931                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2932              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2933                      .dwattr DW$252, DW_AT_name("SCITXINTA"), DW_AT_symbol_name("_SCITXINTA")
    2934                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2935                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2936              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2937                      .dwattr DW$253, DW_AT_name("SCIRXINTB"), DW_AT_symbol_name("_SCIRXINTB")
    2938                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2939                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2940              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2941                      .dwattr DW$254, DW_AT_name("SCITXINTB"), DW_AT_symbol_name("_SCITXINTB")
    2942                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2943                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2944              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2945                      .dwattr DW$255, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
    2946                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2947                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2948              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2949                      .dwattr DW$256, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
    2950                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2951                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2952              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2953                      .dwattr DW$257, DW_AT_name("ECAN0INTB"), DW_AT_symbol_name("_ECAN0INTB")
    2954                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2955                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2956              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2957                      .dwattr DW$258, DW_AT_name("ECAN1INTB"), DW_AT_symbol_name("_ECAN1INTB")
    2958                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2959                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2960              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2961                      .dwattr DW$259, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
    2962                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2963                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2964              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2965                      .dwattr DW$260, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
    2966                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2967                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2968              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2969                      .dwattr DW$261, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
    2970                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2971                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2972              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2973                      .dwattr DW$262, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
    2974                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2975                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2976              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2977                      .dwattr DW$263, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
    2978                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2979                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2980              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   63

    2981                      .dwattr DW$264, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
    2982                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2983                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2984              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2985                      .dwattr DW$265, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
    2986                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2987                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2988              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2989                      .dwattr DW$266, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
    2990                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2991                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2992              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2993                      .dwattr DW$267, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
    2994                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2995                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2996              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2997                      .dwattr DW$268, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
    2998                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2999                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3000              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3001                      .dwattr DW$269, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
    3002                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3003                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3004              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3005                      .dwattr DW$270, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
    3006                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3007                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3008              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3009                      .dwattr DW$271, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
    3010                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3011                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3012              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3013                      .dwattr DW$272, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
    3014                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3015                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3016              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3017                      .dwattr DW$273, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
    3018                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3019                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3020              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3021                      .dwattr DW$274, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
    3022                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3023                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3024              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3025                      .dwattr DW$275, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
    3026                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3027                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3028              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3029                      .dwattr DW$276, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
    3030                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3031                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3032              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3033                      .dwattr DW$277, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
    3034                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3035                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   64

    3036              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3037                      .dwattr DW$278, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
    3038                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3039                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3040              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3041                      .dwattr DW$279, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
    3042                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3043                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3044              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3045                      .dwattr DW$280, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
    3046                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3047                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3048              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3049                      .dwattr DW$281, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
    3050                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3051                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3052              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3053                      .dwattr DW$282, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
    3054                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3055                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3056                      .dwendtag DW$T$124
    3057              
    3058              DW$283  .dwtag  DW_TAG_far_type
    3059                      .dwattr DW$283, DW_AT_type(*DW$T$144)
    3060              DW$T$219        .dwtag  DW_TAG_volatile_type
    3061                      .dwattr DW$T$219, DW_AT_type(*DW$283)
    3062              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$122)
    3063                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    3064              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3065                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3066                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3067              DW$T$158        .dwtag  DW_TAG_typedef, DW_AT_name("_iq28"), DW_AT_type(*DW$T$12)
    3068                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    3069              
    3070              DW$T$45 .dwtag  DW_TAG_structure_type
    3071                      .dwattr DW$T$45, DW_AT_name("ADC_REGS")
    3072                      .dwattr DW$T$45, DW_AT_byte_size(0x1e)
    3073              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    3074                      .dwattr DW$284, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
    3075                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3076                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3077              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3078                      .dwattr DW$285, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
    3079                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3080                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3081              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3082                      .dwattr DW$286, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
    3083                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3084                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3085              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3086                      .dwattr DW$287, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
    3087                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3088                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3089              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3090                      .dwattr DW$288, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   65

    3091                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3092                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3093              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3094                      .dwattr DW$289, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
    3095                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3096                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3097              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    3098                      .dwattr DW$290, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
    3099                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3100                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3101              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3102                      .dwattr DW$291, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
    3103                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3104                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3105              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3106                      .dwattr DW$292, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
    3107                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3108                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3109              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3110                      .dwattr DW$293, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
    3111                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3112                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3113              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3114                      .dwattr DW$294, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
    3115                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3116                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3117              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3118                      .dwattr DW$295, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
    3119                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3120                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3121              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3122                      .dwattr DW$296, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
    3123                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3124                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3125              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3126                      .dwattr DW$297, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
    3127                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3128                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3129              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3130                      .dwattr DW$298, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
    3131                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3132                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3134                      .dwattr DW$299, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
    3135                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3136                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3137              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3138                      .dwattr DW$300, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
    3139                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3140                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3141              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3142                      .dwattr DW$301, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
    3143                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3144                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3145              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   66

    3146                      .dwattr DW$302, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
    3147                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3148                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3149              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3150                      .dwattr DW$303, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
    3151                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3152                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3153              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3154                      .dwattr DW$304, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
    3155                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3156                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3157              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3158                      .dwattr DW$305, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
    3159                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3160                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3161              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3162                      .dwattr DW$306, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
    3163                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3164                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3165              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3166                      .dwattr DW$307, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
    3167                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3168                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3169              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3170                      .dwattr DW$308, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
    3171                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3172                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3173              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3174                      .dwattr DW$309, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
    3175                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3176                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3177              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3178                      .dwattr DW$310, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3179                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3180                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3181              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3182                      .dwattr DW$311, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3183                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3184                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3185              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3186                      .dwattr DW$312, DW_AT_name("ADCREFSEL"), DW_AT_symbol_name("_ADCREFSEL")
    3187                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3188                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3189              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3190                      .dwattr DW$313, DW_AT_name("ADCOFFTRIM"), DW_AT_symbol_name("_ADCOFFTRIM")
    3191                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3192                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3193                      .dwendtag DW$T$45
    3194              
    3195              
    3196              DW$T$91 .dwtag  DW_TAG_structure_type
    3197                      .dwattr DW$T$91, DW_AT_name("EPWM_REGS")
    3198                      .dwattr DW$T$91, DW_AT_byte_size(0x22)
    3199              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3200                      .dwattr DW$314, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   67

    3201                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3202                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3203              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3204                      .dwattr DW$315, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
    3205                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3206                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3207              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3208                      .dwattr DW$316, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
    3209                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3210                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3211              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3212                      .dwattr DW$317, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
    3213                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3214                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3215              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3216                      .dwattr DW$318, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
    3217                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3218                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3219              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3220                      .dwattr DW$319, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3221                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3222                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3223              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3224                      .dwattr DW$320, DW_AT_name("CMPCTL"), DW_AT_symbol_name("_CMPCTL")
    3225                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3226                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3227              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    3228                      .dwattr DW$321, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
    3229                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3230                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3231              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3232                      .dwattr DW$322, DW_AT_name("CMPB"), DW_AT_symbol_name("_CMPB")
    3233                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3234                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3235              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3236                      .dwattr DW$323, DW_AT_name("AQCTLA"), DW_AT_symbol_name("_AQCTLA")
    3237                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3238                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3239              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3240                      .dwattr DW$324, DW_AT_name("AQCTLB"), DW_AT_symbol_name("_AQCTLB")
    3241                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3242                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3243              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3244                      .dwattr DW$325, DW_AT_name("AQSFRC"), DW_AT_symbol_name("_AQSFRC")
    3245                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3246                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3247              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3248                      .dwattr DW$326, DW_AT_name("AQCSFRC"), DW_AT_symbol_name("_AQCSFRC")
    3249                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3250                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3251              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3252                      .dwattr DW$327, DW_AT_name("DBCTL"), DW_AT_symbol_name("_DBCTL")
    3253                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3254                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3255              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   68

    3256                      .dwattr DW$328, DW_AT_name("DBRED"), DW_AT_symbol_name("_DBRED")
    3257                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3258                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3259              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3260                      .dwattr DW$329, DW_AT_name("DBFED"), DW_AT_symbol_name("_DBFED")
    3261                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3262                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3263              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3264                      .dwattr DW$330, DW_AT_name("TZSEL"), DW_AT_symbol_name("_TZSEL")
    3265                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3266                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3267              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3268                      .dwattr DW$331, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3269                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3270                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3271              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3272                      .dwattr DW$332, DW_AT_name("TZCTL"), DW_AT_symbol_name("_TZCTL")
    3273                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3274                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3275              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3276                      .dwattr DW$333, DW_AT_name("TZEINT"), DW_AT_symbol_name("_TZEINT")
    3277                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3278                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3279              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3280                      .dwattr DW$334, DW_AT_name("TZFLG"), DW_AT_symbol_name("_TZFLG")
    3281                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3282                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3283              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3284                      .dwattr DW$335, DW_AT_name("TZCLR"), DW_AT_symbol_name("_TZCLR")
    3285                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3286                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3287              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3288                      .dwattr DW$336, DW_AT_name("TZFRC"), DW_AT_symbol_name("_TZFRC")
    3289                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3290                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3291              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    3292                      .dwattr DW$337, DW_AT_name("ETSEL"), DW_AT_symbol_name("_ETSEL")
    3293                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3294                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3295              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3296                      .dwattr DW$338, DW_AT_name("ETPS"), DW_AT_symbol_name("_ETPS")
    3297                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3298                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3299              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3300                      .dwattr DW$339, DW_AT_name("ETFLG"), DW_AT_symbol_name("_ETFLG")
    3301                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3302                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3303              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3304                      .dwattr DW$340, DW_AT_name("ETCLR"), DW_AT_symbol_name("_ETCLR")
    3305                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3306                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3307              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3308                      .dwattr DW$341, DW_AT_name("ETFRC"), DW_AT_symbol_name("_ETFRC")
    3309                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3310                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   69

    3311              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3312                      .dwattr DW$342, DW_AT_name("PCCTL"), DW_AT_symbol_name("_PCCTL")
    3313                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3314                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3315              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3316                      .dwattr DW$343, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3317                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3318                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3319              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3320                      .dwattr DW$344, DW_AT_name("HRCNFG"), DW_AT_symbol_name("_HRCNFG")
    3321                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3322                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3323                      .dwendtag DW$T$91
    3324              
    3325              
    3326              DW$T$109        .dwtag  DW_TAG_structure_type
    3327                      .dwattr DW$T$109, DW_AT_name("GPIO_CTRL_REGS")
    3328                      .dwattr DW$T$109, DW_AT_byte_size(0x40)
    3329              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3330                      .dwattr DW$345, DW_AT_name("GPACTRL"), DW_AT_symbol_name("_GPACTRL")
    3331                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3332                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3333              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3334                      .dwattr DW$346, DW_AT_name("GPAQSEL1"), DW_AT_symbol_name("_GPAQSEL1")
    3335                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3336                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3337              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3338                      .dwattr DW$347, DW_AT_name("GPAQSEL2"), DW_AT_symbol_name("_GPAQSEL2")
    3339                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3340                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3341              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3342                      .dwattr DW$348, DW_AT_name("GPAMUX1"), DW_AT_symbol_name("_GPAMUX1")
    3343                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3344                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3345              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3346                      .dwattr DW$349, DW_AT_name("GPAMUX2"), DW_AT_symbol_name("_GPAMUX2")
    3347                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3348                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3349              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3350                      .dwattr DW$350, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3351                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3352                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3353              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3354                      .dwattr DW$351, DW_AT_name("GPAPUD"), DW_AT_symbol_name("_GPAPUD")
    3355                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3356                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3357              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3358                      .dwattr DW$352, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3359                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3360                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3361              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3362                      .dwattr DW$353, DW_AT_name("GPBCTRL"), DW_AT_symbol_name("_GPBCTRL")
    3363                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3364                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3365              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   70

    3366                      .dwattr DW$354, DW_AT_name("GPBQSEL1"), DW_AT_symbol_name("_GPBQSEL1")
    3367                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3368                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3369              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3370                      .dwattr DW$355, DW_AT_name("GPBQSEL2"), DW_AT_symbol_name("_GPBQSEL2")
    3371                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3372                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3373              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3374                      .dwattr DW$356, DW_AT_name("GPBMUX1"), DW_AT_symbol_name("_GPBMUX1")
    3375                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3376                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3377              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3378                      .dwattr DW$357, DW_AT_name("GPBMUX2"), DW_AT_symbol_name("_GPBMUX2")
    3379                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3380                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3381              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3382                      .dwattr DW$358, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3383                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3384                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3385              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3386                      .dwattr DW$359, DW_AT_name("GPBPUD"), DW_AT_symbol_name("_GPBPUD")
    3387                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3388                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3389              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    3390                      .dwattr DW$360, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3391                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3392                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3393                      .dwendtag DW$T$109
    3394              
    3395              
    3396              DW$T$111        .dwtag  DW_TAG_structure_type
    3397                      .dwattr DW$T$111, DW_AT_name("GPIO_DATA_REGS")
    3398                      .dwattr DW$T$111, DW_AT_byte_size(0x20)
    3399              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3400                      .dwattr DW$361, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3401                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3403              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3404                      .dwattr DW$362, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3405                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3406                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3407              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3408                      .dwattr DW$363, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3409                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3410                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3411              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3412                      .dwattr DW$364, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3413                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3414                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3415              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3416                      .dwattr DW$365, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3417                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3418                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3419              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3420                      .dwattr DW$366, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   71

    3421                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3422                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3423              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3424                      .dwattr DW$367, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3425                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3426                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3427              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3428                      .dwattr DW$368, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3429                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3430                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3431              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    3432                      .dwattr DW$369, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3433                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3434                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3435                      .dwendtag DW$T$111
    3436              
    3437              
    3438              DW$T$120        .dwtag  DW_TAG_structure_type
    3439                      .dwattr DW$T$120, DW_AT_name("PIE_CTRL_REGS")
    3440                      .dwattr DW$T$120, DW_AT_byte_size(0x1a)
    3441              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3442                      .dwattr DW$370, DW_AT_name("PIECTRL"), DW_AT_symbol_name("_PIECTRL")
    3443                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3444                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3445              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3446                      .dwattr DW$371, DW_AT_name("PIEACK"), DW_AT_symbol_name("_PIEACK")
    3447                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3448                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3449              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3450                      .dwattr DW$372, DW_AT_name("PIEIER1"), DW_AT_symbol_name("_PIEIER1")
    3451                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3452                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3453              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3454                      .dwattr DW$373, DW_AT_name("PIEIFR1"), DW_AT_symbol_name("_PIEIFR1")
    3455                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3456                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3457              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3458                      .dwattr DW$374, DW_AT_name("PIEIER2"), DW_AT_symbol_name("_PIEIER2")
    3459                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3460                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3461              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3462                      .dwattr DW$375, DW_AT_name("PIEIFR2"), DW_AT_symbol_name("_PIEIFR2")
    3463                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3464                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3465              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3466                      .dwattr DW$376, DW_AT_name("PIEIER3"), DW_AT_symbol_name("_PIEIER3")
    3467                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3468                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3469              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3470                      .dwattr DW$377, DW_AT_name("PIEIFR3"), DW_AT_symbol_name("_PIEIFR3")
    3471                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3472                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3473              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3474                      .dwattr DW$378, DW_AT_name("PIEIER4"), DW_AT_symbol_name("_PIEIER4")
    3475                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   72

    3476                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3477              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3478                      .dwattr DW$379, DW_AT_name("PIEIFR4"), DW_AT_symbol_name("_PIEIFR4")
    3479                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3480                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3481              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3482                      .dwattr DW$380, DW_AT_name("PIEIER5"), DW_AT_symbol_name("_PIEIER5")
    3483                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3484                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3485              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3486                      .dwattr DW$381, DW_AT_name("PIEIFR5"), DW_AT_symbol_name("_PIEIFR5")
    3487                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3488                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3489              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3490                      .dwattr DW$382, DW_AT_name("PIEIER6"), DW_AT_symbol_name("_PIEIER6")
    3491                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3492                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3493              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3494                      .dwattr DW$383, DW_AT_name("PIEIFR6"), DW_AT_symbol_name("_PIEIFR6")
    3495                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3496                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3497              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3498                      .dwattr DW$384, DW_AT_name("PIEIER7"), DW_AT_symbol_name("_PIEIER7")
    3499                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3500                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3501              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3502                      .dwattr DW$385, DW_AT_name("PIEIFR7"), DW_AT_symbol_name("_PIEIFR7")
    3503                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3504                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3505              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3506                      .dwattr DW$386, DW_AT_name("PIEIER8"), DW_AT_symbol_name("_PIEIER8")
    3507                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3508                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3509              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3510                      .dwattr DW$387, DW_AT_name("PIEIFR8"), DW_AT_symbol_name("_PIEIFR8")
    3511                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3512                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3513              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3514                      .dwattr DW$388, DW_AT_name("PIEIER9"), DW_AT_symbol_name("_PIEIER9")
    3515                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3516                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3517              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3518                      .dwattr DW$389, DW_AT_name("PIEIFR9"), DW_AT_symbol_name("_PIEIFR9")
    3519                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3520                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3521              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3522                      .dwattr DW$390, DW_AT_name("PIEIER10"), DW_AT_symbol_name("_PIEIER10")
    3523                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3524                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3525              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3526                      .dwattr DW$391, DW_AT_name("PIEIFR10"), DW_AT_symbol_name("_PIEIFR10")
    3527                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3528                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3529              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3530                      .dwattr DW$392, DW_AT_name("PIEIER11"), DW_AT_symbol_name("_PIEIER11")
TMS320C2000 COFF Assembler PC v4.1.0 Mon Dec 21 14:54:55 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   73

    3531                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3532                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3533              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3534                      .dwattr DW$393, DW_AT_name("PIEIFR11"), DW_AT_symbol_name("_PIEIFR11")
    3535                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3536                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3537              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3538                      .dwattr DW$394, DW_AT_name("PIEIER12"), DW_AT_symbol_name("_PIEIER12")
    3539                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3540                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3541              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3542                      .dwattr DW$395, DW_AT_name("PIEIFR12"), DW_AT_symbol_name("_PIEIFR12")
    3543                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3544                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3545                      .dwendtag DW$T$120
    3546              
    3547              
    3548              DW$T$144        .dwtag  DW_TAG_structure_type
    3549                      .dwattr DW$T$144, DW_AT_name("SYS_CTRL_REGS")
    3550                      .dwattr DW$T$144, DW_AT_byte_size(0x20)
    3551              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    3552                      .dwattr DW$396, DW_AT_name("XCLK"), DW_AT_symbol_name("_XCLK")
    3553                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3554                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3555              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    3556                      .dwattr DW$397, DW_AT_name("PLLSTS"), DW_AT_symbol_name("_PLLSTS")
    3557                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3558                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3559              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    3560                      .dwattr DW$398, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
