TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Fri Dec 25 17:56:20 2009                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mainopenloop.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2225              DW$124  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2226              DW$125  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2227                      .dwendtag DW$T$147
    2228              
    2229              
    2230              DW$T$148        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2231                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    2232              DW$126  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2233              DW$127  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2234              DW$128  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2235                      .dwendtag DW$T$148
    2236              
    2237              
    2238              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2239                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    2240              DW$129  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2241              DW$130  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2242                      .dwendtag DW$T$149
    2243              
    2244              
    2245              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2246                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    2247              DW$131  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   49

    2248                      .dwendtag DW$T$151
    2249              
    2250              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("_iq"), DW_AT_type(*DW$T$12)
    2251                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    2252              
    2253              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2254                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    2255                      .dwattr DW$T$154, DW_AT_byte_size(0x0c)
    2256              DW$132  .dwtag  DW_TAG_subrange_type
    2257                      .dwattr DW$132, DW_AT_upper_bound(0x05)
    2258                      .dwendtag DW$T$154
    2259              
    2260              
    2261              DW$T$155        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2262                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    2263                      .dwattr DW$T$155, DW_AT_byte_size(0x06)
    2264              DW$133  .dwtag  DW_TAG_subrange_type
    2265                      .dwattr DW$133, DW_AT_upper_bound(0x02)
    2266                      .dwendtag DW$T$155
    2267              
    2268              
    2269              DW$T$156        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2270                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    2271                      .dwattr DW$T$156, DW_AT_byte_size(0x04)
    2272              DW$134  .dwtag  DW_TAG_subrange_type
    2273                      .dwattr DW$134, DW_AT_upper_bound(0x01)
    2274                      .dwendtag DW$T$156
    2275              
    2276              
    2277              DW$T$159        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$158)
    2278                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    2279                      .dwattr DW$T$159, DW_AT_byte_size(0x0c)
    2280              DW$135  .dwtag  DW_TAG_subrange_type
    2281                      .dwattr DW$135, DW_AT_upper_bound(0x05)
    2282                      .dwendtag DW$T$159
    2283              
    2284              DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("_iq30"), DW_AT_type(*DW$T$12)
    2285                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    2286              DW$T$162        .dwtag  DW_TAG_typedef, DW_AT_name("_iq15"), DW_AT_type(*DW$T$12)
    2287                      .dwattr DW$T$162, DW_AT_language(DW_LANG_C)
    2288              DW$136  .dwtag  DW_TAG_far_type
    2289                      .dwattr DW$136, DW_AT_type(*DW$T$45)
    2290              DW$T$173        .dwtag  DW_TAG_volatile_type
    2291                      .dwattr DW$T$173, DW_AT_type(*DW$136)
    2292              DW$137  .dwtag  DW_TAG_far_type
    2293                      .dwattr DW$137, DW_AT_type(*DW$T$91)
    2294              DW$T$202        .dwtag  DW_TAG_volatile_type
    2295                      .dwattr DW$T$202, DW_AT_type(*DW$137)
    2296              DW$138  .dwtag  DW_TAG_far_type
    2297                      .dwattr DW$138, DW_AT_type(*DW$T$109)
    2298              DW$T$209        .dwtag  DW_TAG_volatile_type
    2299                      .dwattr DW$T$209, DW_AT_type(*DW$138)
    2300              DW$139  .dwtag  DW_TAG_far_type
    2301                      .dwattr DW$139, DW_AT_type(*DW$T$111)
    2302              DW$T$210        .dwtag  DW_TAG_volatile_type
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   50

    2303                      .dwattr DW$T$210, DW_AT_type(*DW$139)
    2304              DW$140  .dwtag  DW_TAG_far_type
    2305                      .dwattr DW$140, DW_AT_type(*DW$T$120)
    2306              DW$T$214        .dwtag  DW_TAG_volatile_type
    2307                      .dwattr DW$T$214, DW_AT_type(*DW$140)
    2308              
    2309              DW$T$124        .dwtag  DW_TAG_structure_type
    2310                      .dwattr DW$T$124, DW_AT_name("PIE_VECT_TABLE")
    2311                      .dwattr DW$T$124, DW_AT_byte_size(0x100)
    2312              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2313                      .dwattr DW$141, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
    2314                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2316              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2317                      .dwattr DW$142, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
    2318                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2319                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2320              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2321                      .dwattr DW$143, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
    2322                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2323                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2324              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2325                      .dwattr DW$144, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
    2326                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2327                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2328              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2329                      .dwattr DW$145, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
    2330                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2331                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2332              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2333                      .dwattr DW$146, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
    2334                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2335                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2336              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2337                      .dwattr DW$147, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
    2338                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2339                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2340              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2341                      .dwattr DW$148, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
    2342                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2343                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2344              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2345                      .dwattr DW$149, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
    2346                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2347                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2348              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2349                      .dwattr DW$150, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
    2350                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2351                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2352              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2353                      .dwattr DW$151, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
    2354                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2355                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2356              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2357                      .dwattr DW$152, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   51

    2358                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2359                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2360              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2361                      .dwattr DW$153, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
    2362                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2363                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2364              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2365                      .dwattr DW$154, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
    2366                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2367                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2368              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2369                      .dwattr DW$155, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
    2370                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2371                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2372              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2373                      .dwattr DW$156, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
    2374                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2375                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2376              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2377                      .dwattr DW$157, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
    2378                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2379                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2380              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2381                      .dwattr DW$158, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
    2382                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2383                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2384              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2385                      .dwattr DW$159, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
    2386                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2387                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2388              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2389                      .dwattr DW$160, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
    2390                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2391                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2392              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2393                      .dwattr DW$161, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
    2394                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2395                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2396              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2397                      .dwattr DW$162, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
    2398                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2399                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2400              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2401                      .dwattr DW$163, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
    2402                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2403                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2404              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2405                      .dwattr DW$164, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
    2406                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2407                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2408              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2409                      .dwattr DW$165, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
    2410                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2411                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2412              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   52

    2413                      .dwattr DW$166, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
    2414                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2415                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2416              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2417                      .dwattr DW$167, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
    2418                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2419                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2420              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2421                      .dwattr DW$168, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
    2422                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2423                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2424              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2425                      .dwattr DW$169, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
    2426                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2427                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2428              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2429                      .dwattr DW$170, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
    2430                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2431                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2432              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2433                      .dwattr DW$171, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
    2434                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2435                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2436              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2437                      .dwattr DW$172, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
    2438                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2439                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2440              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2441                      .dwattr DW$173, DW_AT_name("SEQ1INT"), DW_AT_symbol_name("_SEQ1INT")
    2442                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2443                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2444              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2445                      .dwattr DW$174, DW_AT_name("SEQ2INT"), DW_AT_symbol_name("_SEQ2INT")
    2446                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2447                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2448              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2449                      .dwattr DW$175, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
    2450                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2451                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2452              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2453                      .dwattr DW$176, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
    2454                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2455                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2456              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2457                      .dwattr DW$177, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
    2458                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2459                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2460              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2461                      .dwattr DW$178, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
    2462                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2463                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2464              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2465                      .dwattr DW$179, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
    2466                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2467                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   53

    2468              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2469                      .dwattr DW$180, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
    2470                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2471                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2472              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2473                      .dwattr DW$181, DW_AT_name("EPWM1_TZINT"), DW_AT_symbol_name("_EPWM1_TZINT")
    2474                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2475                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2476              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2477                      .dwattr DW$182, DW_AT_name("EPWM2_TZINT"), DW_AT_symbol_name("_EPWM2_TZINT")
    2478                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2479                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2480              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2481                      .dwattr DW$183, DW_AT_name("EPWM3_TZINT"), DW_AT_symbol_name("_EPWM3_TZINT")
    2482                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2483                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2484              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2485                      .dwattr DW$184, DW_AT_name("EPWM4_TZINT"), DW_AT_symbol_name("_EPWM4_TZINT")
    2486                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2487                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2488              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2489                      .dwattr DW$185, DW_AT_name("EPWM5_TZINT"), DW_AT_symbol_name("_EPWM5_TZINT")
    2490                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2491                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2492              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2493                      .dwattr DW$186, DW_AT_name("EPWM6_TZINT"), DW_AT_symbol_name("_EPWM6_TZINT")
    2494                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2495                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2496              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2497                      .dwattr DW$187, DW_AT_name("rsvd2_7"), DW_AT_symbol_name("_rsvd2_7")
    2498                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2499                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2500              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2501                      .dwattr DW$188, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
    2502                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2503                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2504              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2505                      .dwattr DW$189, DW_AT_name("EPWM1_INT"), DW_AT_symbol_name("_EPWM1_INT")
    2506                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2507                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2508              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2509                      .dwattr DW$190, DW_AT_name("EPWM2_INT"), DW_AT_symbol_name("_EPWM2_INT")
    2510                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2511                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2512              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2513                      .dwattr DW$191, DW_AT_name("EPWM3_INT"), DW_AT_symbol_name("_EPWM3_INT")
    2514                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2515                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2516              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2517                      .dwattr DW$192, DW_AT_name("EPWM4_INT"), DW_AT_symbol_name("_EPWM4_INT")
    2518                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2519                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2520              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2521                      .dwattr DW$193, DW_AT_name("EPWM5_INT"), DW_AT_symbol_name("_EPWM5_INT")
    2522                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   54

    2523                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2524              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2525                      .dwattr DW$194, DW_AT_name("EPWM6_INT"), DW_AT_symbol_name("_EPWM6_INT")
    2526                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2527                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2528              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2529                      .dwattr DW$195, DW_AT_name("rsvd3_7"), DW_AT_symbol_name("_rsvd3_7")
    2530                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2531                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2532              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2533                      .dwattr DW$196, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
    2534                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2535                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2536              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2537                      .dwattr DW$197, DW_AT_name("ECAP1_INT"), DW_AT_symbol_name("_ECAP1_INT")
    2538                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2539                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2540              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2541                      .dwattr DW$198, DW_AT_name("ECAP2_INT"), DW_AT_symbol_name("_ECAP2_INT")
    2542                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2543                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2544              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2545                      .dwattr DW$199, DW_AT_name("ECAP3_INT"), DW_AT_symbol_name("_ECAP3_INT")
    2546                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2547                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2548              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2549                      .dwattr DW$200, DW_AT_name("ECAP4_INT"), DW_AT_symbol_name("_ECAP4_INT")
    2550                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2551                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2552              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2553                      .dwattr DW$201, DW_AT_name("rsvd4_5"), DW_AT_symbol_name("_rsvd4_5")
    2554                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2555                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2556              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2557                      .dwattr DW$202, DW_AT_name("rsvd4_6"), DW_AT_symbol_name("_rsvd4_6")
    2558                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2559                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2560              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2561                      .dwattr DW$203, DW_AT_name("rsvd4_7"), DW_AT_symbol_name("_rsvd4_7")
    2562                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2563                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2564              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2565                      .dwattr DW$204, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
    2566                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2567                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2568              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2569                      .dwattr DW$205, DW_AT_name("EQEP1_INT"), DW_AT_symbol_name("_EQEP1_INT")
    2570                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2571                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2572              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2573                      .dwattr DW$206, DW_AT_name("EQEP2_INT"), DW_AT_symbol_name("_EQEP2_INT")
    2574                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2575                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2576              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2577                      .dwattr DW$207, DW_AT_name("rsvd5_3"), DW_AT_symbol_name("_rsvd5_3")
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   55

    2578                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2579                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2580              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2581                      .dwattr DW$208, DW_AT_name("rsvd5_4"), DW_AT_symbol_name("_rsvd5_4")
    2582                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2583                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2584              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2585                      .dwattr DW$209, DW_AT_name("rsvd5_5"), DW_AT_symbol_name("_rsvd5_5")
    2586                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2587                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2588              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2589                      .dwattr DW$210, DW_AT_name("rsvd5_6"), DW_AT_symbol_name("_rsvd5_6")
    2590                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2591                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2592              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2593                      .dwattr DW$211, DW_AT_name("rsvd5_7"), DW_AT_symbol_name("_rsvd5_7")
    2594                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2595                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2596              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2597                      .dwattr DW$212, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
    2598                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2599                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2600              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2601                      .dwattr DW$213, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
    2602                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2603                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2604              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2605                      .dwattr DW$214, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
    2606                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2607                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2608              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2609                      .dwattr DW$215, DW_AT_name("SPIRXINTB"), DW_AT_symbol_name("_SPIRXINTB")
    2610                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2611                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2612              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2613                      .dwattr DW$216, DW_AT_name("SPITXINTB"), DW_AT_symbol_name("_SPITXINTB")
    2614                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2615                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2616              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2617                      .dwattr DW$217, DW_AT_name("SPIRXINTC"), DW_AT_symbol_name("_SPIRXINTC")
    2618                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2619                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2620              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2621                      .dwattr DW$218, DW_AT_name("SPITXINTC"), DW_AT_symbol_name("_SPITXINTC")
    2622                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2623                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2624              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2625                      .dwattr DW$219, DW_AT_name("SPIRXINTD"), DW_AT_symbol_name("_SPIRXINTD")
    2626                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2627                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2628              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2629                      .dwattr DW$220, DW_AT_name("SPITXINTD"), DW_AT_symbol_name("_SPITXINTD")
    2630                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2631                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2632              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   56

    2633                      .dwattr DW$221, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
    2634                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2635                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2636              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2637                      .dwattr DW$222, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
    2638                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2639                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2640              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2641                      .dwattr DW$223, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
    2642                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2643                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2644              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2645                      .dwattr DW$224, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
    2646                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2647                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2648              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2649                      .dwattr DW$225, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
    2650                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2651                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2652              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2653                      .dwattr DW$226, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
    2654                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2655                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2656              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2657                      .dwattr DW$227, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
    2658                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2659                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2660              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2661                      .dwattr DW$228, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
    2662                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2663                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2664              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2665                      .dwattr DW$229, DW_AT_name("I2CINT1A"), DW_AT_symbol_name("_I2CINT1A")
    2666                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2667                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2668              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2669                      .dwattr DW$230, DW_AT_name("I2CINT2A"), DW_AT_symbol_name("_I2CINT2A")
    2670                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2671                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2672              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2673                      .dwattr DW$231, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
    2674                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2675                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2676              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2677                      .dwattr DW$232, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
    2678                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2679                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2680              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2681                      .dwattr DW$233, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
    2682                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2683                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2684              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2685                      .dwattr DW$234, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
    2686                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2687                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   57

    2688              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2689                      .dwattr DW$235, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
    2690                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2691                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2692              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2693                      .dwattr DW$236, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
    2694                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2695                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2696              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2697                      .dwattr DW$237, DW_AT_name("SCIRXINTA"), DW_AT_symbol_name("_SCIRXINTA")
    2698                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2699                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2700              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2701                      .dwattr DW$238, DW_AT_name("SCITXINTA"), DW_AT_symbol_name("_SCITXINTA")
    2702                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2703                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2704              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2705                      .dwattr DW$239, DW_AT_name("SCIRXINTB"), DW_AT_symbol_name("_SCIRXINTB")
    2706                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2707                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2708              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2709                      .dwattr DW$240, DW_AT_name("SCITXINTB"), DW_AT_symbol_name("_SCITXINTB")
    2710                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2711                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2712              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2713                      .dwattr DW$241, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
    2714                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2715                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2716              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2717                      .dwattr DW$242, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
    2718                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2719                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2720              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2721                      .dwattr DW$243, DW_AT_name("ECAN0INTB"), DW_AT_symbol_name("_ECAN0INTB")
    2722                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2723                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2724              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2725                      .dwattr DW$244, DW_AT_name("ECAN1INTB"), DW_AT_symbol_name("_ECAN1INTB")
    2726                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2727                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2728              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2729                      .dwattr DW$245, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
    2730                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2731                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2732              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2733                      .dwattr DW$246, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
    2734                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2735                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2736              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2737                      .dwattr DW$247, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
    2738                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2739                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2740              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2741                      .dwattr DW$248, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
    2742                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   58

    2743                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2744              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2745                      .dwattr DW$249, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
    2746                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2747                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2748              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2749                      .dwattr DW$250, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
    2750                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2751                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2752              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2753                      .dwattr DW$251, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
    2754                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2755                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2756              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2757                      .dwattr DW$252, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
    2758                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2759                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2760              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2761                      .dwattr DW$253, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
    2762                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2763                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2764              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2765                      .dwattr DW$254, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
    2766                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2767                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2768              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2769                      .dwattr DW$255, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
    2770                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2771                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2772              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2773                      .dwattr DW$256, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
    2774                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2775                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2776              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2777                      .dwattr DW$257, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
    2778                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2779                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2780              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2781                      .dwattr DW$258, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
    2782                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2783                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2784              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2785                      .dwattr DW$259, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
    2786                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2787                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2788              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2789                      .dwattr DW$260, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
    2790                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2791                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2792              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2793                      .dwattr DW$261, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
    2794                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2795                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2796              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2797                      .dwattr DW$262, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   59

    2798                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2799                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2800              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2801                      .dwattr DW$263, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
    2802                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2803                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2804              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2805                      .dwattr DW$264, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
    2806                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2807                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2808              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2809                      .dwattr DW$265, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
    2810                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2811                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2812              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2813                      .dwattr DW$266, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
    2814                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2815                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2816              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2817                      .dwattr DW$267, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
    2818                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2819                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2820              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2821                      .dwattr DW$268, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
    2822                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2823                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2824                      .dwendtag DW$T$124
    2825              
    2826              DW$269  .dwtag  DW_TAG_far_type
    2827                      .dwattr DW$269, DW_AT_type(*DW$T$144)
    2828              DW$T$217        .dwtag  DW_TAG_volatile_type
    2829                      .dwattr DW$T$217, DW_AT_type(*DW$269)
    2830              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$122)
    2831                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    2832              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2833                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2834                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2835              DW$T$158        .dwtag  DW_TAG_typedef, DW_AT_name("_iq28"), DW_AT_type(*DW$T$12)
    2836                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    2837              
    2838              DW$T$45 .dwtag  DW_TAG_structure_type
    2839                      .dwattr DW$T$45, DW_AT_name("ADC_REGS")
    2840                      .dwattr DW$T$45, DW_AT_byte_size(0x1e)
    2841              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2842                      .dwattr DW$270, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
    2843                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2845              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2846                      .dwattr DW$271, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
    2847                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2848                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2849              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2850                      .dwattr DW$272, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
    2851                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2852                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   60

    2853              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2854                      .dwattr DW$273, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
    2855                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2856                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2857              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2858                      .dwattr DW$274, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
    2859                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2860                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2861              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2862                      .dwattr DW$275, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
    2863                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2864                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2865              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2866                      .dwattr DW$276, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
    2867                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2868                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2869              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2870                      .dwattr DW$277, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
    2871                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2872                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2873              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2874                      .dwattr DW$278, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
    2875                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2876                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2877              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2878                      .dwattr DW$279, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
    2879                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2880                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2881              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2882                      .dwattr DW$280, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
    2883                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2884                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2885              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2886                      .dwattr DW$281, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
    2887                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2888                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2889              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2890                      .dwattr DW$282, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
    2891                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2892                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2893              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2894                      .dwattr DW$283, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
    2895                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2896                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2897              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2898                      .dwattr DW$284, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
    2899                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2900                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2901              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2902                      .dwattr DW$285, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
    2903                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2904                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2905              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2906                      .dwattr DW$286, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
    2907                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   61

    2908                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2909              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2910                      .dwattr DW$287, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
    2911                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2912                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2913              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2914                      .dwattr DW$288, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
    2915                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2916                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2917              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2918                      .dwattr DW$289, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
    2919                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2920                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2921              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2922                      .dwattr DW$290, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
    2923                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2924                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2925              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2926                      .dwattr DW$291, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
    2927                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2928                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2929              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2930                      .dwattr DW$292, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
    2931                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2932                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2933              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2934                      .dwattr DW$293, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
    2935                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2936                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2937              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2938                      .dwattr DW$294, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
    2939                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2940                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2941              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    2942                      .dwattr DW$295, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
    2943                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2944                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2945              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2946                      .dwattr DW$296, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    2947                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2948                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2949              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2950                      .dwattr DW$297, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    2951                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2952                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2953              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2954                      .dwattr DW$298, DW_AT_name("ADCREFSEL"), DW_AT_symbol_name("_ADCREFSEL")
    2955                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2956                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2957              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    2958                      .dwattr DW$299, DW_AT_name("ADCOFFTRIM"), DW_AT_symbol_name("_ADCOFFTRIM")
    2959                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2960                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2961                      .dwendtag DW$T$45
    2962              
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   62

    2963              
    2964              DW$T$91 .dwtag  DW_TAG_structure_type
    2965                      .dwattr DW$T$91, DW_AT_name("EPWM_REGS")
    2966                      .dwattr DW$T$91, DW_AT_byte_size(0x22)
    2967              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2968                      .dwattr DW$300, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
    2969                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2970                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2971              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2972                      .dwattr DW$301, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
    2973                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2974                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2975              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    2976                      .dwattr DW$302, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
    2977                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2978                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2979              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2980                      .dwattr DW$303, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
    2981                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2982                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2983              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2984                      .dwattr DW$304, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
    2985                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2986                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2987              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2988                      .dwattr DW$305, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    2989                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2990                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2991              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    2992                      .dwattr DW$306, DW_AT_name("CMPCTL"), DW_AT_symbol_name("_CMPCTL")
    2993                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2994                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2995              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    2996                      .dwattr DW$307, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
    2997                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2998                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2999              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3000                      .dwattr DW$308, DW_AT_name("CMPB"), DW_AT_symbol_name("_CMPB")
    3001                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3002                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3003              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3004                      .dwattr DW$309, DW_AT_name("AQCTLA"), DW_AT_symbol_name("_AQCTLA")
    3005                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3006                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3007              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3008                      .dwattr DW$310, DW_AT_name("AQCTLB"), DW_AT_symbol_name("_AQCTLB")
    3009                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3010                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3011              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3012                      .dwattr DW$311, DW_AT_name("AQSFRC"), DW_AT_symbol_name("_AQSFRC")
    3013                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3014                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3015              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3016                      .dwattr DW$312, DW_AT_name("AQCSFRC"), DW_AT_symbol_name("_AQCSFRC")
    3017                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   63

    3018                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3019              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3020                      .dwattr DW$313, DW_AT_name("DBCTL"), DW_AT_symbol_name("_DBCTL")
    3021                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3022                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3023              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3024                      .dwattr DW$314, DW_AT_name("DBRED"), DW_AT_symbol_name("_DBRED")
    3025                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3026                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3027              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3028                      .dwattr DW$315, DW_AT_name("DBFED"), DW_AT_symbol_name("_DBFED")
    3029                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3030                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3031              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3032                      .dwattr DW$316, DW_AT_name("TZSEL"), DW_AT_symbol_name("_TZSEL")
    3033                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3034                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3035              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3036                      .dwattr DW$317, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3037                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3038                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3039              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3040                      .dwattr DW$318, DW_AT_name("TZCTL"), DW_AT_symbol_name("_TZCTL")
    3041                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3042                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3043              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3044                      .dwattr DW$319, DW_AT_name("TZEINT"), DW_AT_symbol_name("_TZEINT")
    3045                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3046                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3047              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3048                      .dwattr DW$320, DW_AT_name("TZFLG"), DW_AT_symbol_name("_TZFLG")
    3049                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3050                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3051              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3052                      .dwattr DW$321, DW_AT_name("TZCLR"), DW_AT_symbol_name("_TZCLR")
    3053                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3054                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3055              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3056                      .dwattr DW$322, DW_AT_name("TZFRC"), DW_AT_symbol_name("_TZFRC")
    3057                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3058                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3059              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    3060                      .dwattr DW$323, DW_AT_name("ETSEL"), DW_AT_symbol_name("_ETSEL")
    3061                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3062                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3063              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3064                      .dwattr DW$324, DW_AT_name("ETPS"), DW_AT_symbol_name("_ETPS")
    3065                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3066                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3067              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3068                      .dwattr DW$325, DW_AT_name("ETFLG"), DW_AT_symbol_name("_ETFLG")
    3069                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3070                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3071              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3072                      .dwattr DW$326, DW_AT_name("ETCLR"), DW_AT_symbol_name("_ETCLR")
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   64

    3073                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3074                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3075              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3076                      .dwattr DW$327, DW_AT_name("ETFRC"), DW_AT_symbol_name("_ETFRC")
    3077                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3078                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3079              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3080                      .dwattr DW$328, DW_AT_name("PCCTL"), DW_AT_symbol_name("_PCCTL")
    3081                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3082                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3083              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3084                      .dwattr DW$329, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3085                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3086                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3087              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3088                      .dwattr DW$330, DW_AT_name("HRCNFG"), DW_AT_symbol_name("_HRCNFG")
    3089                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3090                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3091                      .dwendtag DW$T$91
    3092              
    3093              
    3094              DW$T$109        .dwtag  DW_TAG_structure_type
    3095                      .dwattr DW$T$109, DW_AT_name("GPIO_CTRL_REGS")
    3096                      .dwattr DW$T$109, DW_AT_byte_size(0x40)
    3097              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3098                      .dwattr DW$331, DW_AT_name("GPACTRL"), DW_AT_symbol_name("_GPACTRL")
    3099                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3100                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3101              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3102                      .dwattr DW$332, DW_AT_name("GPAQSEL1"), DW_AT_symbol_name("_GPAQSEL1")
    3103                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3104                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3105              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3106                      .dwattr DW$333, DW_AT_name("GPAQSEL2"), DW_AT_symbol_name("_GPAQSEL2")
    3107                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3108                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3109              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3110                      .dwattr DW$334, DW_AT_name("GPAMUX1"), DW_AT_symbol_name("_GPAMUX1")
    3111                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3112                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3113              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3114                      .dwattr DW$335, DW_AT_name("GPAMUX2"), DW_AT_symbol_name("_GPAMUX2")
    3115                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3116                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3117              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3118                      .dwattr DW$336, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3119                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3120                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3121              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3122                      .dwattr DW$337, DW_AT_name("GPAPUD"), DW_AT_symbol_name("_GPAPUD")
    3123                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3124                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3125              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3126                      .dwattr DW$338, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3127                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   65

    3128                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3129              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3130                      .dwattr DW$339, DW_AT_name("GPBCTRL"), DW_AT_symbol_name("_GPBCTRL")
    3131                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3132                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3134                      .dwattr DW$340, DW_AT_name("GPBQSEL1"), DW_AT_symbol_name("_GPBQSEL1")
    3135                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3136                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3137              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3138                      .dwattr DW$341, DW_AT_name("GPBQSEL2"), DW_AT_symbol_name("_GPBQSEL2")
    3139                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3140                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3141              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3142                      .dwattr DW$342, DW_AT_name("GPBMUX1"), DW_AT_symbol_name("_GPBMUX1")
    3143                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3144                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3145              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3146                      .dwattr DW$343, DW_AT_name("GPBMUX2"), DW_AT_symbol_name("_GPBMUX2")
    3147                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3148                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3149              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3150                      .dwattr DW$344, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3151                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3152                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3153              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3154                      .dwattr DW$345, DW_AT_name("GPBPUD"), DW_AT_symbol_name("_GPBPUD")
    3155                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3156                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3157              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    3158                      .dwattr DW$346, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3159                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3160                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3161                      .dwendtag DW$T$109
    3162              
    3163              
    3164              DW$T$111        .dwtag  DW_TAG_structure_type
    3165                      .dwattr DW$T$111, DW_AT_name("GPIO_DATA_REGS")
    3166                      .dwattr DW$T$111, DW_AT_byte_size(0x20)
    3167              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3168                      .dwattr DW$347, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3169                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3170                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3171              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3172                      .dwattr DW$348, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3173                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3174                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3175              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3176                      .dwattr DW$349, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3177                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3178                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3179              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3180                      .dwattr DW$350, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3181                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3182                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   66

    3183              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3184                      .dwattr DW$351, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3185                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3186                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3187              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3188                      .dwattr DW$352, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3189                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3190                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3191              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3192                      .dwattr DW$353, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3193                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3194                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3195              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3196                      .dwattr DW$354, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3197                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3198                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3199              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    3200                      .dwattr DW$355, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3201                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3202                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3203                      .dwendtag DW$T$111
    3204              
    3205              
    3206              DW$T$120        .dwtag  DW_TAG_structure_type
    3207                      .dwattr DW$T$120, DW_AT_name("PIE_CTRL_REGS")
    3208                      .dwattr DW$T$120, DW_AT_byte_size(0x1a)
    3209              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3210                      .dwattr DW$356, DW_AT_name("PIECTRL"), DW_AT_symbol_name("_PIECTRL")
    3211                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3212                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3213              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3214                      .dwattr DW$357, DW_AT_name("PIEACK"), DW_AT_symbol_name("_PIEACK")
    3215                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3216                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3217              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3218                      .dwattr DW$358, DW_AT_name("PIEIER1"), DW_AT_symbol_name("_PIEIER1")
    3219                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3220                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3221              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3222                      .dwattr DW$359, DW_AT_name("PIEIFR1"), DW_AT_symbol_name("_PIEIFR1")
    3223                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3224                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3225              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3226                      .dwattr DW$360, DW_AT_name("PIEIER2"), DW_AT_symbol_name("_PIEIER2")
    3227                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3228                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3229              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3230                      .dwattr DW$361, DW_AT_name("PIEIFR2"), DW_AT_symbol_name("_PIEIFR2")
    3231                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3232                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3233              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3234                      .dwattr DW$362, DW_AT_name("PIEIER3"), DW_AT_symbol_name("_PIEIER3")
    3235                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3236                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3237              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   67

    3238                      .dwattr DW$363, DW_AT_name("PIEIFR3"), DW_AT_symbol_name("_PIEIFR3")
    3239                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3240                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3241              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3242                      .dwattr DW$364, DW_AT_name("PIEIER4"), DW_AT_symbol_name("_PIEIER4")
    3243                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3244                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3245              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3246                      .dwattr DW$365, DW_AT_name("PIEIFR4"), DW_AT_symbol_name("_PIEIFR4")
    3247                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3248                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3249              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3250                      .dwattr DW$366, DW_AT_name("PIEIER5"), DW_AT_symbol_name("_PIEIER5")
    3251                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3252                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3253              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3254                      .dwattr DW$367, DW_AT_name("PIEIFR5"), DW_AT_symbol_name("_PIEIFR5")
    3255                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3256                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3257              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3258                      .dwattr DW$368, DW_AT_name("PIEIER6"), DW_AT_symbol_name("_PIEIER6")
    3259                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3260                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3261              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3262                      .dwattr DW$369, DW_AT_name("PIEIFR6"), DW_AT_symbol_name("_PIEIFR6")
    3263                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3264                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3265              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3266                      .dwattr DW$370, DW_AT_name("PIEIER7"), DW_AT_symbol_name("_PIEIER7")
    3267                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3268                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3269              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3270                      .dwattr DW$371, DW_AT_name("PIEIFR7"), DW_AT_symbol_name("_PIEIFR7")
    3271                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3272                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3273              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3274                      .dwattr DW$372, DW_AT_name("PIEIER8"), DW_AT_symbol_name("_PIEIER8")
    3275                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3276                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3277              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3278                      .dwattr DW$373, DW_AT_name("PIEIFR8"), DW_AT_symbol_name("_PIEIFR8")
    3279                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3280                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3281              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3282                      .dwattr DW$374, DW_AT_name("PIEIER9"), DW_AT_symbol_name("_PIEIER9")
    3283                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3284                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3285              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3286                      .dwattr DW$375, DW_AT_name("PIEIFR9"), DW_AT_symbol_name("_PIEIFR9")
    3287                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3288                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3289              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3290                      .dwattr DW$376, DW_AT_name("PIEIER10"), DW_AT_symbol_name("_PIEIER10")
    3291                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3292                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Fri Dec 25 17:56:22 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4642                            PAGE   68

    3293              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3294                      .dwattr DW$377, DW_AT_name("PIEIFR10"), DW_AT_symbol_name("_PIEIFR10")
    3295                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3296                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3297              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3298                      .dwattr DW$378, DW_AT_name("PIEIER11"), DW_AT_symbol_name("_PIEIER11")
    3299                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3300                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3301              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3302                      .dwattr DW$379, DW_AT_name("PIEIFR11"), DW_AT_symbol_name("_PIEIFR11")
    3303                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3304                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3305              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3306                      .dwattr DW$380, DW_AT_name("PIEIER12"), DW_AT_symbol_name("_PIEIER12")
    3307                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3308                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3309              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3310                      .dwattr DW$381, DW_AT_name("PIEIFR12"), DW_AT_symbol_name("_PIEIFR12")
    3311                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3312                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3313                      .dwendtag DW$T$120
    3314              
    3315              
    3316              DW$T$144        .dwtag  DW_TAG_structure_type
    3317                      .dwattr DW$T$144, DW_AT_name("SYS_CTRL_REGS")
    3318                      .dwattr DW$T$144, DW_AT_byte_size(0x20)
    3319              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    3320                      .dwattr DW$382, DW_AT_name("XCLK"), DW_AT_symbol_name("_XCLK")
    3321                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3322                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3323              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    3324                      .dwattr DW$383, DW_AT_name("PLLSTS"), DW_AT_symbol_name("_PLLSTS")
    3325                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3326                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3327              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    3328                      .dwattr DW$384, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
