TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
       3              ;* Date/Time created: Sat Mar 29 19:32:59 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Documents and Settings\Jordan\My Documents\Dropbox\masc\research
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    9169                      .dwattr $C$DW$T$411, DW_AT_language(DW_LANG_C)
    9170                      .dwattr $C$DW$T$411, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    9171                      .dwattr $C$DW$T$411, DW_AT_decl_line(0x2ab0)
    9172                      .dwattr $C$DW$T$411, DW_AT_decl_column(0x13)
    9173              $C$DW$T$412     .dwtag  DW_TAG_typedef, DW_AT_name("_iq3")
    9174                      .dwattr $C$DW$T$412, DW_AT_type(*$C$DW$T$12)
    9175                      .dwattr $C$DW$T$412, DW_AT_language(DW_LANG_C)
    9176                      .dwattr $C$DW$T$412, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    9177                      .dwattr $C$DW$T$412, DW_AT_decl_line(0x2ab1)
    9178                      .dwattr $C$DW$T$412, DW_AT_decl_column(0x13)
    9179              $C$DW$T$413     .dwtag  DW_TAG_typedef, DW_AT_name("_iq2")
    9180                      .dwattr $C$DW$T$413, DW_AT_type(*$C$DW$T$12)
    9181                      .dwattr $C$DW$T$413, DW_AT_language(DW_LANG_C)
    9182                      .dwattr $C$DW$T$413, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    9183                      .dwattr $C$DW$T$413, DW_AT_decl_line(0x2ab2)
    9184                      .dwattr $C$DW$T$413, DW_AT_decl_column(0x13)
    9185              $C$DW$T$414     .dwtag  DW_TAG_typedef, DW_AT_name("_iq1")
    9186                      .dwattr $C$DW$T$414, DW_AT_type(*$C$DW$T$12)
    9187                      .dwattr $C$DW$T$414, DW_AT_language(DW_LANG_C)
    9188                      .dwattr $C$DW$T$414, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    9189                      .dwattr $C$DW$T$414, DW_AT_decl_line(0x2ab3)
    9190                      .dwattr $C$DW$T$414, DW_AT_decl_column(0x13)
    9191              $C$DW$T$13      .dwtag  DW_TAG_base_type
    9192                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    9193                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    9194                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    9195              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
    9196                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$13)
    9197                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    9198                      .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9199                      .dwattr $C$DW$T$51, DW_AT_decl_line(0x16)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  194

    9200                      .dwattr $C$DW$T$51, DW_AT_decl_column(0x19)
    9201              $C$DW$T$14      .dwtag  DW_TAG_base_type
    9202                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    9203                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    9204                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    9205              $C$DW$T$15      .dwtag  DW_TAG_base_type
    9206                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    9207                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    9208                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    9209              $C$DW$T$16      .dwtag  DW_TAG_base_type
    9210                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    9211                      .dwattr $C$DW$T$16, DW_AT_name("float")
    9212                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    9213              $C$DW$T$416     .dwtag  DW_TAG_typedef, DW_AT_name("float32")
    9214                      .dwattr $C$DW$T$416, DW_AT_type(*$C$DW$T$16)
    9215                      .dwattr $C$DW$T$416, DW_AT_language(DW_LANG_C)
    9216                      .dwattr $C$DW$T$416, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    9217                      .dwattr $C$DW$T$416, DW_AT_decl_line(0x17)
    9218                      .dwattr $C$DW$T$416, DW_AT_decl_column(0x19)
    9219              $C$DW$T$17      .dwtag  DW_TAG_base_type
    9220                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    9221                      .dwattr $C$DW$T$17, DW_AT_name("double")
    9222                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    9223              $C$DW$T$18      .dwtag  DW_TAG_base_type
    9224                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    9225                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    9226                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    9227              $C$DW$T$417     .dwtag  DW_TAG_typedef, DW_AT_name("float64")
    9228                      .dwattr $C$DW$T$417, DW_AT_type(*$C$DW$T$18)
    9229                      .dwattr $C$DW$T$417, DW_AT_language(DW_LANG_C)
    9230                      .dwattr $C$DW$T$417, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/rese
    9231                      .dwattr $C$DW$T$417, DW_AT_decl_line(0x18)
    9232                      .dwattr $C$DW$T$417, DW_AT_decl_column(0x19)
    9233              
    9234              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9235                      .dwattr $C$DW$T$20, DW_AT_name("ADCTRL1_BITS")
    9236                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    9237              $C$DW$529       .dwtag  DW_TAG_member
    9238                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    9239                      .dwattr $C$DW$529, DW_AT_name("rsvd1")
    9240                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_rsvd1")
    9241                      .dwattr $C$DW$529, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9242                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9243                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    9244                      .dwattr $C$DW$529, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9245                      .dwattr $C$DW$529, DW_AT_decl_line(0x19e)
    9246                      .dwattr $C$DW$529, DW_AT_decl_column(0x0d)
    9247              $C$DW$530       .dwtag  DW_TAG_member
    9248                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    9249                      .dwattr $C$DW$530, DW_AT_name("SEQ_CASC")
    9250                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_SEQ_CASC")
    9251                      .dwattr $C$DW$530, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    9252                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9253                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    9254                      .dwattr $C$DW$530, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  195

    9255                      .dwattr $C$DW$530, DW_AT_decl_line(0x19f)
    9256                      .dwattr $C$DW$530, DW_AT_decl_column(0x0d)
    9257              $C$DW$531       .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
    9259                      .dwattr $C$DW$531, DW_AT_name("SEQ_OVRD")
    9260                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_SEQ_OVRD")
    9261                      .dwattr $C$DW$531, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    9262                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9263                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    9264                      .dwattr $C$DW$531, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9265                      .dwattr $C$DW$531, DW_AT_decl_line(0x1a0)
    9266                      .dwattr $C$DW$531, DW_AT_decl_column(0x0d)
    9267              $C$DW$532       .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
    9269                      .dwattr $C$DW$532, DW_AT_name("CONT_RUN")
    9270                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_CONT_RUN")
    9271                      .dwattr $C$DW$532, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    9272                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9273                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    9274                      .dwattr $C$DW$532, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9275                      .dwattr $C$DW$532, DW_AT_decl_line(0x1a1)
    9276                      .dwattr $C$DW$532, DW_AT_decl_column(0x0d)
    9277              $C$DW$533       .dwtag  DW_TAG_member
    9278                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
    9279                      .dwattr $C$DW$533, DW_AT_name("CPS")
    9280                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_CPS")
    9281                      .dwattr $C$DW$533, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9282                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9283                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    9284                      .dwattr $C$DW$533, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9285                      .dwattr $C$DW$533, DW_AT_decl_line(0x1a2)
    9286                      .dwattr $C$DW$533, DW_AT_decl_column(0x0d)
    9287              $C$DW$534       .dwtag  DW_TAG_member
    9288                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
    9289                      .dwattr $C$DW$534, DW_AT_name("ACQ_PS")
    9290                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ACQ_PS")
    9291                      .dwattr $C$DW$534, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    9292                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9293                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    9294                      .dwattr $C$DW$534, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9295                      .dwattr $C$DW$534, DW_AT_decl_line(0x1a3)
    9296                      .dwattr $C$DW$534, DW_AT_decl_column(0x0d)
    9297              $C$DW$535       .dwtag  DW_TAG_member
    9298                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
    9299                      .dwattr $C$DW$535, DW_AT_name("SUSMOD")
    9300                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_SUSMOD")
    9301                      .dwattr $C$DW$535, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    9302                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9303                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    9304                      .dwattr $C$DW$535, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9305                      .dwattr $C$DW$535, DW_AT_decl_line(0x1a4)
    9306                      .dwattr $C$DW$535, DW_AT_decl_column(0x0d)
    9307              $C$DW$536       .dwtag  DW_TAG_member
    9308                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
    9309                      .dwattr $C$DW$536, DW_AT_name("RESET")
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  196

    9310                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_RESET")
    9311                      .dwattr $C$DW$536, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    9312                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9313                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    9314                      .dwattr $C$DW$536, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9315                      .dwattr $C$DW$536, DW_AT_decl_line(0x1a5)
    9316                      .dwattr $C$DW$536, DW_AT_decl_column(0x0d)
    9317              $C$DW$537       .dwtag  DW_TAG_member
    9318                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$19)
    9319                      .dwattr $C$DW$537, DW_AT_name("rsvd2")
    9320                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd2")
    9321                      .dwattr $C$DW$537, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    9322                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9323                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    9324                      .dwattr $C$DW$537, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9325                      .dwattr $C$DW$537, DW_AT_decl_line(0x1a6)
    9326                      .dwattr $C$DW$537, DW_AT_decl_column(0x0d)
    9327                      .dwendtag $C$DW$T$20
    9328              
    9329                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9330                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x19d)
    9331                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x08)
    9332              
    9333              $C$DW$T$21      .dwtag  DW_TAG_union_type
    9334                      .dwattr $C$DW$T$21, DW_AT_name("ADCTRL1_REG")
    9335                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    9336              $C$DW$538       .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
    9338                      .dwattr $C$DW$538, DW_AT_name("all")
    9339                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_all")
    9340                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9341                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    9342                      .dwattr $C$DW$538, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9343                      .dwattr $C$DW$538, DW_AT_decl_line(0x1ab)
    9344                      .dwattr $C$DW$538, DW_AT_decl_column(0x1a)
    9345              $C$DW$539       .dwtag  DW_TAG_member
    9346                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$20)
    9347                      .dwattr $C$DW$539, DW_AT_name("bit")
    9348                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_bit")
    9349                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9350                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    9351                      .dwattr $C$DW$539, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9352                      .dwattr $C$DW$539, DW_AT_decl_line(0x1ac)
    9353                      .dwattr $C$DW$539, DW_AT_decl_column(0x1a)
    9354                      .dwendtag $C$DW$T$21
    9355              
    9356                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9357                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x1aa)
    9358                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x07)
    9359              
    9360              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    9361                      .dwattr $C$DW$T$22, DW_AT_name("ADCTRL2_BITS")
    9362                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    9363              $C$DW$540       .dwtag  DW_TAG_member
    9364                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  197

    9365                      .dwattr $C$DW$540, DW_AT_name("EPWM_SOCB_SEQ2")
    9366                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ2")
    9367                      .dwattr $C$DW$540, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    9368                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9369                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    9370                      .dwattr $C$DW$540, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9371                      .dwattr $C$DW$540, DW_AT_decl_line(0x1b1)
    9372                      .dwattr $C$DW$540, DW_AT_decl_column(0x0d)
    9373              $C$DW$541       .dwtag  DW_TAG_member
    9374                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$19)
    9375                      .dwattr $C$DW$541, DW_AT_name("rsvd1")
    9376                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd1")
    9377                      .dwattr $C$DW$541, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    9378                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9379                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    9380                      .dwattr $C$DW$541, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9381                      .dwattr $C$DW$541, DW_AT_decl_line(0x1b2)
    9382                      .dwattr $C$DW$541, DW_AT_decl_column(0x0d)
    9383              $C$DW$542       .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$19)
    9385                      .dwattr $C$DW$542, DW_AT_name("INT_MOD_SEQ2")
    9386                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
    9387                      .dwattr $C$DW$542, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    9388                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9389                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    9390                      .dwattr $C$DW$542, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9391                      .dwattr $C$DW$542, DW_AT_decl_line(0x1b3)
    9392                      .dwattr $C$DW$542, DW_AT_decl_column(0x0d)
    9393              $C$DW$543       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$19)
    9395                      .dwattr $C$DW$543, DW_AT_name("INT_ENA_SEQ2")
    9396                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
    9397                      .dwattr $C$DW$543, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    9398                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9399                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    9400                      .dwattr $C$DW$543, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9401                      .dwattr $C$DW$543, DW_AT_decl_line(0x1b4)
    9402                      .dwattr $C$DW$543, DW_AT_decl_column(0x0d)
    9403              $C$DW$544       .dwtag  DW_TAG_member
    9404                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$19)
    9405                      .dwattr $C$DW$544, DW_AT_name("rsvd2")
    9406                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_rsvd2")
    9407                      .dwattr $C$DW$544, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    9408                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9409                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    9410                      .dwattr $C$DW$544, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9411                      .dwattr $C$DW$544, DW_AT_decl_line(0x1b5)
    9412                      .dwattr $C$DW$544, DW_AT_decl_column(0x0d)
    9413              $C$DW$545       .dwtag  DW_TAG_member
    9414                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$19)
    9415                      .dwattr $C$DW$545, DW_AT_name("SOC_SEQ2")
    9416                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_SOC_SEQ2")
    9417                      .dwattr $C$DW$545, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    9418                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9419                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  198

    9420                      .dwattr $C$DW$545, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9421                      .dwattr $C$DW$545, DW_AT_decl_line(0x1b6)
    9422                      .dwattr $C$DW$545, DW_AT_decl_column(0x0d)
    9423              $C$DW$546       .dwtag  DW_TAG_member
    9424                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$19)
    9425                      .dwattr $C$DW$546, DW_AT_name("RST_SEQ2")
    9426                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_RST_SEQ2")
    9427                      .dwattr $C$DW$546, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    9428                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9429                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    9430                      .dwattr $C$DW$546, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9431                      .dwattr $C$DW$546, DW_AT_decl_line(0x1b7)
    9432                      .dwattr $C$DW$546, DW_AT_decl_column(0x0d)
    9433              $C$DW$547       .dwtag  DW_TAG_member
    9434                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$19)
    9435                      .dwattr $C$DW$547, DW_AT_name("EXT_SOC_SEQ1")
    9436                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
    9437                      .dwattr $C$DW$547, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9438                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9439                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    9440                      .dwattr $C$DW$547, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9441                      .dwattr $C$DW$547, DW_AT_decl_line(0x1b8)
    9442                      .dwattr $C$DW$547, DW_AT_decl_column(0x0d)
    9443              $C$DW$548       .dwtag  DW_TAG_member
    9444                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$19)
    9445                      .dwattr $C$DW$548, DW_AT_name("EPWM_SOCA_SEQ1")
    9446                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_EPWM_SOCA_SEQ1")
    9447                      .dwattr $C$DW$548, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    9448                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9449                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    9450                      .dwattr $C$DW$548, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9451                      .dwattr $C$DW$548, DW_AT_decl_line(0x1b9)
    9452                      .dwattr $C$DW$548, DW_AT_decl_column(0x0d)
    9453              $C$DW$549       .dwtag  DW_TAG_member
    9454                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
    9455                      .dwattr $C$DW$549, DW_AT_name("rsvd3")
    9456                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd3")
    9457                      .dwattr $C$DW$549, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    9458                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9459                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    9460                      .dwattr $C$DW$549, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9461                      .dwattr $C$DW$549, DW_AT_decl_line(0x1ba)
    9462                      .dwattr $C$DW$549, DW_AT_decl_column(0x0d)
    9463              $C$DW$550       .dwtag  DW_TAG_member
    9464                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$19)
    9465                      .dwattr $C$DW$550, DW_AT_name("INT_MOD_SEQ1")
    9466                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    9467                      .dwattr $C$DW$550, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    9468                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9469                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    9470                      .dwattr $C$DW$550, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9471                      .dwattr $C$DW$550, DW_AT_decl_line(0x1bb)
    9472                      .dwattr $C$DW$550, DW_AT_decl_column(0x0d)
    9473              $C$DW$551       .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  199

    9475                      .dwattr $C$DW$551, DW_AT_name("INT_ENA_SEQ1")
    9476                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    9477                      .dwattr $C$DW$551, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    9478                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9479                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    9480                      .dwattr $C$DW$551, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9481                      .dwattr $C$DW$551, DW_AT_decl_line(0x1bc)
    9482                      .dwattr $C$DW$551, DW_AT_decl_column(0x0d)
    9483              $C$DW$552       .dwtag  DW_TAG_member
    9484                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
    9485                      .dwattr $C$DW$552, DW_AT_name("rsvd4")
    9486                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_rsvd4")
    9487                      .dwattr $C$DW$552, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    9488                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9489                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    9490                      .dwattr $C$DW$552, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9491                      .dwattr $C$DW$552, DW_AT_decl_line(0x1bd)
    9492                      .dwattr $C$DW$552, DW_AT_decl_column(0x0d)
    9493              $C$DW$553       .dwtag  DW_TAG_member
    9494                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$19)
    9495                      .dwattr $C$DW$553, DW_AT_name("SOC_SEQ1")
    9496                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_SOC_SEQ1")
    9497                      .dwattr $C$DW$553, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    9498                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9499                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    9500                      .dwattr $C$DW$553, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9501                      .dwattr $C$DW$553, DW_AT_decl_line(0x1be)
    9502                      .dwattr $C$DW$553, DW_AT_decl_column(0x0d)
    9503              $C$DW$554       .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$19)
    9505                      .dwattr $C$DW$554, DW_AT_name("RST_SEQ1")
    9506                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_RST_SEQ1")
    9507                      .dwattr $C$DW$554, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    9508                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9509                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    9510                      .dwattr $C$DW$554, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9511                      .dwattr $C$DW$554, DW_AT_decl_line(0x1bf)
    9512                      .dwattr $C$DW$554, DW_AT_decl_column(0x0d)
    9513              $C$DW$555       .dwtag  DW_TAG_member
    9514                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$19)
    9515                      .dwattr $C$DW$555, DW_AT_name("EPWM_SOCB_SEQ")
    9516                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ")
    9517                      .dwattr $C$DW$555, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    9518                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9519                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    9520                      .dwattr $C$DW$555, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9521                      .dwattr $C$DW$555, DW_AT_decl_line(0x1c0)
    9522                      .dwattr $C$DW$555, DW_AT_decl_column(0x0d)
    9523                      .dwendtag $C$DW$T$22
    9524              
    9525                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9526                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x1b0)
    9527                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
    9528              
    9529              $C$DW$T$23      .dwtag  DW_TAG_union_type
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  200

    9530                      .dwattr $C$DW$T$23, DW_AT_name("ADCTRL2_REG")
    9531                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    9532              $C$DW$556       .dwtag  DW_TAG_member
    9533                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$19)
    9534                      .dwattr $C$DW$556, DW_AT_name("all")
    9535                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_all")
    9536                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9537                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    9538                      .dwattr $C$DW$556, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9539                      .dwattr $C$DW$556, DW_AT_decl_line(0x1c5)
    9540                      .dwattr $C$DW$556, DW_AT_decl_column(0x1a)
    9541              $C$DW$557       .dwtag  DW_TAG_member
    9542                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
    9543                      .dwattr $C$DW$557, DW_AT_name("bit")
    9544                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_bit")
    9545                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9546                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    9547                      .dwattr $C$DW$557, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9548                      .dwattr $C$DW$557, DW_AT_decl_line(0x1c6)
    9549                      .dwattr $C$DW$557, DW_AT_decl_column(0x1a)
    9550                      .dwendtag $C$DW$T$23
    9551              
    9552                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9553                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x1c4)
    9554                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x07)
    9555              
    9556              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    9557                      .dwattr $C$DW$T$24, DW_AT_name("ADCMAXCONV_BITS")
    9558                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    9559              $C$DW$558       .dwtag  DW_TAG_member
    9560                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$19)
    9561                      .dwattr $C$DW$558, DW_AT_name("MAX_CONV1")
    9562                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_MAX_CONV1")
    9563                      .dwattr $C$DW$558, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9564                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9565                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    9566                      .dwattr $C$DW$558, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9567                      .dwattr $C$DW$558, DW_AT_decl_line(0x1d9)
    9568                      .dwattr $C$DW$558, DW_AT_decl_column(0x0d)
    9569              $C$DW$559       .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$19)
    9571                      .dwattr $C$DW$559, DW_AT_name("MAX_CONV2")
    9572                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_MAX_CONV2")
    9573                      .dwattr $C$DW$559, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    9574                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9575                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    9576                      .dwattr $C$DW$559, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9577                      .dwattr $C$DW$559, DW_AT_decl_line(0x1da)
    9578                      .dwattr $C$DW$559, DW_AT_decl_column(0x0d)
    9579              $C$DW$560       .dwtag  DW_TAG_member
    9580                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$19)
    9581                      .dwattr $C$DW$560, DW_AT_name("rsvd1")
    9582                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd1")
    9583                      .dwattr $C$DW$560, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    9584                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  201

    9585                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    9586                      .dwattr $C$DW$560, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9587                      .dwattr $C$DW$560, DW_AT_decl_line(0x1db)
    9588                      .dwattr $C$DW$560, DW_AT_decl_column(0x0d)
    9589                      .dwendtag $C$DW$T$24
    9590              
    9591                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9592                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x1d8)
    9593                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x08)
    9594              
    9595              $C$DW$T$25      .dwtag  DW_TAG_union_type
    9596                      .dwattr $C$DW$T$25, DW_AT_name("ADCMAXCONV_REG")
    9597                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    9598              $C$DW$561       .dwtag  DW_TAG_member
    9599                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$19)
    9600                      .dwattr $C$DW$561, DW_AT_name("all")
    9601                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_all")
    9602                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9603                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    9604                      .dwattr $C$DW$561, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9605                      .dwattr $C$DW$561, DW_AT_decl_line(0x1df)
    9606                      .dwattr $C$DW$561, DW_AT_decl_column(0x1c)
    9607              $C$DW$562       .dwtag  DW_TAG_member
    9608                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$24)
    9609                      .dwattr $C$DW$562, DW_AT_name("bit")
    9610                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_bit")
    9611                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9612                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    9613                      .dwattr $C$DW$562, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9614                      .dwattr $C$DW$562, DW_AT_decl_line(0x1e0)
    9615                      .dwattr $C$DW$562, DW_AT_decl_column(0x1c)
    9616                      .dwendtag $C$DW$T$25
    9617              
    9618                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9619                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x1de)
    9620                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x07)
    9621              
    9622              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    9623                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ1_BITS")
    9624                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9625              $C$DW$563       .dwtag  DW_TAG_member
    9626                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$19)
    9627                      .dwattr $C$DW$563, DW_AT_name("CONV00")
    9628                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_CONV00")
    9629                      .dwattr $C$DW$563, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9630                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9631                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    9632                      .dwattr $C$DW$563, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9633                      .dwattr $C$DW$563, DW_AT_decl_line(0x1e5)
    9634                      .dwattr $C$DW$563, DW_AT_decl_column(0x0d)
    9635              $C$DW$564       .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$19)
    9637                      .dwattr $C$DW$564, DW_AT_name("CONV01")
    9638                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_CONV01")
    9639                      .dwattr $C$DW$564, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  202

    9640                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9641                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    9642                      .dwattr $C$DW$564, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9643                      .dwattr $C$DW$564, DW_AT_decl_line(0x1e6)
    9644                      .dwattr $C$DW$564, DW_AT_decl_column(0x0d)
    9645              $C$DW$565       .dwtag  DW_TAG_member
    9646                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$19)
    9647                      .dwattr $C$DW$565, DW_AT_name("CONV02")
    9648                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_CONV02")
    9649                      .dwattr $C$DW$565, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    9650                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9651                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    9652                      .dwattr $C$DW$565, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9653                      .dwattr $C$DW$565, DW_AT_decl_line(0x1e7)
    9654                      .dwattr $C$DW$565, DW_AT_decl_column(0x0d)
    9655              $C$DW$566       .dwtag  DW_TAG_member
    9656                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$19)
    9657                      .dwattr $C$DW$566, DW_AT_name("CONV03")
    9658                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_CONV03")
    9659                      .dwattr $C$DW$566, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    9660                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9661                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    9662                      .dwattr $C$DW$566, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9663                      .dwattr $C$DW$566, DW_AT_decl_line(0x1e8)
    9664                      .dwattr $C$DW$566, DW_AT_decl_column(0x0d)
    9665                      .dwendtag $C$DW$T$26
    9666              
    9667                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9668                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x1e4)
    9669                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    9670              
    9671              $C$DW$T$27      .dwtag  DW_TAG_union_type
    9672                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ1_REG")
    9673                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    9674              $C$DW$567       .dwtag  DW_TAG_member
    9675                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$19)
    9676                      .dwattr $C$DW$567, DW_AT_name("all")
    9677                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_all")
    9678                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9679                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    9680                      .dwattr $C$DW$567, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9681                      .dwattr $C$DW$567, DW_AT_decl_line(0x1ec)
    9682                      .dwattr $C$DW$567, DW_AT_decl_column(0x1e)
    9683              $C$DW$568       .dwtag  DW_TAG_member
    9684                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$26)
    9685                      .dwattr $C$DW$568, DW_AT_name("bit")
    9686                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_bit")
    9687                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9688                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    9689                      .dwattr $C$DW$568, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9690                      .dwattr $C$DW$568, DW_AT_decl_line(0x1ed)
    9691                      .dwattr $C$DW$568, DW_AT_decl_column(0x1e)
    9692                      .dwendtag $C$DW$T$27
    9693              
    9694                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  203

    9695                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x1eb)
    9696                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    9697              
    9698              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    9699                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ2_BITS")
    9700                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    9701              $C$DW$569       .dwtag  DW_TAG_member
    9702                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
    9703                      .dwattr $C$DW$569, DW_AT_name("CONV04")
    9704                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_CONV04")
    9705                      .dwattr $C$DW$569, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9706                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9707                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    9708                      .dwattr $C$DW$569, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9709                      .dwattr $C$DW$569, DW_AT_decl_line(0x1f1)
    9710                      .dwattr $C$DW$569, DW_AT_decl_column(0x0d)
    9711              $C$DW$570       .dwtag  DW_TAG_member
    9712                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$19)
    9713                      .dwattr $C$DW$570, DW_AT_name("CONV05")
    9714                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_CONV05")
    9715                      .dwattr $C$DW$570, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    9716                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9717                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    9718                      .dwattr $C$DW$570, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9719                      .dwattr $C$DW$570, DW_AT_decl_line(0x1f2)
    9720                      .dwattr $C$DW$570, DW_AT_decl_column(0x0d)
    9721              $C$DW$571       .dwtag  DW_TAG_member
    9722                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$19)
    9723                      .dwattr $C$DW$571, DW_AT_name("CONV06")
    9724                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_CONV06")
    9725                      .dwattr $C$DW$571, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    9726                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9727                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    9728                      .dwattr $C$DW$571, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9729                      .dwattr $C$DW$571, DW_AT_decl_line(0x1f3)
    9730                      .dwattr $C$DW$571, DW_AT_decl_column(0x0d)
    9731              $C$DW$572       .dwtag  DW_TAG_member
    9732                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$19)
    9733                      .dwattr $C$DW$572, DW_AT_name("CONV07")
    9734                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_CONV07")
    9735                      .dwattr $C$DW$572, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    9736                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9737                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    9738                      .dwattr $C$DW$572, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9739                      .dwattr $C$DW$572, DW_AT_decl_line(0x1f4)
    9740                      .dwattr $C$DW$572, DW_AT_decl_column(0x0d)
    9741                      .dwendtag $C$DW$T$28
    9742              
    9743                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9744                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x1f0)
    9745                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x08)
    9746              
    9747              $C$DW$T$29      .dwtag  DW_TAG_union_type
    9748                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ2_REG")
    9749                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  204

    9750              $C$DW$573       .dwtag  DW_TAG_member
    9751                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
    9752                      .dwattr $C$DW$573, DW_AT_name("all")
    9753                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_all")
    9754                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9755                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    9756                      .dwattr $C$DW$573, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9757                      .dwattr $C$DW$573, DW_AT_decl_line(0x1f8)
    9758                      .dwattr $C$DW$573, DW_AT_decl_column(0x1e)
    9759              $C$DW$574       .dwtag  DW_TAG_member
    9760                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$28)
    9761                      .dwattr $C$DW$574, DW_AT_name("bit")
    9762                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_bit")
    9763                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9764                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    9765                      .dwattr $C$DW$574, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9766                      .dwattr $C$DW$574, DW_AT_decl_line(0x1f9)
    9767                      .dwattr $C$DW$574, DW_AT_decl_column(0x1e)
    9768                      .dwendtag $C$DW$T$29
    9769              
    9770                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9771                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x1f7)
    9772                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
    9773              
    9774              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9775                      .dwattr $C$DW$T$30, DW_AT_name("ADCCHSELSEQ3_BITS")
    9776                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    9777              $C$DW$575       .dwtag  DW_TAG_member
    9778                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$19)
    9779                      .dwattr $C$DW$575, DW_AT_name("CONV08")
    9780                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_CONV08")
    9781                      .dwattr $C$DW$575, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9782                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9783                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    9784                      .dwattr $C$DW$575, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9785                      .dwattr $C$DW$575, DW_AT_decl_line(0x1fd)
    9786                      .dwattr $C$DW$575, DW_AT_decl_column(0x0d)
    9787              $C$DW$576       .dwtag  DW_TAG_member
    9788                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$19)
    9789                      .dwattr $C$DW$576, DW_AT_name("CONV09")
    9790                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_CONV09")
    9791                      .dwattr $C$DW$576, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    9792                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9793                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    9794                      .dwattr $C$DW$576, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9795                      .dwattr $C$DW$576, DW_AT_decl_line(0x1fe)
    9796                      .dwattr $C$DW$576, DW_AT_decl_column(0x0d)
    9797              $C$DW$577       .dwtag  DW_TAG_member
    9798                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$19)
    9799                      .dwattr $C$DW$577, DW_AT_name("CONV10")
    9800                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_CONV10")
    9801                      .dwattr $C$DW$577, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    9802                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9803                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    9804                      .dwattr $C$DW$577, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  205

    9805                      .dwattr $C$DW$577, DW_AT_decl_line(0x1ff)
    9806                      .dwattr $C$DW$577, DW_AT_decl_column(0x0d)
    9807              $C$DW$578       .dwtag  DW_TAG_member
    9808                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$19)
    9809                      .dwattr $C$DW$578, DW_AT_name("CONV11")
    9810                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_CONV11")
    9811                      .dwattr $C$DW$578, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    9812                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9813                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    9814                      .dwattr $C$DW$578, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9815                      .dwattr $C$DW$578, DW_AT_decl_line(0x200)
    9816                      .dwattr $C$DW$578, DW_AT_decl_column(0x0d)
    9817                      .dwendtag $C$DW$T$30
    9818              
    9819                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9820                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x1fc)
    9821                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x08)
    9822              
    9823              $C$DW$T$31      .dwtag  DW_TAG_union_type
    9824                      .dwattr $C$DW$T$31, DW_AT_name("ADCCHSELSEQ3_REG")
    9825                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    9826              $C$DW$579       .dwtag  DW_TAG_member
    9827                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$19)
    9828                      .dwattr $C$DW$579, DW_AT_name("all")
    9829                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_all")
    9830                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9831                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    9832                      .dwattr $C$DW$579, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9833                      .dwattr $C$DW$579, DW_AT_decl_line(0x204)
    9834                      .dwattr $C$DW$579, DW_AT_decl_column(0x1e)
    9835              $C$DW$580       .dwtag  DW_TAG_member
    9836                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$30)
    9837                      .dwattr $C$DW$580, DW_AT_name("bit")
    9838                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_bit")
    9839                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9840                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    9841                      .dwattr $C$DW$580, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9842                      .dwattr $C$DW$580, DW_AT_decl_line(0x205)
    9843                      .dwattr $C$DW$580, DW_AT_decl_column(0x1e)
    9844                      .dwendtag $C$DW$T$31
    9845              
    9846                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9847                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x203)
    9848                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    9849              
    9850              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9851                      .dwattr $C$DW$T$32, DW_AT_name("ADCCHSELSEQ4_BITS")
    9852                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    9853              $C$DW$581       .dwtag  DW_TAG_member
    9854                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$19)
    9855                      .dwattr $C$DW$581, DW_AT_name("CONV12")
    9856                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_CONV12")
    9857                      .dwattr $C$DW$581, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9858                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9859                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  206

    9860                      .dwattr $C$DW$581, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9861                      .dwattr $C$DW$581, DW_AT_decl_line(0x209)
    9862                      .dwattr $C$DW$581, DW_AT_decl_column(0x0d)
    9863              $C$DW$582       .dwtag  DW_TAG_member
    9864                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$19)
    9865                      .dwattr $C$DW$582, DW_AT_name("CONV13")
    9866                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_CONV13")
    9867                      .dwattr $C$DW$582, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    9868                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9869                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    9870                      .dwattr $C$DW$582, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9871                      .dwattr $C$DW$582, DW_AT_decl_line(0x20a)
    9872                      .dwattr $C$DW$582, DW_AT_decl_column(0x0d)
    9873              $C$DW$583       .dwtag  DW_TAG_member
    9874                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$19)
    9875                      .dwattr $C$DW$583, DW_AT_name("CONV14")
    9876                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_CONV14")
    9877                      .dwattr $C$DW$583, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    9878                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9879                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    9880                      .dwattr $C$DW$583, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9881                      .dwattr $C$DW$583, DW_AT_decl_line(0x20b)
    9882                      .dwattr $C$DW$583, DW_AT_decl_column(0x0d)
    9883              $C$DW$584       .dwtag  DW_TAG_member
    9884                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$19)
    9885                      .dwattr $C$DW$584, DW_AT_name("CONV15")
    9886                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_CONV15")
    9887                      .dwattr $C$DW$584, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    9888                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9889                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    9890                      .dwattr $C$DW$584, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9891                      .dwattr $C$DW$584, DW_AT_decl_line(0x20c)
    9892                      .dwattr $C$DW$584, DW_AT_decl_column(0x0d)
    9893                      .dwendtag $C$DW$T$32
    9894              
    9895                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9896                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x208)
    9897                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x08)
    9898              
    9899              $C$DW$T$33      .dwtag  DW_TAG_union_type
    9900                      .dwattr $C$DW$T$33, DW_AT_name("ADCCHSELSEQ4_REG")
    9901                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    9902              $C$DW$585       .dwtag  DW_TAG_member
    9903                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$19)
    9904                      .dwattr $C$DW$585, DW_AT_name("all")
    9905                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_all")
    9906                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9907                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    9908                      .dwattr $C$DW$585, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9909                      .dwattr $C$DW$585, DW_AT_decl_line(0x210)
    9910                      .dwattr $C$DW$585, DW_AT_decl_column(0x1e)
    9911              $C$DW$586       .dwtag  DW_TAG_member
    9912                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$32)
    9913                      .dwattr $C$DW$586, DW_AT_name("bit")
    9914                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  207

    9915                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9916                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    9917                      .dwattr $C$DW$586, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9918                      .dwattr $C$DW$586, DW_AT_decl_line(0x211)
    9919                      .dwattr $C$DW$586, DW_AT_decl_column(0x1e)
    9920                      .dwendtag $C$DW$T$33
    9921              
    9922                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9923                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x20f)
    9924                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
    9925              
    9926              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9927                      .dwattr $C$DW$T$34, DW_AT_name("ADCASEQSR_BITS")
    9928                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    9929              $C$DW$587       .dwtag  DW_TAG_member
    9930                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$19)
    9931                      .dwattr $C$DW$587, DW_AT_name("SEQ1_STATE")
    9932                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_SEQ1_STATE")
    9933                      .dwattr $C$DW$587, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    9934                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9935                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    9936                      .dwattr $C$DW$587, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9937                      .dwattr $C$DW$587, DW_AT_decl_line(0x1cb)
    9938                      .dwattr $C$DW$587, DW_AT_decl_column(0x0d)
    9939              $C$DW$588       .dwtag  DW_TAG_member
    9940                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$19)
    9941                      .dwattr $C$DW$588, DW_AT_name("SEQ2_STATE")
    9942                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_SEQ2_STATE")
    9943                      .dwattr $C$DW$588, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    9944                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9945                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    9946                      .dwattr $C$DW$588, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9947                      .dwattr $C$DW$588, DW_AT_decl_line(0x1cc)
    9948                      .dwattr $C$DW$588, DW_AT_decl_column(0x0d)
    9949              $C$DW$589       .dwtag  DW_TAG_member
    9950                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$19)
    9951                      .dwattr $C$DW$589, DW_AT_name("rsvd1")
    9952                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd1")
    9953                      .dwattr $C$DW$589, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9954                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9955                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    9956                      .dwattr $C$DW$589, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9957                      .dwattr $C$DW$589, DW_AT_decl_line(0x1cd)
    9958                      .dwattr $C$DW$589, DW_AT_decl_column(0x0d)
    9959              $C$DW$590       .dwtag  DW_TAG_member
    9960                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$19)
    9961                      .dwattr $C$DW$590, DW_AT_name("SEQ_CNTR")
    9962                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_SEQ_CNTR")
    9963                      .dwattr $C$DW$590, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    9964                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9965                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    9966                      .dwattr $C$DW$590, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9967                      .dwattr $C$DW$590, DW_AT_decl_line(0x1ce)
    9968                      .dwattr $C$DW$590, DW_AT_decl_column(0x0d)
    9969              $C$DW$591       .dwtag  DW_TAG_member
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  208

    9970                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$19)
    9971                      .dwattr $C$DW$591, DW_AT_name("rsvd2")
    9972                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_rsvd2")
    9973                      .dwattr $C$DW$591, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    9974                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9975                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    9976                      .dwattr $C$DW$591, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9977                      .dwattr $C$DW$591, DW_AT_decl_line(0x1cf)
    9978                      .dwattr $C$DW$591, DW_AT_decl_column(0x0d)
    9979                      .dwendtag $C$DW$T$34
    9980              
    9981                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
    9982                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x1ca)
    9983                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
    9984              
    9985              $C$DW$T$35      .dwtag  DW_TAG_union_type
    9986                      .dwattr $C$DW$T$35, DW_AT_name("ADCASEQSR_REG")
    9987                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    9988              $C$DW$592       .dwtag  DW_TAG_member
    9989                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$19)
    9990                      .dwattr $C$DW$592, DW_AT_name("all")
    9991                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_all")
    9992                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9993                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    9994                      .dwattr $C$DW$592, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
    9995                      .dwattr $C$DW$592, DW_AT_decl_line(0x1d3)
    9996                      .dwattr $C$DW$592, DW_AT_decl_column(0x1b)
    9997              $C$DW$593       .dwtag  DW_TAG_member
    9998                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$34)
    9999                      .dwattr $C$DW$593, DW_AT_name("bit")
   10000                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_bit")
   10001                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10002                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
   10003                      .dwattr $C$DW$593, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10004                      .dwattr $C$DW$593, DW_AT_decl_line(0x1d4)
   10005                      .dwattr $C$DW$593, DW_AT_decl_column(0x1b)
   10006                      .dwendtag $C$DW$T$35
   10007              
   10008                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10009                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x1d2)
   10010                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x07)
   10011              
   10012              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10013                      .dwattr $C$DW$T$36, DW_AT_name("ADCTRL3_BITS")
   10014                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
   10015              $C$DW$594       .dwtag  DW_TAG_member
   10016                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$19)
   10017                      .dwattr $C$DW$594, DW_AT_name("SMODE_SEL")
   10018                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_SMODE_SEL")
   10019                      .dwattr $C$DW$594, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
   10020                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10021                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
   10022                      .dwattr $C$DW$594, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10023                      .dwattr $C$DW$594, DW_AT_decl_line(0x215)
   10024                      .dwattr $C$DW$594, DW_AT_decl_column(0x0e)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  209

   10025              $C$DW$595       .dwtag  DW_TAG_member
   10026                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$19)
   10027                      .dwattr $C$DW$595, DW_AT_name("ADCCLKPS")
   10028                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_ADCCLKPS")
   10029                      .dwattr $C$DW$595, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x04)
   10030                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10031                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
   10032                      .dwattr $C$DW$595, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10033                      .dwattr $C$DW$595, DW_AT_decl_line(0x216)
   10034                      .dwattr $C$DW$595, DW_AT_decl_column(0x0e)
   10035              $C$DW$596       .dwtag  DW_TAG_member
   10036                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$19)
   10037                      .dwattr $C$DW$596, DW_AT_name("ADCPWDN")
   10038                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ADCPWDN")
   10039                      .dwattr $C$DW$596, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
   10040                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10041                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
   10042                      .dwattr $C$DW$596, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10043                      .dwattr $C$DW$596, DW_AT_decl_line(0x217)
   10044                      .dwattr $C$DW$596, DW_AT_decl_column(0x0e)
   10045              $C$DW$597       .dwtag  DW_TAG_member
   10046                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$19)
   10047                      .dwattr $C$DW$597, DW_AT_name("ADCBGRFDN")
   10048                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_ADCBGRFDN")
   10049                      .dwattr $C$DW$597, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
   10050                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10051                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
   10052                      .dwattr $C$DW$597, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10053                      .dwattr $C$DW$597, DW_AT_decl_line(0x218)
   10054                      .dwattr $C$DW$597, DW_AT_decl_column(0x0e)
   10055              $C$DW$598       .dwtag  DW_TAG_member
   10056                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$19)
   10057                      .dwattr $C$DW$598, DW_AT_name("rsvd1")
   10058                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_rsvd1")
   10059                      .dwattr $C$DW$598, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
   10060                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10061                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
   10062                      .dwattr $C$DW$598, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10063                      .dwattr $C$DW$598, DW_AT_decl_line(0x219)
   10064                      .dwattr $C$DW$598, DW_AT_decl_column(0x0e)
   10065                      .dwendtag $C$DW$T$36
   10066              
   10067                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10068                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x214)
   10069                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
   10070              
   10071              $C$DW$T$37      .dwtag  DW_TAG_union_type
   10072                      .dwattr $C$DW$T$37, DW_AT_name("ADCTRL3_REG")
   10073                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
   10074              $C$DW$599       .dwtag  DW_TAG_member
   10075                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$19)
   10076                      .dwattr $C$DW$599, DW_AT_name("all")
   10077                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_all")
   10078                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10079                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  210

   10080                      .dwattr $C$DW$599, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10081                      .dwattr $C$DW$599, DW_AT_decl_line(0x21d)
   10082                      .dwattr $C$DW$599, DW_AT_decl_column(0x1a)
   10083              $C$DW$600       .dwtag  DW_TAG_member
   10084                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$36)
   10085                      .dwattr $C$DW$600, DW_AT_name("bit")
   10086                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_bit")
   10087                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10088                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
   10089                      .dwattr $C$DW$600, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10090                      .dwattr $C$DW$600, DW_AT_decl_line(0x21e)
   10091                      .dwattr $C$DW$600, DW_AT_decl_column(0x1a)
   10092                      .dwendtag $C$DW$T$37
   10093              
   10094                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10095                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x21c)
   10096                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
   10097              
   10098              $C$DW$T$38      .dwtag  DW_TAG_structure_type
   10099                      .dwattr $C$DW$T$38, DW_AT_name("ADCST_BITS")
   10100                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
   10101              $C$DW$601       .dwtag  DW_TAG_member
   10102                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$19)
   10103                      .dwattr $C$DW$601, DW_AT_name("INT_SEQ1")
   10104                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_INT_SEQ1")
   10105                      .dwattr $C$DW$601, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
   10106                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10107                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
   10108                      .dwattr $C$DW$601, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10109                      .dwattr $C$DW$601, DW_AT_decl_line(0x223)
   10110                      .dwattr $C$DW$601, DW_AT_decl_column(0x0e)
   10111              $C$DW$602       .dwtag  DW_TAG_member
   10112                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$19)
   10113                      .dwattr $C$DW$602, DW_AT_name("INT_SEQ2")
   10114                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_INT_SEQ2")
   10115                      .dwattr $C$DW$602, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
   10116                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10117                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
   10118                      .dwattr $C$DW$602, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10119                      .dwattr $C$DW$602, DW_AT_decl_line(0x224)
   10120                      .dwattr $C$DW$602, DW_AT_decl_column(0x0e)
   10121              $C$DW$603       .dwtag  DW_TAG_member
   10122                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$19)
   10123                      .dwattr $C$DW$603, DW_AT_name("SEQ1_BSY")
   10124                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_SEQ1_BSY")
   10125                      .dwattr $C$DW$603, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
   10126                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10127                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
   10128                      .dwattr $C$DW$603, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10129                      .dwattr $C$DW$603, DW_AT_decl_line(0x225)
   10130                      .dwattr $C$DW$603, DW_AT_decl_column(0x0e)
   10131              $C$DW$604       .dwtag  DW_TAG_member
   10132                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$19)
   10133                      .dwattr $C$DW$604, DW_AT_name("SEQ2_BSY")
   10134                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_SEQ2_BSY")
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  211

   10135                      .dwattr $C$DW$604, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
   10136                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10137                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
   10138                      .dwattr $C$DW$604, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10139                      .dwattr $C$DW$604, DW_AT_decl_line(0x226)
   10140                      .dwattr $C$DW$604, DW_AT_decl_column(0x0e)
   10141              $C$DW$605       .dwtag  DW_TAG_member
   10142                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$19)
   10143                      .dwattr $C$DW$605, DW_AT_name("INT_SEQ1_CLR")
   10144                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
   10145                      .dwattr $C$DW$605, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
   10146                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10147                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
   10148                      .dwattr $C$DW$605, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10149                      .dwattr $C$DW$605, DW_AT_decl_line(0x227)
   10150                      .dwattr $C$DW$605, DW_AT_decl_column(0x0e)
   10151              $C$DW$606       .dwtag  DW_TAG_member
   10152                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$19)
   10153                      .dwattr $C$DW$606, DW_AT_name("INT_SEQ2_CLR")
   10154                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
   10155                      .dwattr $C$DW$606, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
   10156                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10157                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
   10158                      .dwattr $C$DW$606, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10159                      .dwattr $C$DW$606, DW_AT_decl_line(0x228)
   10160                      .dwattr $C$DW$606, DW_AT_decl_column(0x0e)
   10161              $C$DW$607       .dwtag  DW_TAG_member
   10162                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$19)
   10163                      .dwattr $C$DW$607, DW_AT_name("EOS_BUF1")
   10164                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_EOS_BUF1")
   10165                      .dwattr $C$DW$607, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
   10166                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10167                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
   10168                      .dwattr $C$DW$607, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10169                      .dwattr $C$DW$607, DW_AT_decl_line(0x229)
   10170                      .dwattr $C$DW$607, DW_AT_decl_column(0x0e)
   10171              $C$DW$608       .dwtag  DW_TAG_member
   10172                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$19)
   10173                      .dwattr $C$DW$608, DW_AT_name("EOS_BUF2")
   10174                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_EOS_BUF2")
   10175                      .dwattr $C$DW$608, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
   10176                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10177                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
   10178                      .dwattr $C$DW$608, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10179                      .dwattr $C$DW$608, DW_AT_decl_line(0x22a)
   10180                      .dwattr $C$DW$608, DW_AT_decl_column(0x0e)
   10181              $C$DW$609       .dwtag  DW_TAG_member
   10182                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$19)
   10183                      .dwattr $C$DW$609, DW_AT_name("rsvd1")
   10184                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_rsvd1")
   10185                      .dwattr $C$DW$609, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
   10186                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10187                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
   10188                      .dwattr $C$DW$609, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10189                      .dwattr $C$DW$609, DW_AT_decl_line(0x22b)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  212

   10190                      .dwattr $C$DW$609, DW_AT_decl_column(0x0e)
   10191                      .dwendtag $C$DW$T$38
   10192              
   10193                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10194                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x222)
   10195                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
   10196              
   10197              $C$DW$T$39      .dwtag  DW_TAG_union_type
   10198                      .dwattr $C$DW$T$39, DW_AT_name("ADCST_REG")
   10199                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
   10200              $C$DW$610       .dwtag  DW_TAG_member
   10201                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$19)
   10202                      .dwattr $C$DW$610, DW_AT_name("all")
   10203                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_all")
   10204                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10205                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
   10206                      .dwattr $C$DW$610, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10207                      .dwattr $C$DW$610, DW_AT_decl_line(0x230)
   10208                      .dwattr $C$DW$610, DW_AT_decl_column(0x17)
   10209              $C$DW$611       .dwtag  DW_TAG_member
   10210                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$38)
   10211                      .dwattr $C$DW$611, DW_AT_name("bit")
   10212                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_bit")
   10213                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10214                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
   10215                      .dwattr $C$DW$611, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10216                      .dwattr $C$DW$611, DW_AT_decl_line(0x231)
   10217                      .dwattr $C$DW$611, DW_AT_decl_column(0x17)
   10218                      .dwendtag $C$DW$T$39
   10219              
   10220                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10221                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x22f)
   10222                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
   10223              
   10224              $C$DW$T$40      .dwtag  DW_TAG_structure_type
   10225                      .dwattr $C$DW$T$40, DW_AT_name("ADCREFSEL_BITS")
   10226                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
   10227              $C$DW$612       .dwtag  DW_TAG_member
   10228                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$19)
   10229                      .dwattr $C$DW$612, DW_AT_name("rsvd1")
   10230                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd1")
   10231                      .dwattr $C$DW$612, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x0e)
   10232                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10233                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
   10234                      .dwattr $C$DW$612, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10235                      .dwattr $C$DW$612, DW_AT_decl_line(0x235)
   10236                      .dwattr $C$DW$612, DW_AT_decl_column(0x0b)
   10237              $C$DW$613       .dwtag  DW_TAG_member
   10238                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$19)
   10239                      .dwattr $C$DW$613, DW_AT_name("REF_SEL")
   10240                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_REF_SEL")
   10241                      .dwattr $C$DW$613, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
   10242                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10243                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
   10244                      .dwattr $C$DW$613, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  213

   10245                      .dwattr $C$DW$613, DW_AT_decl_line(0x236)
   10246                      .dwattr $C$DW$613, DW_AT_decl_column(0x0b)
   10247                      .dwendtag $C$DW$T$40
   10248              
   10249                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10250                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x234)
   10251                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
   10252              
   10253              $C$DW$T$41      .dwtag  DW_TAG_union_type
   10254                      .dwattr $C$DW$T$41, DW_AT_name("ADCREFSEL_REG")
   10255                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
   10256              $C$DW$614       .dwtag  DW_TAG_member
   10257                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$19)
   10258                      .dwattr $C$DW$614, DW_AT_name("all")
   10259                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_all")
   10260                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10261                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
   10262                      .dwattr $C$DW$614, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10263                      .dwattr $C$DW$614, DW_AT_decl_line(0x239)
   10264                      .dwattr $C$DW$614, DW_AT_decl_column(0x0a)
   10265              $C$DW$615       .dwtag  DW_TAG_member
   10266                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$40)
   10267                      .dwattr $C$DW$615, DW_AT_name("bit")
   10268                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_bit")
   10269                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10270                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
   10271                      .dwattr $C$DW$615, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10272                      .dwattr $C$DW$615, DW_AT_decl_line(0x23a)
   10273                      .dwattr $C$DW$615, DW_AT_decl_column(0x18)
   10274                      .dwendtag $C$DW$T$41
   10275              
   10276                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10277                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x238)
   10278                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x07)
   10279              
   10280              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   10281                      .dwattr $C$DW$T$43, DW_AT_name("ADCOFFTRIM_BITS")
   10282                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
   10283              $C$DW$616       .dwtag  DW_TAG_member
   10284                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$42)
   10285                      .dwattr $C$DW$616, DW_AT_name("OFFSET_TRIM")
   10286                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_OFFSET_TRIM")
   10287                      .dwattr $C$DW$616, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
   10288                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10289                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
   10290                      .dwattr $C$DW$616, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10291                      .dwattr $C$DW$616, DW_AT_decl_line(0x23e)
   10292                      .dwattr $C$DW$616, DW_AT_decl_column(0x08)
   10293              $C$DW$617       .dwtag  DW_TAG_member
   10294                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$19)
   10295                      .dwattr $C$DW$617, DW_AT_name("rsvd1")
   10296                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_rsvd1")
   10297                      .dwattr $C$DW$617, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
   10298                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10299                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Evaluation Assembler PC v5.2.1 Sat Mar 29 19:33:00 2014

Tools Copyright (c) 1996-2009 Texas Instruments Incorporated
C:\DOCUME~1\Jordan\LOCALS~1\Temp\057803                              PAGE  214

   10300                      .dwattr $C$DW$617, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10301                      .dwattr $C$DW$617, DW_AT_decl_line(0x23f)
   10302                      .dwattr $C$DW$617, DW_AT_decl_column(0x09)
   10303                      .dwendtag $C$DW$T$43
   10304              
   10305                      .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10306                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x23d)
   10307                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x08)
   10308              
   10309              $C$DW$T$44      .dwtag  DW_TAG_union_type
   10310                      .dwattr $C$DW$T$44, DW_AT_name("ADCOFFTRIM_REG")
   10311                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
   10312              $C$DW$618       .dwtag  DW_TAG_member
   10313                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$19)
   10314                      .dwattr $C$DW$618, DW_AT_name("all")
   10315                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_all")
   10316                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10317                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
   10318                      .dwattr $C$DW$618, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10319                      .dwattr $C$DW$618, DW_AT_decl_line(0x243)
   10320                      .dwattr $C$DW$618, DW_AT_decl_column(0x0a)
   10321              $C$DW$619       .dwtag  DW_TAG_member
   10322                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$43)
   10323                      .dwattr $C$DW$619, DW_AT_name("bit")
   10324                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_bit")
   10325                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10326                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
   10327                      .dwattr $C$DW$619, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resear
   10328                      .dwattr $C$DW$619, DW_AT_decl_line(0x244)
   10329                      .dwattr $C$DW$619, DW_AT_decl_column(0x19)
   10330                      .dwendtag $C$DW$T$44
   10331              
   10332                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Documents and Settings/Jordan/My Documents/Dropbox/masc/resea
   10333                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x242)
   10334                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x07)
   10335              
   10336              $C$DW$T$45      .dwtag  DW_TAG_structure_type
   10337                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
   10338                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x1e)
   10339              $C$DW$620       .dwtag  DW_TAG_member
