TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.0 *
       3              ;* Date/Time created: Wed Dec 02 22:21:19 2009                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mainfeedbackzero.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2315              DW$126  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2316              DW$127  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2317                      .dwendtag DW$T$147
    2318              
    2319              
    2320              DW$T$148        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2321                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    2322              DW$128  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2323              DW$129  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2324              DW$130  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2325                      .dwendtag DW$T$148
    2326              
    2327              
    2328              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2329                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    2330              DW$131  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2331              DW$132  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2332                      .dwendtag DW$T$149
    2333              
    2334              
    2335              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    2336                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    2337              DW$133  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    2338                      .dwendtag DW$T$151
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   51

    2339              
    2340              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("_iq"), DW_AT_type(*DW$T$12)
    2341                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    2342              
    2343              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2344                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    2345                      .dwattr DW$T$154, DW_AT_byte_size(0x0c)
    2346              DW$134  .dwtag  DW_TAG_subrange_type
    2347                      .dwattr DW$134, DW_AT_upper_bound(0x05)
    2348                      .dwendtag DW$T$154
    2349              
    2350              
    2351              DW$T$155        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2352                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    2353                      .dwattr DW$T$155, DW_AT_byte_size(0x06)
    2354              DW$135  .dwtag  DW_TAG_subrange_type
    2355                      .dwattr DW$135, DW_AT_upper_bound(0x02)
    2356                      .dwendtag DW$T$155
    2357              
    2358              
    2359              DW$T$156        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
    2360                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    2361                      .dwattr DW$T$156, DW_AT_byte_size(0x04)
    2362              DW$136  .dwtag  DW_TAG_subrange_type
    2363                      .dwattr DW$136, DW_AT_upper_bound(0x01)
    2364                      .dwendtag DW$T$156
    2365              
    2366              
    2367              DW$T$159        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$158)
    2368                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    2369                      .dwattr DW$T$159, DW_AT_byte_size(0x0c)
    2370              DW$137  .dwtag  DW_TAG_subrange_type
    2371                      .dwattr DW$137, DW_AT_upper_bound(0x05)
    2372                      .dwendtag DW$T$159
    2373              
    2374              DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("_iq30"), DW_AT_type(*DW$T$12)
    2375                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    2376              DW$T$162        .dwtag  DW_TAG_typedef, DW_AT_name("_iq15"), DW_AT_type(*DW$T$12)
    2377                      .dwattr DW$T$162, DW_AT_language(DW_LANG_C)
    2378              DW$138  .dwtag  DW_TAG_far_type
    2379                      .dwattr DW$138, DW_AT_type(*DW$T$45)
    2380              DW$T$173        .dwtag  DW_TAG_volatile_type
    2381                      .dwattr DW$T$173, DW_AT_type(*DW$138)
    2382              DW$139  .dwtag  DW_TAG_far_type
    2383                      .dwattr DW$139, DW_AT_type(*DW$T$91)
    2384              DW$T$202        .dwtag  DW_TAG_volatile_type
    2385                      .dwattr DW$T$202, DW_AT_type(*DW$139)
    2386              DW$140  .dwtag  DW_TAG_far_type
    2387                      .dwattr DW$140, DW_AT_type(*DW$T$109)
    2388              DW$T$209        .dwtag  DW_TAG_volatile_type
    2389                      .dwattr DW$T$209, DW_AT_type(*DW$140)
    2390              DW$141  .dwtag  DW_TAG_far_type
    2391                      .dwattr DW$141, DW_AT_type(*DW$T$111)
    2392              DW$T$210        .dwtag  DW_TAG_volatile_type
    2393                      .dwattr DW$T$210, DW_AT_type(*DW$141)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   52

    2394              DW$142  .dwtag  DW_TAG_far_type
    2395                      .dwattr DW$142, DW_AT_type(*DW$T$120)
    2396              DW$T$214        .dwtag  DW_TAG_volatile_type
    2397                      .dwattr DW$T$214, DW_AT_type(*DW$142)
    2398              
    2399              DW$T$124        .dwtag  DW_TAG_structure_type
    2400                      .dwattr DW$T$124, DW_AT_name("PIE_VECT_TABLE")
    2401                      .dwattr DW$T$124, DW_AT_byte_size(0x100)
    2402              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2403                      .dwattr DW$143, DW_AT_name("PIE1_RESERVED"), DW_AT_symbol_name("_PIE1_RESERVED")
    2404                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2406              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2407                      .dwattr DW$144, DW_AT_name("PIE2_RESERVED"), DW_AT_symbol_name("_PIE2_RESERVED")
    2408                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2409                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2410              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2411                      .dwattr DW$145, DW_AT_name("PIE3_RESERVED"), DW_AT_symbol_name("_PIE3_RESERVED")
    2412                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2413                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2414              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2415                      .dwattr DW$146, DW_AT_name("PIE4_RESERVED"), DW_AT_symbol_name("_PIE4_RESERVED")
    2416                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2417                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2418              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2419                      .dwattr DW$147, DW_AT_name("PIE5_RESERVED"), DW_AT_symbol_name("_PIE5_RESERVED")
    2420                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2421                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2422              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2423                      .dwattr DW$148, DW_AT_name("PIE6_RESERVED"), DW_AT_symbol_name("_PIE6_RESERVED")
    2424                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2425                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2426              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2427                      .dwattr DW$149, DW_AT_name("PIE7_RESERVED"), DW_AT_symbol_name("_PIE7_RESERVED")
    2428                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2429                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2430              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2431                      .dwattr DW$150, DW_AT_name("PIE8_RESERVED"), DW_AT_symbol_name("_PIE8_RESERVED")
    2432                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2433                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2434              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2435                      .dwattr DW$151, DW_AT_name("PIE9_RESERVED"), DW_AT_symbol_name("_PIE9_RESERVED")
    2436                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2437                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2438              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2439                      .dwattr DW$152, DW_AT_name("PIE10_RESERVED"), DW_AT_symbol_name("_PIE10_RESERVED")
    2440                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2441                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2442              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2443                      .dwattr DW$153, DW_AT_name("PIE11_RESERVED"), DW_AT_symbol_name("_PIE11_RESERVED")
    2444                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2445                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2446              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2447                      .dwattr DW$154, DW_AT_name("PIE12_RESERVED"), DW_AT_symbol_name("_PIE12_RESERVED")
    2448                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   53

    2449                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2450              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2451                      .dwattr DW$155, DW_AT_name("PIE13_RESERVED"), DW_AT_symbol_name("_PIE13_RESERVED")
    2452                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2453                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2454              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2455                      .dwattr DW$156, DW_AT_name("XINT13"), DW_AT_symbol_name("_XINT13")
    2456                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2457                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2458              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2459                      .dwattr DW$157, DW_AT_name("TINT2"), DW_AT_symbol_name("_TINT2")
    2460                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2461                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2462              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2463                      .dwattr DW$158, DW_AT_name("DATALOG"), DW_AT_symbol_name("_DATALOG")
    2464                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2465                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2466              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2467                      .dwattr DW$159, DW_AT_name("RTOSINT"), DW_AT_symbol_name("_RTOSINT")
    2468                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2469                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2470              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2471                      .dwattr DW$160, DW_AT_name("EMUINT"), DW_AT_symbol_name("_EMUINT")
    2472                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2473                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2474              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2475                      .dwattr DW$161, DW_AT_name("XNMI"), DW_AT_symbol_name("_XNMI")
    2476                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2477                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2478              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2479                      .dwattr DW$162, DW_AT_name("ILLEGAL"), DW_AT_symbol_name("_ILLEGAL")
    2480                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2481                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2482              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2483                      .dwattr DW$163, DW_AT_name("USER1"), DW_AT_symbol_name("_USER1")
    2484                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2485                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2486              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2487                      .dwattr DW$164, DW_AT_name("USER2"), DW_AT_symbol_name("_USER2")
    2488                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2489                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2490              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2491                      .dwattr DW$165, DW_AT_name("USER3"), DW_AT_symbol_name("_USER3")
    2492                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2493                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2494              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2495                      .dwattr DW$166, DW_AT_name("USER4"), DW_AT_symbol_name("_USER4")
    2496                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2497                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2498              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2499                      .dwattr DW$167, DW_AT_name("USER5"), DW_AT_symbol_name("_USER5")
    2500                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2501                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2502              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2503                      .dwattr DW$168, DW_AT_name("USER6"), DW_AT_symbol_name("_USER6")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   54

    2504                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2505                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2506              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2507                      .dwattr DW$169, DW_AT_name("USER7"), DW_AT_symbol_name("_USER7")
    2508                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2509                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2510              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2511                      .dwattr DW$170, DW_AT_name("USER8"), DW_AT_symbol_name("_USER8")
    2512                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2513                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2514              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2515                      .dwattr DW$171, DW_AT_name("USER9"), DW_AT_symbol_name("_USER9")
    2516                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2517                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2518              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2519                      .dwattr DW$172, DW_AT_name("USER10"), DW_AT_symbol_name("_USER10")
    2520                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2521                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2522              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2523                      .dwattr DW$173, DW_AT_name("USER11"), DW_AT_symbol_name("_USER11")
    2524                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2525                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2526              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2527                      .dwattr DW$174, DW_AT_name("USER12"), DW_AT_symbol_name("_USER12")
    2528                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2529                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2530              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2531                      .dwattr DW$175, DW_AT_name("SEQ1INT"), DW_AT_symbol_name("_SEQ1INT")
    2532                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2533                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2534              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2535                      .dwattr DW$176, DW_AT_name("SEQ2INT"), DW_AT_symbol_name("_SEQ2INT")
    2536                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2537                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2538              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2539                      .dwattr DW$177, DW_AT_name("rsvd1_3"), DW_AT_symbol_name("_rsvd1_3")
    2540                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2541                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2542              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2543                      .dwattr DW$178, DW_AT_name("XINT1"), DW_AT_symbol_name("_XINT1")
    2544                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2545                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2546              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2547                      .dwattr DW$179, DW_AT_name("XINT2"), DW_AT_symbol_name("_XINT2")
    2548                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2549                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2550              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2551                      .dwattr DW$180, DW_AT_name("ADCINT"), DW_AT_symbol_name("_ADCINT")
    2552                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2553                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2554              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2555                      .dwattr DW$181, DW_AT_name("TINT0"), DW_AT_symbol_name("_TINT0")
    2556                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2557                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2558              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   55

    2559                      .dwattr DW$182, DW_AT_name("WAKEINT"), DW_AT_symbol_name("_WAKEINT")
    2560                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2561                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2562              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2563                      .dwattr DW$183, DW_AT_name("EPWM1_TZINT"), DW_AT_symbol_name("_EPWM1_TZINT")
    2564                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2565                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2566              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2567                      .dwattr DW$184, DW_AT_name("EPWM2_TZINT"), DW_AT_symbol_name("_EPWM2_TZINT")
    2568                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2569                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2570              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2571                      .dwattr DW$185, DW_AT_name("EPWM3_TZINT"), DW_AT_symbol_name("_EPWM3_TZINT")
    2572                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2573                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2574              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2575                      .dwattr DW$186, DW_AT_name("EPWM4_TZINT"), DW_AT_symbol_name("_EPWM4_TZINT")
    2576                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2577                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2578              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2579                      .dwattr DW$187, DW_AT_name("EPWM5_TZINT"), DW_AT_symbol_name("_EPWM5_TZINT")
    2580                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2581                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2582              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2583                      .dwattr DW$188, DW_AT_name("EPWM6_TZINT"), DW_AT_symbol_name("_EPWM6_TZINT")
    2584                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2585                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2586              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2587                      .dwattr DW$189, DW_AT_name("rsvd2_7"), DW_AT_symbol_name("_rsvd2_7")
    2588                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2589                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2590              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2591                      .dwattr DW$190, DW_AT_name("rsvd2_8"), DW_AT_symbol_name("_rsvd2_8")
    2592                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2593                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2594              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2595                      .dwattr DW$191, DW_AT_name("EPWM1_INT"), DW_AT_symbol_name("_EPWM1_INT")
    2596                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2597                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2598              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2599                      .dwattr DW$192, DW_AT_name("EPWM2_INT"), DW_AT_symbol_name("_EPWM2_INT")
    2600                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2601                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2602              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2603                      .dwattr DW$193, DW_AT_name("EPWM3_INT"), DW_AT_symbol_name("_EPWM3_INT")
    2604                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2605                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2606              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2607                      .dwattr DW$194, DW_AT_name("EPWM4_INT"), DW_AT_symbol_name("_EPWM4_INT")
    2608                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2609                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2610              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2611                      .dwattr DW$195, DW_AT_name("EPWM5_INT"), DW_AT_symbol_name("_EPWM5_INT")
    2612                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2613                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   56

    2614              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2615                      .dwattr DW$196, DW_AT_name("EPWM6_INT"), DW_AT_symbol_name("_EPWM6_INT")
    2616                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2617                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2618              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2619                      .dwattr DW$197, DW_AT_name("rsvd3_7"), DW_AT_symbol_name("_rsvd3_7")
    2620                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2621                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2622              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2623                      .dwattr DW$198, DW_AT_name("rsvd3_8"), DW_AT_symbol_name("_rsvd3_8")
    2624                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2625                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2626              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2627                      .dwattr DW$199, DW_AT_name("ECAP1_INT"), DW_AT_symbol_name("_ECAP1_INT")
    2628                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2629                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2630              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2631                      .dwattr DW$200, DW_AT_name("ECAP2_INT"), DW_AT_symbol_name("_ECAP2_INT")
    2632                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2633                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2634              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2635                      .dwattr DW$201, DW_AT_name("ECAP3_INT"), DW_AT_symbol_name("_ECAP3_INT")
    2636                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2637                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2638              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2639                      .dwattr DW$202, DW_AT_name("ECAP4_INT"), DW_AT_symbol_name("_ECAP4_INT")
    2640                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2641                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2642              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2643                      .dwattr DW$203, DW_AT_name("rsvd4_5"), DW_AT_symbol_name("_rsvd4_5")
    2644                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2645                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2646              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2647                      .dwattr DW$204, DW_AT_name("rsvd4_6"), DW_AT_symbol_name("_rsvd4_6")
    2648                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2649                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2650              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2651                      .dwattr DW$205, DW_AT_name("rsvd4_7"), DW_AT_symbol_name("_rsvd4_7")
    2652                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2653                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2654              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2655                      .dwattr DW$206, DW_AT_name("rsvd4_8"), DW_AT_symbol_name("_rsvd4_8")
    2656                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2657                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2658              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2659                      .dwattr DW$207, DW_AT_name("EQEP1_INT"), DW_AT_symbol_name("_EQEP1_INT")
    2660                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2661                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2662              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2663                      .dwattr DW$208, DW_AT_name("EQEP2_INT"), DW_AT_symbol_name("_EQEP2_INT")
    2664                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2665                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2666              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2667                      .dwattr DW$209, DW_AT_name("rsvd5_3"), DW_AT_symbol_name("_rsvd5_3")
    2668                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   57

    2669                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2670              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2671                      .dwattr DW$210, DW_AT_name("rsvd5_4"), DW_AT_symbol_name("_rsvd5_4")
    2672                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2673                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2674              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2675                      .dwattr DW$211, DW_AT_name("rsvd5_5"), DW_AT_symbol_name("_rsvd5_5")
    2676                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2677                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2678              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2679                      .dwattr DW$212, DW_AT_name("rsvd5_6"), DW_AT_symbol_name("_rsvd5_6")
    2680                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2681                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2682              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2683                      .dwattr DW$213, DW_AT_name("rsvd5_7"), DW_AT_symbol_name("_rsvd5_7")
    2684                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2685                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2686              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2687                      .dwattr DW$214, DW_AT_name("rsvd5_8"), DW_AT_symbol_name("_rsvd5_8")
    2688                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2689                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2690              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2691                      .dwattr DW$215, DW_AT_name("SPIRXINTA"), DW_AT_symbol_name("_SPIRXINTA")
    2692                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2693                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2694              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2695                      .dwattr DW$216, DW_AT_name("SPITXINTA"), DW_AT_symbol_name("_SPITXINTA")
    2696                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2697                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2698              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2699                      .dwattr DW$217, DW_AT_name("SPIRXINTB"), DW_AT_symbol_name("_SPIRXINTB")
    2700                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2701                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2702              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2703                      .dwattr DW$218, DW_AT_name("SPITXINTB"), DW_AT_symbol_name("_SPITXINTB")
    2704                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2705                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2706              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2707                      .dwattr DW$219, DW_AT_name("SPIRXINTC"), DW_AT_symbol_name("_SPIRXINTC")
    2708                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2709                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2710              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2711                      .dwattr DW$220, DW_AT_name("SPITXINTC"), DW_AT_symbol_name("_SPITXINTC")
    2712                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2713                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2714              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2715                      .dwattr DW$221, DW_AT_name("SPIRXINTD"), DW_AT_symbol_name("_SPIRXINTD")
    2716                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2717                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2718              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2719                      .dwattr DW$222, DW_AT_name("SPITXINTD"), DW_AT_symbol_name("_SPITXINTD")
    2720                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2721                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2722              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2723                      .dwattr DW$223, DW_AT_name("rsvd7_1"), DW_AT_symbol_name("_rsvd7_1")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   58

    2724                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2725                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2726              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2727                      .dwattr DW$224, DW_AT_name("rsvd7_2"), DW_AT_symbol_name("_rsvd7_2")
    2728                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2729                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2730              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2731                      .dwattr DW$225, DW_AT_name("rsvd7_3"), DW_AT_symbol_name("_rsvd7_3")
    2732                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2733                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2734              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2735                      .dwattr DW$226, DW_AT_name("rsvd7_4"), DW_AT_symbol_name("_rsvd7_4")
    2736                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2737                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2738              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2739                      .dwattr DW$227, DW_AT_name("rsvd7_5"), DW_AT_symbol_name("_rsvd7_5")
    2740                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2741                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2742              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2743                      .dwattr DW$228, DW_AT_name("rsvd7_6"), DW_AT_symbol_name("_rsvd7_6")
    2744                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2745                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2746              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2747                      .dwattr DW$229, DW_AT_name("rsvd7_7"), DW_AT_symbol_name("_rsvd7_7")
    2748                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2749                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2750              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2751                      .dwattr DW$230, DW_AT_name("rsvd7_8"), DW_AT_symbol_name("_rsvd7_8")
    2752                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2753                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2754              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2755                      .dwattr DW$231, DW_AT_name("I2CINT1A"), DW_AT_symbol_name("_I2CINT1A")
    2756                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2757                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2758              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2759                      .dwattr DW$232, DW_AT_name("I2CINT2A"), DW_AT_symbol_name("_I2CINT2A")
    2760                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2761                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2762              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2763                      .dwattr DW$233, DW_AT_name("rsvd8_3"), DW_AT_symbol_name("_rsvd8_3")
    2764                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2765                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2766              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2767                      .dwattr DW$234, DW_AT_name("rsvd8_4"), DW_AT_symbol_name("_rsvd8_4")
    2768                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2769                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2770              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2771                      .dwattr DW$235, DW_AT_name("rsvd8_5"), DW_AT_symbol_name("_rsvd8_5")
    2772                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2773                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2774              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2775                      .dwattr DW$236, DW_AT_name("rsvd8_6"), DW_AT_symbol_name("_rsvd8_6")
    2776                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2777                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2778              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   59

    2779                      .dwattr DW$237, DW_AT_name("rsvd8_7"), DW_AT_symbol_name("_rsvd8_7")
    2780                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2781                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2782              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2783                      .dwattr DW$238, DW_AT_name("rsvd8_8"), DW_AT_symbol_name("_rsvd8_8")
    2784                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2785                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2786              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2787                      .dwattr DW$239, DW_AT_name("SCIRXINTA"), DW_AT_symbol_name("_SCIRXINTA")
    2788                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2789                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2790              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2791                      .dwattr DW$240, DW_AT_name("SCITXINTA"), DW_AT_symbol_name("_SCITXINTA")
    2792                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2793                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2794              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2795                      .dwattr DW$241, DW_AT_name("SCIRXINTB"), DW_AT_symbol_name("_SCIRXINTB")
    2796                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2797                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2798              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2799                      .dwattr DW$242, DW_AT_name("SCITXINTB"), DW_AT_symbol_name("_SCITXINTB")
    2800                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2801                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2802              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2803                      .dwattr DW$243, DW_AT_name("ECAN0INTA"), DW_AT_symbol_name("_ECAN0INTA")
    2804                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2805                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2806              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2807                      .dwattr DW$244, DW_AT_name("ECAN1INTA"), DW_AT_symbol_name("_ECAN1INTA")
    2808                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2809                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2810              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2811                      .dwattr DW$245, DW_AT_name("ECAN0INTB"), DW_AT_symbol_name("_ECAN0INTB")
    2812                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2813                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2814              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2815                      .dwattr DW$246, DW_AT_name("ECAN1INTB"), DW_AT_symbol_name("_ECAN1INTB")
    2816                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2817                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2818              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2819                      .dwattr DW$247, DW_AT_name("rsvd10_1"), DW_AT_symbol_name("_rsvd10_1")
    2820                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2821                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2822              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2823                      .dwattr DW$248, DW_AT_name("rsvd10_2"), DW_AT_symbol_name("_rsvd10_2")
    2824                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2825                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2826              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2827                      .dwattr DW$249, DW_AT_name("rsvd10_3"), DW_AT_symbol_name("_rsvd10_3")
    2828                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2829                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2830              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2831                      .dwattr DW$250, DW_AT_name("rsvd10_4"), DW_AT_symbol_name("_rsvd10_4")
    2832                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2833                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   60

    2834              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2835                      .dwattr DW$251, DW_AT_name("rsvd10_5"), DW_AT_symbol_name("_rsvd10_5")
    2836                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2837                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2838              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2839                      .dwattr DW$252, DW_AT_name("rsvd10_6"), DW_AT_symbol_name("_rsvd10_6")
    2840                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2841                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2842              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2843                      .dwattr DW$253, DW_AT_name("rsvd10_7"), DW_AT_symbol_name("_rsvd10_7")
    2844                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2845                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2846              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2847                      .dwattr DW$254, DW_AT_name("rsvd10_8"), DW_AT_symbol_name("_rsvd10_8")
    2848                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2849                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2850              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2851                      .dwattr DW$255, DW_AT_name("rsvd11_1"), DW_AT_symbol_name("_rsvd11_1")
    2852                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2853                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2854              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2855                      .dwattr DW$256, DW_AT_name("rsvd11_2"), DW_AT_symbol_name("_rsvd11_2")
    2856                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2857                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2858              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2859                      .dwattr DW$257, DW_AT_name("rsvd11_3"), DW_AT_symbol_name("_rsvd11_3")
    2860                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2861                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2862              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2863                      .dwattr DW$258, DW_AT_name("rsvd11_4"), DW_AT_symbol_name("_rsvd11_4")
    2864                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2865                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2866              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2867                      .dwattr DW$259, DW_AT_name("rsvd11_5"), DW_AT_symbol_name("_rsvd11_5")
    2868                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2869                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2870              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2871                      .dwattr DW$260, DW_AT_name("rsvd11_6"), DW_AT_symbol_name("_rsvd11_6")
    2872                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2873                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2874              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2875                      .dwattr DW$261, DW_AT_name("rsvd11_7"), DW_AT_symbol_name("_rsvd11_7")
    2876                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2877                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2878              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2879                      .dwattr DW$262, DW_AT_name("rsvd11_8"), DW_AT_symbol_name("_rsvd11_8")
    2880                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2881                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2882              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2883                      .dwattr DW$263, DW_AT_name("rsvd12_1"), DW_AT_symbol_name("_rsvd12_1")
    2884                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2885                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2886              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2887                      .dwattr DW$264, DW_AT_name("rsvd12_2"), DW_AT_symbol_name("_rsvd12_2")
    2888                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   61

    2889                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2890              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2891                      .dwattr DW$265, DW_AT_name("rsvd12_3"), DW_AT_symbol_name("_rsvd12_3")
    2892                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2893                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2894              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2895                      .dwattr DW$266, DW_AT_name("rsvd12_4"), DW_AT_symbol_name("_rsvd12_4")
    2896                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2897                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2898              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2899                      .dwattr DW$267, DW_AT_name("rsvd12_5"), DW_AT_symbol_name("_rsvd12_5")
    2900                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2901                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2902              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2903                      .dwattr DW$268, DW_AT_name("rsvd12_6"), DW_AT_symbol_name("_rsvd12_6")
    2904                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2905                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2906              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2907                      .dwattr DW$269, DW_AT_name("rsvd12_7"), DW_AT_symbol_name("_rsvd12_7")
    2908                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2909                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2910              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    2911                      .dwattr DW$270, DW_AT_name("rsvd12_8"), DW_AT_symbol_name("_rsvd12_8")
    2912                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2913                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2914                      .dwendtag DW$T$124
    2915              
    2916              DW$271  .dwtag  DW_TAG_far_type
    2917                      .dwattr DW$271, DW_AT_type(*DW$T$144)
    2918              DW$T$217        .dwtag  DW_TAG_volatile_type
    2919                      .dwattr DW$T$217, DW_AT_type(*DW$271)
    2920              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("PINT"), DW_AT_type(*DW$T$122)
    2921                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    2922              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2923                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2924                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2925              DW$T$158        .dwtag  DW_TAG_typedef, DW_AT_name("_iq28"), DW_AT_type(*DW$T$12)
    2926                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    2927              
    2928              DW$T$45 .dwtag  DW_TAG_structure_type
    2929                      .dwattr DW$T$45, DW_AT_name("ADC_REGS")
    2930                      .dwattr DW$T$45, DW_AT_byte_size(0x1e)
    2931              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2932                      .dwattr DW$272, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
    2933                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2934                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2935              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2936                      .dwattr DW$273, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
    2937                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2938                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2939              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2940                      .dwattr DW$274, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
    2941                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2942                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2943              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   62

    2944                      .dwattr DW$275, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
    2945                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2946                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2947              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2948                      .dwattr DW$276, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
    2949                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2950                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2951              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2952                      .dwattr DW$277, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
    2953                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2954                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2955              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2956                      .dwattr DW$278, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
    2957                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2958                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2959              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2960                      .dwattr DW$279, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
    2961                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2962                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2963              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2964                      .dwattr DW$280, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
    2965                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2966                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2967              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2968                      .dwattr DW$281, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
    2969                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2970                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2971              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2972                      .dwattr DW$282, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
    2973                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2974                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2975              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2976                      .dwattr DW$283, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
    2977                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2978                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2979              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2980                      .dwattr DW$284, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
    2981                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2982                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2983              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2984                      .dwattr DW$285, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
    2985                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2986                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2987              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2988                      .dwattr DW$286, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
    2989                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2990                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2991              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2992                      .dwattr DW$287, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
    2993                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2994                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2995              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2996                      .dwattr DW$288, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
    2997                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2998                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   63

    2999              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3000                      .dwattr DW$289, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
    3001                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3002                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3003              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3004                      .dwattr DW$290, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
    3005                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3006                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3007              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3008                      .dwattr DW$291, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
    3009                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3010                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3011              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3012                      .dwattr DW$292, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
    3013                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3014                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3015              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3016                      .dwattr DW$293, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
    3017                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3018                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3019              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3020                      .dwattr DW$294, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
    3021                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3022                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3023              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3024                      .dwattr DW$295, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
    3025                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3026                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3027              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3028                      .dwattr DW$296, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
    3029                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3030                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3031              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3032                      .dwattr DW$297, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
    3033                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3034                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3035              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3036                      .dwattr DW$298, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3037                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3038                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3039              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3040                      .dwattr DW$299, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3041                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3042                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3043              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3044                      .dwattr DW$300, DW_AT_name("ADCREFSEL"), DW_AT_symbol_name("_ADCREFSEL")
    3045                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3046                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3047              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3048                      .dwattr DW$301, DW_AT_name("ADCOFFTRIM"), DW_AT_symbol_name("_ADCOFFTRIM")
    3049                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3050                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3051                      .dwendtag DW$T$45
    3052              
    3053              
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   64

    3054              DW$T$91 .dwtag  DW_TAG_structure_type
    3055                      .dwattr DW$T$91, DW_AT_name("EPWM_REGS")
    3056                      .dwattr DW$T$91, DW_AT_byte_size(0x22)
    3057              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3058                      .dwattr DW$302, DW_AT_name("TBCTL"), DW_AT_symbol_name("_TBCTL")
    3059                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3060                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3061              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3062                      .dwattr DW$303, DW_AT_name("TBSTS"), DW_AT_symbol_name("_TBSTS")
    3063                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3064                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3065              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3066                      .dwattr DW$304, DW_AT_name("TBPHS"), DW_AT_symbol_name("_TBPHS")
    3067                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3068                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3069              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3070                      .dwattr DW$305, DW_AT_name("TBCTR"), DW_AT_symbol_name("_TBCTR")
    3071                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3072                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3073              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3074                      .dwattr DW$306, DW_AT_name("TBPRD"), DW_AT_symbol_name("_TBPRD")
    3075                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3076                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3077              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3078                      .dwattr DW$307, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3079                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3080                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3081              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3082                      .dwattr DW$308, DW_AT_name("CMPCTL"), DW_AT_symbol_name("_CMPCTL")
    3083                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3084                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3085              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    3086                      .dwattr DW$309, DW_AT_name("CMPA"), DW_AT_symbol_name("_CMPA")
    3087                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3088                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3089              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3090                      .dwattr DW$310, DW_AT_name("CMPB"), DW_AT_symbol_name("_CMPB")
    3091                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3092                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3093              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3094                      .dwattr DW$311, DW_AT_name("AQCTLA"), DW_AT_symbol_name("_AQCTLA")
    3095                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3096                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3097              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3098                      .dwattr DW$312, DW_AT_name("AQCTLB"), DW_AT_symbol_name("_AQCTLB")
    3099                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3100                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3101              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3102                      .dwattr DW$313, DW_AT_name("AQSFRC"), DW_AT_symbol_name("_AQSFRC")
    3103                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3104                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3105              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3106                      .dwattr DW$314, DW_AT_name("AQCSFRC"), DW_AT_symbol_name("_AQCSFRC")
    3107                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3108                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   65

    3109              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3110                      .dwattr DW$315, DW_AT_name("DBCTL"), DW_AT_symbol_name("_DBCTL")
    3111                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3112                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3113              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3114                      .dwattr DW$316, DW_AT_name("DBRED"), DW_AT_symbol_name("_DBRED")
    3115                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3116                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3117              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3118                      .dwattr DW$317, DW_AT_name("DBFED"), DW_AT_symbol_name("_DBFED")
    3119                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3120                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3121              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3122                      .dwattr DW$318, DW_AT_name("TZSEL"), DW_AT_symbol_name("_TZSEL")
    3123                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3124                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3125              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3126                      .dwattr DW$319, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3127                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3128                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3129              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3130                      .dwattr DW$320, DW_AT_name("TZCTL"), DW_AT_symbol_name("_TZCTL")
    3131                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3132                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3134                      .dwattr DW$321, DW_AT_name("TZEINT"), DW_AT_symbol_name("_TZEINT")
    3135                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3136                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3137              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3138                      .dwattr DW$322, DW_AT_name("TZFLG"), DW_AT_symbol_name("_TZFLG")
    3139                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3140                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3141              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3142                      .dwattr DW$323, DW_AT_name("TZCLR"), DW_AT_symbol_name("_TZCLR")
    3143                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3144                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3145              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3146                      .dwattr DW$324, DW_AT_name("TZFRC"), DW_AT_symbol_name("_TZFRC")
    3147                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3148                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3149              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    3150                      .dwattr DW$325, DW_AT_name("ETSEL"), DW_AT_symbol_name("_ETSEL")
    3151                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3152                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3153              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3154                      .dwattr DW$326, DW_AT_name("ETPS"), DW_AT_symbol_name("_ETPS")
    3155                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3156                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3157              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3158                      .dwattr DW$327, DW_AT_name("ETFLG"), DW_AT_symbol_name("_ETFLG")
    3159                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3160                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3161              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3162                      .dwattr DW$328, DW_AT_name("ETCLR"), DW_AT_symbol_name("_ETCLR")
    3163                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   66

    3164                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3165              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3166                      .dwattr DW$329, DW_AT_name("ETFRC"), DW_AT_symbol_name("_ETFRC")
    3167                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3168                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3169              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3170                      .dwattr DW$330, DW_AT_name("PCCTL"), DW_AT_symbol_name("_PCCTL")
    3171                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3172                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3173              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3174                      .dwattr DW$331, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3175                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3176                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3177              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3178                      .dwattr DW$332, DW_AT_name("HRCNFG"), DW_AT_symbol_name("_HRCNFG")
    3179                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3180                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3181                      .dwendtag DW$T$91
    3182              
    3183              
    3184              DW$T$109        .dwtag  DW_TAG_structure_type
    3185                      .dwattr DW$T$109, DW_AT_name("GPIO_CTRL_REGS")
    3186                      .dwattr DW$T$109, DW_AT_byte_size(0x40)
    3187              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3188                      .dwattr DW$333, DW_AT_name("GPACTRL"), DW_AT_symbol_name("_GPACTRL")
    3189                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3190                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3191              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3192                      .dwattr DW$334, DW_AT_name("GPAQSEL1"), DW_AT_symbol_name("_GPAQSEL1")
    3193                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3194                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3195              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3196                      .dwattr DW$335, DW_AT_name("GPAQSEL2"), DW_AT_symbol_name("_GPAQSEL2")
    3197                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3198                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3199              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3200                      .dwattr DW$336, DW_AT_name("GPAMUX1"), DW_AT_symbol_name("_GPAMUX1")
    3201                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3202                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3203              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3204                      .dwattr DW$337, DW_AT_name("GPAMUX2"), DW_AT_symbol_name("_GPAMUX2")
    3205                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3206                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3207              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3208                      .dwattr DW$338, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3209                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3210                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3211              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3212                      .dwattr DW$339, DW_AT_name("GPAPUD"), DW_AT_symbol_name("_GPAPUD")
    3213                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3214                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3215              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3216                      .dwattr DW$340, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3217                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3218                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   67

    3219              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3220                      .dwattr DW$341, DW_AT_name("GPBCTRL"), DW_AT_symbol_name("_GPBCTRL")
    3221                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3222                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3223              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3224                      .dwattr DW$342, DW_AT_name("GPBQSEL1"), DW_AT_symbol_name("_GPBQSEL1")
    3225                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3226                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3227              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3228                      .dwattr DW$343, DW_AT_name("GPBQSEL2"), DW_AT_symbol_name("_GPBQSEL2")
    3229                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3230                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3231              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3232                      .dwattr DW$344, DW_AT_name("GPBMUX1"), DW_AT_symbol_name("_GPBMUX1")
    3233                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3234                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3235              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3236                      .dwattr DW$345, DW_AT_name("GPBMUX2"), DW_AT_symbol_name("_GPBMUX2")
    3237                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3238                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3239              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3240                      .dwattr DW$346, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3241                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3242                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3243              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3244                      .dwattr DW$347, DW_AT_name("GPBPUD"), DW_AT_symbol_name("_GPBPUD")
    3245                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3246                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3247              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    3248                      .dwattr DW$348, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3249                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3250                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3251                      .dwendtag DW$T$109
    3252              
    3253              
    3254              DW$T$111        .dwtag  DW_TAG_structure_type
    3255                      .dwattr DW$T$111, DW_AT_name("GPIO_DATA_REGS")
    3256                      .dwattr DW$T$111, DW_AT_byte_size(0x20)
    3257              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3258                      .dwattr DW$349, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3259                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3260                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3261              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3262                      .dwattr DW$350, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3263                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3264                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3265              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3266                      .dwattr DW$351, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3267                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3268                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3269              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3270                      .dwattr DW$352, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3271                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3272                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3273              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   68

    3274                      .dwattr DW$353, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3275                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3276                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3277              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3278                      .dwattr DW$354, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3279                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3280                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3281              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3282                      .dwattr DW$355, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3283                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3284                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3285              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3286                      .dwattr DW$356, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3287                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3288                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3289              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    3290                      .dwattr DW$357, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3291                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3292                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3293                      .dwendtag DW$T$111
    3294              
    3295              
    3296              DW$T$120        .dwtag  DW_TAG_structure_type
    3297                      .dwattr DW$T$120, DW_AT_name("PIE_CTRL_REGS")
    3298                      .dwattr DW$T$120, DW_AT_byte_size(0x1a)
    3299              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3300                      .dwattr DW$358, DW_AT_name("PIECTRL"), DW_AT_symbol_name("_PIECTRL")
    3301                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3302                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3303              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3304                      .dwattr DW$359, DW_AT_name("PIEACK"), DW_AT_symbol_name("_PIEACK")
    3305                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3306                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3307              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3308                      .dwattr DW$360, DW_AT_name("PIEIER1"), DW_AT_symbol_name("_PIEIER1")
    3309                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3310                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3311              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3312                      .dwattr DW$361, DW_AT_name("PIEIFR1"), DW_AT_symbol_name("_PIEIFR1")
    3313                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3314                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3315              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3316                      .dwattr DW$362, DW_AT_name("PIEIER2"), DW_AT_symbol_name("_PIEIER2")
    3317                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3318                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3319              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3320                      .dwattr DW$363, DW_AT_name("PIEIFR2"), DW_AT_symbol_name("_PIEIFR2")
    3321                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3322                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3323              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3324                      .dwattr DW$364, DW_AT_name("PIEIER3"), DW_AT_symbol_name("_PIEIER3")
    3325                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3326                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3327              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3328                      .dwattr DW$365, DW_AT_name("PIEIFR3"), DW_AT_symbol_name("_PIEIFR3")
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   69

    3329                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3330                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3331              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3332                      .dwattr DW$366, DW_AT_name("PIEIER4"), DW_AT_symbol_name("_PIEIER4")
    3333                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3334                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3335              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3336                      .dwattr DW$367, DW_AT_name("PIEIFR4"), DW_AT_symbol_name("_PIEIFR4")
    3337                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3338                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3339              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3340                      .dwattr DW$368, DW_AT_name("PIEIER5"), DW_AT_symbol_name("_PIEIER5")
    3341                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3342                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3343              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3344                      .dwattr DW$369, DW_AT_name("PIEIFR5"), DW_AT_symbol_name("_PIEIFR5")
    3345                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3346                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3347              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3348                      .dwattr DW$370, DW_AT_name("PIEIER6"), DW_AT_symbol_name("_PIEIER6")
    3349                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3350                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3351              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3352                      .dwattr DW$371, DW_AT_name("PIEIFR6"), DW_AT_symbol_name("_PIEIFR6")
    3353                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3354                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3355              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3356                      .dwattr DW$372, DW_AT_name("PIEIER7"), DW_AT_symbol_name("_PIEIER7")
    3357                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3358                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3359              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3360                      .dwattr DW$373, DW_AT_name("PIEIFR7"), DW_AT_symbol_name("_PIEIFR7")
    3361                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3362                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3363              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3364                      .dwattr DW$374, DW_AT_name("PIEIER8"), DW_AT_symbol_name("_PIEIER8")
    3365                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3366                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3367              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3368                      .dwattr DW$375, DW_AT_name("PIEIFR8"), DW_AT_symbol_name("_PIEIFR8")
    3369                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3370                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3371              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3372                      .dwattr DW$376, DW_AT_name("PIEIER9"), DW_AT_symbol_name("_PIEIER9")
    3373                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3374                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3375              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3376                      .dwattr DW$377, DW_AT_name("PIEIFR9"), DW_AT_symbol_name("_PIEIFR9")
    3377                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3378                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3379              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3380                      .dwattr DW$378, DW_AT_name("PIEIER10"), DW_AT_symbol_name("_PIEIER10")
    3381                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3382                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3383              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
TMS320C2000 COFF Assembler PC v4.1.0 Wed Dec 02 22:21:19 2009

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8842                            PAGE   70

    3384                      .dwattr DW$379, DW_AT_name("PIEIFR10"), DW_AT_symbol_name("_PIEIFR10")
    3385                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3386                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3387              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3388                      .dwattr DW$380, DW_AT_name("PIEIER11"), DW_AT_symbol_name("_PIEIER11")
    3389                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3390                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3391              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3392                      .dwattr DW$381, DW_AT_name("PIEIFR11"), DW_AT_symbol_name("_PIEIFR11")
    3393                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3394                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3395              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3396                      .dwattr DW$382, DW_AT_name("PIEIER12"), DW_AT_symbol_name("_PIEIER12")
    3397                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3398                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3399              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3400                      .dwattr DW$383, DW_AT_name("PIEIFR12"), DW_AT_symbol_name("_PIEIFR12")
    3401                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3402                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3403                      .dwendtag DW$T$120
    3404              
    3405              
    3406              DW$T$144        .dwtag  DW_TAG_structure_type
    3407                      .dwattr DW$T$144, DW_AT_name("SYS_CTRL_REGS")
    3408                      .dwattr DW$T$144, DW_AT_byte_size(0x20)
    3409              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    3410                      .dwattr DW$384, DW_AT_name("XCLK"), DW_AT_symbol_name("_XCLK")
    3411                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3412                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3413              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    3414                      .dwattr DW$385, DW_AT_name("PLLSTS"), DW_AT_symbol_name("_PLLSTS")
    3415                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3416                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3417              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    3418                      .dwattr DW$386, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
